#ifndef __BIND_H__
#define __BIND_H__
#pragma once

/* ---------- headers */

/* ---------- constants */

/* ---------- definitions */

class boost::_bi::value<wchar_t const *>
{
public:
    _inline value<wchar_t const *>(wchar_t const *const &);
    _inline wchar_t const *const &get() const;
    wchar_t const *&get();
private:
    wchar_t const *t_; // 0x0
};
static_assert(sizeof(boost::_bi::value<wchar_t const *>) == 4, "Invalid boost::_bi::value<wchar_t const *> size");

class boost::_bi::value<char const *>
{
public:
    _inline value<char const *>(char const *const &);
    _inline char const *const &get() const;
    char const *&get();
private:
    char const *t_; // 0x0
};
static_assert(sizeof(boost::_bi::value<char const *>) == 4, "Invalid boost::_bi::value<char const *> size");

class boost::_bi::value<unsigned int *>
{
public:
    _inline value<unsigned int *>(unsigned __int32 *const &);
    _inline unsigned __int32 *const &get() const;
    unsigned __int32 *&get();
private:
    unsigned __int32 *t_; // 0x0
};
static_assert(sizeof(boost::_bi::value<unsigned int *>) == 4, "Invalid boost::_bi::value<unsigned int *> size");

class boost::_bi::value<wchar_t * *>
{
public:
    _inline value<wchar_t * *>(wchar_t **const &);
    _inline wchar_t **const &get() const;
    wchar_t **&get();
private:
    wchar_t **t_; // 0x0
};
static_assert(sizeof(boost::_bi::value<wchar_t * *>) == 4, "Invalid boost::_bi::value<wchar_t * *> size");

class boost::_bi::value<LocalizerResourceUCS::Line *>
{
public:
    _inline value<LocalizerResourceUCS::Line *>(LocalizerResourceUCS::Line *const &);
    _inline LocalizerResourceUCS::Line *const &get() const;
    LocalizerResourceUCS::Line *&get();
private:
    LocalizerResourceUCS::Line *t_; // 0x0
};
static_assert(sizeof(boost::_bi::value<LocalizerResourceUCS::Line *>) == 4, "Invalid boost::_bi::value<LocalizerResourceUCS::Line *> size");

class boost::_bi::type<bool>
{
};
static_assert(sizeof(boost::_bi::type<bool>) == 1, "Invalid boost::_bi::type<bool> size");

class boost::_bi::list0
{
public:
    list0();
};
static_assert(sizeof(boost::_bi::list0) == 1, "Invalid boost::_bi::list0 size");

class boost::_bi::list1<wchar_t &>
{
public:
    _inline list1<wchar_t &>(wchar_t &);
    wchar_t &operator[](boost::arg<1> (*)()) const;
    _inline wchar_t &operator[](boost::arg<1>) const;
private:
    wchar_t &a1_; // 0x0
};
static_assert(sizeof(boost::_bi::list1<wchar_t &>) == 4, "Invalid boost::_bi::list1<wchar_t &> size");

class boost::_bi::list1<LocalizerImp::ResEntry &>
{
public:
    _inline list1<LocalizerImp::ResEntry &>(LocalizerImp::ResEntry &);
    LocalizerImp::ResEntry &operator[](boost::arg<1> (*)()) const;
    _inline LocalizerImp::ResEntry &operator[](boost::arg<1>) const;
private:
    LocalizerImp::ResEntry &a1_; // 0x0
};
static_assert(sizeof(boost::_bi::list1<LocalizerImp::ResEntry &>) == 4, "Invalid boost::_bi::list1<LocalizerImp::ResEntry &> size");

class boost::_bi::list2<boost::arg<1>,boost::_bi::value<wchar_t const *> >
{
public:
    _inline list2<boost::arg<1>,boost::_bi::value<wchar_t const *> >(boost::arg<1>, boost::_bi::value<wchar_t const *>);
    boost::_bi::value<wchar_t const *> operator[](boost::arg<2> (*)()) const;
    boost::arg<1> operator[](boost::arg<1> (*)()) const;
    boost::_bi::value<wchar_t const *> operator[](boost::arg<2>) const;
    boost::arg<1> operator[](boost::arg<1>) const;
private:
    boost::arg<1> a1_; // 0x0
    boost::_bi::value<wchar_t const *> a2_; // 0x4
};
static_assert(sizeof(boost::_bi::list2<boost::arg<1>,boost::_bi::value<wchar_t const *> >) == 8, "Invalid boost::_bi::list2<boost::arg<1>,boost::_bi::value<wchar_t const *> > size");

class boost::_bi::list2<boost::arg<1>,boost::_bi::value<char const *> >
{
public:
    _inline list2<boost::arg<1>,boost::_bi::value<char const *> >(boost::arg<1>, boost::_bi::value<char const *>);
    boost::_bi::value<char const *> operator[](boost::arg<2> (*)()) const;
    boost::arg<1> operator[](boost::arg<1> (*)()) const;
    boost::_bi::value<char const *> operator[](boost::arg<2>) const;
    boost::arg<1> operator[](boost::arg<1>) const;
private:
    boost::arg<1> a1_; // 0x0
    boost::_bi::value<char const *> a2_; // 0x4
};
static_assert(sizeof(boost::_bi::list2<boost::arg<1>,boost::_bi::value<char const *> >) == 8, "Invalid boost::_bi::list2<boost::arg<1>,boost::_bi::value<char const *> > size");

class boost::_bi::list4<wchar_t const * &,wchar_t const * &,wchar_t const * &,wchar_t const * &>
{
public:
    _inline list4<wchar_t const * &,wchar_t const * &,wchar_t const * &,wchar_t const * &>(wchar_t const *&, wchar_t const *&, wchar_t const *&, wchar_t const *&);
    wchar_t const *&operator[](boost::arg<4> (*)()) const;
    wchar_t const *&operator[](boost::arg<3> (*)()) const;
    wchar_t const *&operator[](boost::arg<2> (*)()) const;
    wchar_t const *&operator[](boost::arg<1> (*)()) const;
    _inline wchar_t const *&operator[](boost::arg<4>) const;
    _inline wchar_t const *&operator[](boost::arg<3>) const;
    _inline wchar_t const *&operator[](boost::arg<2>) const;
    _inline wchar_t const *&operator[](boost::arg<1>) const;
private:
    wchar_t const *&a1_; // 0x0
    wchar_t const *&a2_; // 0x4
    wchar_t const *&a3_; // 0x8
    wchar_t const *&a4_; // 0xC
};
static_assert(sizeof(boost::_bi::list4<wchar_t const * &,wchar_t const * &,wchar_t const * &,wchar_t const * &>) == 16, "Invalid boost::_bi::list4<wchar_t const * &,wchar_t const * &,wchar_t const * &,wchar_t const * &> size");

class boost::_bi::list6<boost::arg<1>,boost::arg<2>,boost::arg<3>,boost::arg<4>,boost::_bi::value<unsigned int *>,boost::_bi::value<unsigned int *> >
{
public:
    _inline list6<boost::arg<1>,boost::arg<2>,boost::arg<3>,boost::arg<4>,boost::_bi::value<unsigned int *>,boost::_bi::value<unsigned int *> >(boost::arg<1>, boost::arg<2>, boost::arg<3>, boost::arg<4>, boost::_bi::value<unsigned int *>, boost::_bi::value<unsigned int *>);
    boost::_bi::value<unsigned int *> operator[](boost::arg<6> (*)()) const;
    boost::_bi::value<unsigned int *> operator[](boost::arg<5> (*)()) const;
    boost::arg<4> operator[](boost::arg<4> (*)()) const;
    boost::arg<3> operator[](boost::arg<3> (*)()) const;
    boost::arg<2> operator[](boost::arg<2> (*)()) const;
    boost::arg<1> operator[](boost::arg<1> (*)()) const;
    boost::_bi::value<unsigned int *> operator[](boost::arg<6>) const;
    boost::_bi::value<unsigned int *> operator[](boost::arg<5>) const;
    boost::arg<4> operator[](boost::arg<4>) const;
    boost::arg<3> operator[](boost::arg<3>) const;
    boost::arg<2> operator[](boost::arg<2>) const;
    boost::arg<1> operator[](boost::arg<1>) const;
private:
    boost::arg<1> a1_; // 0x0
    boost::arg<2> a2_; // 0x1
    boost::arg<3> a3_; // 0x2
    boost::arg<4> a4_; // 0x3
    boost::_bi::value<unsigned int *> a5_; // 0x4
    boost::_bi::value<unsigned int *> a6_; // 0x8
};
static_assert(sizeof(boost::_bi::list6<boost::arg<1>,boost::arg<2>,boost::arg<3>,boost::arg<4>,boost::_bi::value<unsigned int *>,boost::_bi::value<unsigned int *> >) == 12, "Invalid boost::_bi::list6<boost::arg<1>,boost::arg<2>,boost::arg<3>,boost::arg<4>,boost::_bi::value<unsigned int *>,boost::_bi::value<unsigned int *> > size");

class boost::_bi::list7<boost::arg<1>,boost::arg<2>,boost::arg<3>,boost::arg<4>,boost::_bi::value<LocalizerResourceUCS::Line *>,boost::_bi::value<unsigned int *>,boost::_bi::value<wchar_t * *> >
{
public:
    _inline list7<boost::arg<1>,boost::arg<2>,boost::arg<3>,boost::arg<4>,boost::_bi::value<LocalizerResourceUCS::Line *>,boost::_bi::value<unsigned int *>,boost::_bi::value<wchar_t * *> >(boost::arg<1>, boost::arg<2>, boost::arg<3>, boost::arg<4>, boost::_bi::value<LocalizerResourceUCS::Line *>, boost::_bi::value<unsigned int *>, boost::_bi::value<wchar_t * *>);
    boost::_bi::value<wchar_t * *> operator[](boost::arg<7> (*)()) const;
    boost::_bi::value<unsigned int *> operator[](boost::arg<6> (*)()) const;
    boost::_bi::value<LocalizerResourceUCS::Line *> operator[](boost::arg<5> (*)()) const;
    boost::arg<4> operator[](boost::arg<4> (*)()) const;
    boost::arg<3> operator[](boost::arg<3> (*)()) const;
    boost::arg<2> operator[](boost::arg<2> (*)()) const;
    boost::arg<1> operator[](boost::arg<1> (*)()) const;
    boost::_bi::value<wchar_t * *> operator[](boost::arg<7>) const;
    boost::_bi::value<unsigned int *> operator[](boost::arg<6>) const;
    boost::_bi::value<LocalizerResourceUCS::Line *> operator[](boost::arg<5>) const;
    boost::arg<4> operator[](boost::arg<4>) const;
    boost::arg<3> operator[](boost::arg<3>) const;
    boost::arg<2> operator[](boost::arg<2>) const;
    boost::arg<1> operator[](boost::arg<1>) const;
private:
    boost::arg<1> a1_; // 0x0
    boost::arg<2> a2_; // 0x1
    boost::arg<3> a3_; // 0x2
    boost::arg<4> a4_; // 0x3
    boost::_bi::value<LocalizerResourceUCS::Line *> a5_; // 0x4
    boost::_bi::value<unsigned int *> a6_; // 0x8
    boost::_bi::value<wchar_t * *> a7_; // 0xC
};
static_assert(sizeof(boost::_bi::list7<boost::arg<1>,boost::arg<2>,boost::arg<3>,boost::arg<4>,boost::_bi::value<LocalizerResourceUCS::Line *>,boost::_bi::value<unsigned int *>,boost::_bi::value<wchar_t * *> >) == 16, "Invalid boost::_bi::list7<boost::arg<1>,boost::arg<2>,boost::arg<3>,boost::arg<4>,boost::_bi::value<LocalizerResourceUCS::Line *>,boost::_bi::value<unsigned int *>,boost::_bi::value<wchar_t * *> > size");

class boost::_bi::bind_t<bool,bool (__stdcall*)(wchar_t,wchar_t const *),boost::_bi::list2<boost::arg<1>,boost::_bi::value<wchar_t const *> > >
{
public:
    bind_t<bool,bool (__stdcall*)(wchar_t,wchar_t const *),boost::_bi::list2<boost::arg<1>,boost::_bi::value<wchar_t const *> > >(bool (*)(wchar_t, wchar_t const *), boost::_bi::list2<boost::arg<1>,boost::_bi::value<wchar_t const *> > const &);
    typedef bool result_type;
    bool operator()() const;
    bool operator()();
private:
    bool (*f_)(wchar_t, wchar_t const *); // 0x0
    boost::_bi::list2<boost::arg<1>,boost::_bi::value<wchar_t const *> > l_; // 0x4
};
static_assert(sizeof(boost::_bi::bind_t<bool,bool (__stdcall*)(wchar_t,wchar_t const *),boost::_bi::list2<boost::arg<1>,boost::_bi::value<wchar_t const *> > >) == 12, "Invalid boost::_bi::bind_t<bool,bool (__stdcall*)(wchar_t,wchar_t const *),boost::_bi::list2<boost::arg<1>,boost::_bi::value<wchar_t const *> > > size");

class boost::_bi::bind_t<bool,bool (__stdcall*)(LocalizerImp::ResEntry const &,char const *),boost::_bi::list2<boost::arg<1>,boost::_bi::value<char const *> > >
{
public:
    bind_t<bool,bool (__stdcall*)(LocalizerImp::ResEntry const &,char const *),boost::_bi::list2<boost::arg<1>,boost::_bi::value<char const *> > >(bool (*)(LocalizerImp::ResEntry const &, char const *), boost::_bi::list2<boost::arg<1>,boost::_bi::value<char const *> > const &);
    typedef bool result_type;
    bool operator()() const;
    bool operator()();
private:
    bool (*f_)(LocalizerImp::ResEntry const &, char const *); // 0x0
    boost::_bi::list2<boost::arg<1>,boost::_bi::value<char const *> > l_; // 0x4
};
static_assert(sizeof(boost::_bi::bind_t<bool,bool (__stdcall*)(LocalizerImp::ResEntry const &,char const *),boost::_bi::list2<boost::arg<1>,boost::_bi::value<char const *> > >) == 12, "Invalid boost::_bi::bind_t<bool,bool (__stdcall*)(LocalizerImp::ResEntry const &,char const *),boost::_bi::list2<boost::arg<1>,boost::_bi::value<char const *> > > size");

class boost::_bi::bind_t<bool,bool (__stdcall*)(wchar_t const *,wchar_t const *,wchar_t const *,wchar_t const *,unsigned int *,unsigned int *),boost::_bi::list6<boost::arg<1>,boost::arg<2>,boost::arg<3>,boost::arg<4>,boost::_bi::value<unsigned int *>,boost::_bi::value<unsigned int *> > >
{
public:
    bind_t<bool,bool (__stdcall*)(wchar_t const *,wchar_t const *,wchar_t const *,wchar_t const *,unsigned int *,unsigned int *),boost::_bi::list6<boost::arg<1>,boost::arg<2>,boost::arg<3>,boost::arg<4>,boost::_bi::value<unsigned int *>,boost::_bi::value<unsig(bool (*)(wchar_t const *, wchar_t const *, wchar_t const *, wchar_t const *, unsigned __int32 *, unsigned __int32 *), boost::_bi::list6<boost::arg<1>,boost::arg<2>,boost::arg<3>,boost::arg<4>,boost::_bi::value<unsigned int *>,boost::_bi::value<unsigned int *> > const &);
    typedef bool result_type;
    bool operator()() const;
    bool operator()();
private:
    bool (*f_)(wchar_t const *, wchar_t const *, wchar_t const *, wchar_t const *, unsigned __int32 *, unsigned __int32 *); // 0x0
    boost::_bi::list6<boost::arg<1>,boost::arg<2>,boost::arg<3>,boost::arg<4>,boost::_bi::value<unsigned int *>,boost::_bi::value<unsigned int *> > l_; // 0x4
};
static_assert(sizeof(boost::_bi::bind_t<bool,bool (__stdcall*)(wchar_t const *,wchar_t const *,wchar_t const *,wchar_t const *,unsigned int *,unsigned int *),boost::_bi::list6<boost::arg<1>,boost::arg<2>,boost::arg<3>,boost::arg<4>,boost::_bi::value<unsigned int *>,boost::_bi::value<unsigned int *> > >) == 16, "Invalid boost::_bi::bind_t<bool,bool (__stdcall*)(wchar_t const *,wchar_t const *,wchar_t const *,wchar_t const *,unsigned int *,unsigned int *),boost::_bi::list6<boost::arg<1>,boost::arg<2>,boost::arg<3>,boost::arg<4>,boost::_bi::value<unsigned int *>,boost::_bi::value<unsigned int *> > > size");

