#if 0
/* ---------- headers */

#include "decomp.h"
#include <task.h>
#include <assist\stlexsmallvector.h>
#include <stack>
#include <boost\static_assert.hpp>
#include <xstring>
#include <Mathlib\matrix4.h>
#include <xmemory0>
#include <boost\shared_array.hpp>
#include <platform\cmdline.h>
#include <pch.h>
#include <malloc.h>
#include <renderer.h>
#include <Render\gl\types.h>
#include <Collision\Primitives\capsule.h>
#include <Sob\DustCloud\DustCloudGroupManager.h>
#include <Mathlib\matvec.h>
#include <Collision\Primitives\segment.h>
#include <Collision\BVH\profiling.h>
#include <weaponinfo.h>
#include <Mathlib\matrix3.h>
#include <Render\gl\lotypes.h>
#include <Modifiers\ModifierTargetCache.h>
#include <SensorsBlobs.h>
#include <dbdefines.h>
#include <Render\objects\compiledtext.h>
#include <MetaSelTarg.h>
#include <UnitCaps\UnitCaps.h>
#include <TeamColourRegistry.h>
#include <new>
#include <savegame.h>
#include <SOBGroupManager.h>
#include <exception>
#include <xstddef>
#include <hash_map>
#include <Render\gl\r_types.h>
#include <type_traits>
#include <xhash>
#include <SobWithMeshStatic.h>
#include <Render\objects\debugrender.h>
#include <Sob\Resource\Resource.h>
#include <SobWithMesh.h>
#include <ParadeCommand.h>
#include <SobRigidBody.h>
#include <commandtype.h>
#include <ITweak.h>
#include <xutility>
#include <SobRigidBodyStatic.h>
#include <SensorsManager.h>
#include <Tactics.h>
#include <utility>
#include <Camera\OrbitParameters.h>
#include <iosfwd>

#include <CameraCommand.h>
#include <sobid.h>
#include <boost\scoped_ptr.hpp>
#include <CameraHW.h>
#include <Camera\CameraOrbitTarget.h>
#include <Camera\Camera.h>
#include <OrderFeedback.h>
#include <Camera\Frustum.h>
#include <HyperspaceManager.h>
#include <Camera\Plane3.h>
#include <SquadronList.h>
#include <CameraTuning.h>
#include <Mathlib\vector2.h>
#include <util\types.h>
#include <playerresourcetype.h>
#include <seInterface2\SampleID.h>
#include <seInterface2\SampleBase.h>
#include <boost\cstdint.hpp>
#include <boost\config.hpp>
#include <SoundManager\SoundEntityHandle.h>
#include <platform\timer.h>
#include <Render\objects\draw.h>
#include <platform\platformexports.h>
#include <boost\scoped_array.hpp>
#include <Render\objects\material.h>
#include <Collision\Primitives\obb.h>
#include <gameSettings.h>
#include <Mathlib\quat.h>
#include <config.h>
#include <syncChecking.h>
#include <assist\typemagic.h>
#include <SelTarg.h>
#include <Collision\BVH\octree.h>
#include <luaconfig\luabinding.h>
#include <prim.h>
#include <Collision\BVH\span.h>
#include <luaconfig\luaconfig.h>
#include <Mathlib\mathlibdll.h>
#include <Collision\BVH\Internal\span_i.h>
#include <MainUI.h>
#include <Mathlib\fastmath.h>
#include <Collision\BVH\proxy.h>
#include <Render\objects\core.h>
#include <Selector.h>
#include <Collision\intersect.h>
#include <Collision\primitivesfwd.h>
#include <pathpoints.h>
#include <debug\db.h>
#include <Render\objects\cliprect.h>
#include <seInterface2\sedefinesshared.h>
#include <deque>
#include <Interpolation.h>
#include <DynamicPoint.h>
#include <util\colour.h>
#include <boost\shared_ptr.hpp>
#include <Collision\Primitives\aabb.h>
#include <LevelDesc.h>
#include <sobtypes.h>
#include <scripting.h>
#include <boost\throw_exception.hpp>
#include <Hash.h>
#include <scriptaccess.h>
#include <selection.h>
#include <command.h>
#include <gameRenderDebug.h>
#include <fileio\md5.h>
#include <scripttypedef.h>
#include <savegamedef.h>
#include <Render\objects\fontsystem.h>
#include <boost\detail\shared_count.hpp>
#include <Render\objects\objects.h>
#include <bitset>
#include <Render\objects\bitmapfont.h>
#include <Parade.h>
#include <boost\detail\lwm_win32.hpp>
#include <lua.h>
#include <MeshAnimation.h>
#include <gamestructimpl.h>
#include <abilities.h>
#include <Sob\Resource\ResourceStatic.h>
#include <Badge.h>
#include <localizer\localizer.h>
#include <Squadron.h>
#include <ship.h>
#include <ShieldTypes.h>
#include <seInterface2\PatchID.h>
#include <Pieplate.h>
#include <seInterface2\PatchBase.h>
#include <fixedpoint.h>
#include <seInterface2\SoundParams.h>
#include <wchar.h>
#include <util\fixed.h>
#include <swprintf.inl>
#include <Subsystems\HardPointManager.h>
#include <queue>
#include <platform\osdef.h>
#include <Subsystems\HardPoint.h>
#include <Subsystems\HardPointStatic.h>
#include <Subsystems\SubSystemType.h>

/* ---------- constants */

enum `anonymous-namespace'::EffectState
{
    ES_On = 0,
    ES_Off,
    ES_Done,
};

/* ---------- definitions */

struct pieplateOption
{
    vector4 innerPieColour; // 0x0
    vector4 rangePieColour; // 0x10
    vector4 outerPieColour; // 0x20
    _inline pieplateOption(); /* compiler_generated() */
};
static_assert(sizeof(pieplateOption) == 48, "Invalid pieplateOption size");

typedef `anonymous-namespace'::EffectState ?A0x15f9cf6c::EffectState;

/* ---------- prototypes */

extern void pieCalcCirclePointsInXZ(vector3 const &origin, float const radius, FatVertex *fat, __int32 const numfats, float const angledir);
extern void pieCalcRadialTicksInXZ(FatVertex *fat, vector3 const &origin, float radiusInner, float radiusOuter, float angleInc, float angleStart, __int32 nTicks);
extern void pieDrawCircleInXZ(vector3 const &origin, float const radius, __int32 const segments, vector4 const &col);
extern void pieCalcCirclePoints(vector3 const &origin, matrix3 const &orientation, float const radius, FatVertex *fat, __int32 const numfats, float const angledir);
extern void pieDrawCircle(vector3 const &origin, matrix3 const &orientation, float const radius, __int32 const segments, vector4 const &col);
extern void transformProjectPoint(vector3 const &point, matrix4 const &modelview, matrix4 const &projection, float &outX, float &outY, float &outZ, float &outW);
extern float pieFindMaxSobRadius(Selection const &sel);
extern void pieDetermineDiscConnectionInXZ(vector3 const &start, vector3 const &circlePos, float circleRadius, vector3 &connectionPoint);
extern void pieDetermineDiscConnection(vector3 const &start, vector3 const &circlePos, float circleRadius, matrix3 const &circleOrientation, vector3 &connectionPoint);
extern void pieScreenSizeOfCircleComputeMinMax(vector3 const &position, float minSize, float maxSize, float inRadius, float &outRadius, __int32 &nSegments, matrix4 const &modelView, matrix4 const &projection);
extern void pieScreenSizeOfCircleCompute(vector3 const &position, float inRadius, float &outRadius, __int32 &nSegments, matrix4 const &modelView, matrix4 const &projection);
extern bool convert3dCoordsTo2d(vector3 const &in, matrix4 const &modelviewMatrix, matrix4 const &projectionMatrix, float *outmousex, float *outmousey);

/* ---------- globals */

extern __int32 pieTwkPiePieces; // 0x83C788
extern __int32 pieTwkHorizonPieces; // 0x83C78C
extern float pieTwkMinimumMoveToDiscSize; // 0x83C790
extern float pieTwkPieClosestDistance; // 0x83C794
extern float pieTwkMaxMovementDist; // 0x83C798
extern float pieTwkHorizontalHashMarkLength; // 0x83C79C
extern float pieTwkVerticalHashMarkLength; // 0x83C7A0
extern float pieTwkHeightSnap; // 0x83C7A4
extern float pieTwkShipCloseToPlaneDistance; // 0x83C7A8
extern float pieTwkPieCircleSizeMax; // 0x83C7AC
extern float pieTwkPieCircleSizeMin; // 0x83C7B0
extern float pieTwkHeightFactor; // 0x83C7B4
extern float pieTwkBoxAngleFactor; // 0x83C7B8
extern float pieTwkScaleUpTime; // 0x83C7BC
extern float pieTwkScaleDownTime; // 0x83C7C0
extern bool pieTwkSeperateDiscs; // 0x849EB8
extern float pieTwkBlobThreshold; // 0x83C7C4
extern vector4 pieTwkMoveToDiscColour; // 0x83C7D0
extern vector4 pieTwkMoveToPlanarDiscColour; // 0x83C7E0
extern vector4 pieTwkMoveToDiscColourInvalid; // 0x83C7F0
extern vector4 pieTwkMoveToPlanarDiscColourInvalid; // 0x83C800
extern vector4 pieTwkShipOnPlaneColour; // 0x83C810
extern vector4 pieTwkClosestShipOnPlaneColour; // 0x83C820
extern vector4 pieTwkMovementDistanceReadout; // 0x83C830
extern vector4 pieTwkInvalidDestinationColour; // 0x83C840
extern char pieTwkMoveDistanceFont[8]; // 0x83C7C8
extern pieplateOption pieplateOptions[52]; // 0x849EC0

/* ---------- private variables */

/* ---------- public code */

_extern void _sub_619927(Pieplate::Data *const, vector3 const &);
_inline void Pieplate::Data::setOrigin(vector3 const &) // 0x619927
{
    mangled_assert("?setOrigin@Data@Pieplate@@QAEXABVvector3@@@Z");
    todo("implement");
    _sub_619927(this, arg);
}

_extern void _sub_619915(Pieplate::Data *const, Selection const &);
_inline void Pieplate::Data::setOrigin(Selection const &) // 0x619915
{
    mangled_assert("?setOrigin@Data@Pieplate@@QAEXABVSelection@@@Z");
    todo("implement");
    _sub_619915(this, arg);
}

_extern void _sub_619818(Pieplate::Data *const);
_inline void Pieplate::Data::resetOrigin() // 0x619818
{
    mangled_assert("?resetOrigin@Data@Pieplate@@QAEXXZ");
    todo("implement");
    _sub_619818(this);
}

_extern _sub_615D2D(Pieplate *const);
Pieplate::Pieplate() // 0x615D2D
{
    mangled_assert("??0Pieplate@@QAE@XZ");
    todo("implement");
