#if 0
/* ---------- headers */

#include "decomp.h"
#include <sobelem.h>
#include <assist\stlexsmallvector.h>
#include <xstring>
#include <sob.h>
#include <xmemory0>
#include <sobid.h>
#include <pch.h>
#include <Collision\Primitives\obb.h>
#include <Mathlib\matrix3.h>
#include <new>
#include <exception>
#include <xstddef>
#include <type_traits>
#include <SelTarg.h>
#include <prim.h>
#include <xutility>
#include <utility>
#include <iosfwd>
#include <gamemsg.h>
#include <vector>
#include <fileio\bytestream.h>
#include <xmemory>
#include <Collision\Primitives\capsule.h>
#include <Collision\Primitives\segment.h>
#include <Collision\BVH\profiling.h>
#include <list>
#include <Mathlib\vector3.h>
#include <fixedpoint.h>
#include <util\fixed.h>
#include <seInterface2\PatchID.h>
#include <seInterface2\PatchBase.h>
#include <xtree>
#include <seInterface2\SoundParams.h>
#include <random.h>
#include <boost\scoped_ptr.hpp>
#include <dbdefines.h>
#include <UnitCaps\UnitCaps.h>
#include <MultiplierContainer.h>
#include <visibility.h>
#include <SOBGroupManager.h>
#include <Mathlib\vector2.h>
#include <MultiplierTypes.h>
#include <hash_map>
#include <Collision\BVH\bvh.h>
#include <xhash>
#include <util\types.h>
#include <boost\cstdint.hpp>
#include <Mathlib\quat.h>
#include <SaveGameObjectRegistry.h>
#include <savegameimpl.h>
#include <savegamedatainfo.h>
#include <pathpoints.h>
#include <debug\db.h>
#include <HyperspaceManager.h>
#include <SquadronList.h>
#include <deque>
#include <Physics\PhysicsEngine.h>
#include <Physics\PhysicsObject.h>
#include <boost\shared_ptr.hpp>
#include <util\colour.h>
#include <sobstatic.h>
#include <sobtypes.h>
#include <boost\throw_exception.hpp>
#include <selection.h>
#include <Collision\Primitives\sphere.h>
#include <savegamedef.h>
#include <boost\detail\shared_count.hpp>
#include <bitset>
#include <boost\detail\lwm_win32.hpp>
#include <Universe.h>
#include <Collision\BVH\octree.h>
#include <Waypoint.h>
#include <platform\timer.h>
#include <Collision\BVH\span.h>
#include <SobUnmoveable.h>
#include <platform\platformexports.h>
#include <Collision\BVH\Internal\span_i.h>
#include <Collision\BVH\proxy.h>
#include <Collision\intersect.h>
#include <Collision\primitivesfwd.h>
#include <savestream.h>
#include <wchar.h>
#include <Interpolation.h>
#include <Collision\Primitives\aabb.h>

/* ---------- constants */

/* ---------- definitions */

struct SaveGameData::writeRandomStream::__l2::<unnamed-type-parameters>
{
    unsigned __int32 x; // 0x0
    unsigned __int32 y; // 0x4
    unsigned __int32 z; // 0x8
    unsigned __int32 c; // 0xC
    unsigned __int32 n; // 0x10
};
static_assert(sizeof(SaveGameData::writeRandomStream::__l2::<unnamed-type-parameters>) == 20, "Invalid SaveGameData::writeRandomStream::__l2::<unnamed-type-parameters> size");

struct SaveGameData::readRandomStream::__l2::<unnamed-type-parameters>
{
    unsigned __int32 x; // 0x0
    unsigned __int32 y; // 0x4
    unsigned __int32 z; // 0x8
    unsigned __int32 c; // 0xC
    unsigned __int32 n; // 0x10
};
static_assert(sizeof(SaveGameData::readRandomStream::__l2::<unnamed-type-parameters>) == 20, "Invalid SaveGameData::readRandomStream::__l2::<unnamed-type-parameters> size");

/* ---------- prototypes */

/* ---------- globals */

extern std::list<Saveable *,std::allocator<Saveable *> > SaveGameData::m_saveables; // 0x84AEC0

/* ---------- private variables */

_static
{
    extern char const HEADER_Token[15]; // 0x7AEF18
    extern char const OBJECT_DatabaseToken[10]; // 0x7AEF28
    extern char const OBJECT_DatabaseEndToken[11]; // 0x7AEF34
    extern char const SAVEOBJECT_Token[10]; // 0x7AEF40
    extern char const SAVEOBJECT_EndToken[11]; // 0x7AEF4C
}

/* ---------- public code */

_extern _sub_628048(SaveGameData *const, char const *, StreamMode, SaveStreamType, SaveStreamWriteMode);
SaveGameData::SaveGameData(char const *, StreamMode, SaveStreamType, SaveStreamWriteMode) // 0x628048
{
    mangled_assert("??0SaveGameData@@QAE@PBDW4StreamMode@@W4SaveStreamType@@W4SaveStreamWriteMode@@@Z");
    todo("implement");
    _sub_628048(this, arg, arg, arg, arg);
}

_extern void _sub_6280EA(std::_Deque_const_iterator<std::_Deque_val<std::_Deque_simple_types<void *> > > *const);
_inline std::_Deque_const_iterator<std::_Deque_val<std::_Deque_simple_types<void *> > >::~_Deque_const_iterator<std::_Deque_val<std::_Deque_simple_types<void *> > >() // 0x6280EA
{
    mangled_assert("??1?$_Deque_const_iterator@V?$_Deque_val@U?$_Deque_simple_types@PAX@std@@@std@@@std@@QAE@XZ");
    compiler_generated();
    todo("implement");
    _sub_6280EA(this);
}

