#if 0
#ifndef __INTERFACEELEMENT_H__
#define __INTERFACEELEMENT_H__
#pragma once

/* ---------- headers */

/* ---------- constants */

/* ---------- definitions */

class UI::InterfaceElement
{
public:
    typedef bool (*SortFunc)(UI::InterfaceElement const *, UI::InterfaceElement const *);
    InterfaceElement(UI::InterfaceElement const &);
    InterfaceElement(LuaConfig &);
    InterfaceElement(UI::InterfaceElement *, char const *);
    virtual ~InterfaceElement();
    virtual _inline UI::InterfaceElement *clone();
    UI::InterfaceElement const &CopyNoChildren(UI::InterfaceElement const &);
    UI::InterfaceElement const &operator=(UI::InterfaceElement const &);
    static UI::InterfaceElement *NewCreate(LuaConfig &lc, char const *typeName);
    static _inline void BindKeyBinder(void (*functionCB)(unsigned __int32, wchar_t const *, wchar_t *, unsigned __int32));
    virtual void Draw2(Vector_2i const &, Rect_i const &);
    virtual void AddChildR(UI::InterfaceElement *);
    virtual UI::InterfaceElement *RemoveChildR(UI::InterfaceElement *);
    void Click(Vector_2i const &, UI::MouseButton const &);
    void DoubleClick(Vector_2i const &, UI::MouseButton const &);
    _inline std::list<UI::InterfaceElement *,std::allocator<UI::InterfaceElement *> > &GetChildList();
    _inline std::_List_iterator<std::_List_val<std::_List_simple_types<UI::InterfaceElement *> > > begin();
    _inline std::_List_iterator<std::_List_val<std::_List_simple_types<UI::InterfaceElement *> > > end();
    _inline bool empty();
    void AddLine(UI::Line const &);
    void RemoveAllChildren();
    void DestroyAllChildren();
    UI::InterfaceElement *FindNamedElement(char const *);
    UI::InterfaceElement *FindElement(unsigned __int32);
    Rect_i GetAbsoluteDimensions() const;
    Vector_2i GetAbsolutePosition() const;
    Vector_2i GetAbsoluteFromLocal(Vector_2i const &) const;
    Vector_2i GetLocalFromAbsolute(Vector_2i const &) const;
    void AddRadioItem(UI::RadioItem *);
    void RemoveRadioItem(UI::RadioItem *);
    void UnselectAllRadioItems();
    bool HandleEvent(UI::EventType, UI::EventInfo const &);
    _inline void ConnectOnMouseMoved(void (*)(UI::InterfaceElement *, __int32, __int32, unsigned __int32));
    _inline void ConnectOnMouseEnter(void (*)(UI::InterfaceElement *, __int32, __int32, unsigned __int32));
    _inline void ConnectOnMouseExit(void (*)(UI::InterfaceElement *, __int32, __int32, unsigned __int32));
    _inline void ConnectOnMousePressed(void (*)(UI::InterfaceElement *, __int32, __int32, unsigned __int32));
    _inline void ConnectOnMouseReleased(void (*)(UI::InterfaceElement *, __int32, __int32, unsigned __int32));
    _inline void ConnectOnMouseClicked(void (*)(UI::InterfaceElement *, __int32, __int32, unsigned __int32));
    _inline void ConnectOnMouseDoubleClicked(void (*)(UI::InterfaceElement *, __int32, __int32, unsigned __int32));
    _inline void ConnectOnKeyPressed(void (*)(UI::InterfaceElement *, unsigned short, __int32));
    _inline void ConnectOnKeyReleased(void (*)(UI::InterfaceElement *, unsigned short, __int32));
    void ConnectOnKeyRepeat(void (*)(UI::InterfaceElement *, unsigned short, __int32));
    void ConnectOnFocusIn(void (*)(UI::InterfaceElement *));
    _inline void ConnectOnFocusOut(void (*)(UI::InterfaceElement *));
    _inline bool DisconnectOnMouseClicked(void (*)(UI::InterfaceElement *, __int32, __int32, unsigned __int32));
    bool DisconnectOnMousePressed(void (*)(UI::InterfaceElement *, __int32, __int32, unsigned __int32));
    bool DisconnectOnMouseExit(void (*)(UI::InterfaceElement *, __int32, __int32, unsigned __int32));
    bool DisconnectOnMouseEnter(void (*)(UI::InterfaceElement *, __int32, __int32, unsigned __int32));
    _inline bool DisconnectOnKeyPressed(void (*)(UI::InterfaceElement *, unsigned short, __int32));
    _inline bool DisconnectOnKeyReleased(void (*)(UI::InterfaceElement *, unsigned short, __int32));
    bool DisconnectOnKeyRepeat(void (*)(UI::InterfaceElement *, unsigned short, __int32));
    _inline void SetName(char const *);
    _inline void SetVisible(bool);
    _inline void SetBackgroundGraphic(boost::shared_ptr<UI::Graphic>);
    _inline void SetBackgroundGraphic2(boost::shared_ptr<UI::Graphic>);
    _inline void ClearBackgroundGraphic();
    _inline void SetBackgroundGraphicVisible(bool);
    _inline void SetBackgroundGraphic2Visible(bool);
    _inline void SetDisabledGraphic(boost::shared_ptr<UI::Graphic>);
    _inline void SetBackgroundColor(Color_4b const &);
    _inline void SetBackgroundGraphicColor(Color_4b const &);
    _inline void SetBorderColor(Color_4b const &);
    _inline void SetBorderWidth(unsigned __int32);
    _inline void SetOuterBorderWidth(unsigned __int32);
    _inline void SetDisabledColor(Color_4b const &);
    _inline void SetDisabledBorderColor(Color_4b const &);
    void SetGiveParentFocus(bool);
    _inline void SetGiveParentMouseInput(bool);
    void SetGiveParentMouseInputRecursive(bool);
    _inline void SetParent3(UI::InterfaceElement *);
    void SetHelpTip(wchar_t const *);
    void SetDisabledHelpTip(wchar_t const *);
    void SetHelpTipTextLabel(char const *);
    void SetHelpTipScreen(char const *);
    _inline void SetHotKeyID(unsigned __int32);
    _inline void SetClipRect(Rect_i const &);
    _inline void SetBackgroundRepeat(bool);
    _inline void SetCustomData(unsigned long long);
    _inline void SetCustomData2(unsigned __int32);
    _inline void SetCustomData3(__int32);
    void SetParentNewUIScreen(UI::NewUIScreen *);
    void SetUseMaxSize(bool);
    void SetUseMinSize(bool);
    _inline void SetGreyscale(bool);
    void SetMaxSize(UI::Size const &);
    void SetMinSize(UI::Size const &);
    void SetEnabled(bool);
    _inline void SetMarginWidth(__int32);
    void SetMarginHeight(__int32);
    void SetVAlign(unsigned __int32);
    void SetHAlign(unsigned __int32);
    void SetAllowDoubleClick(bool);
    _inline void Move(Vector_2i const &);
    virtual void Move(__int32, __int32);
    _inline void Resize(UI::Size const &);
    virtual void Resize(__int32, __int32);
    void SetDimensions(__int32, __int32, __int32, __int32);
    _inline void SetDimensions(Rect_i const &);
    _inline Color_4b GetBackgroundColor() const;
    Color_4b GetDisabledColor() const;
    _inline Color_4b GetBorderColor() const;
    _inline unsigned __int32 GetBorderWidth() const;
    unsigned __int32 GetOuterBorderWidth() const;
    bool HasBackgroundGraphic() const;
    _inline bool HasBackgroundGraphic2() const;
    bool HasDisabledGraphic() const;
    _inline __int32 GetWidth() const;
    _inline __int32 GetHeight() const;
    _inline __int32 GetX() const;
    _inline __int32 GetY() const;
    _inline bool GetEnabled() const;
    _inline bool GetVisible() const;
    _inline char const *GetName() const;
    _inline UI::Size GetSize() const;
    UI::Size GetMinSize() const;
    _inline UI::Size GetMaxSize() const;
    _inline unsigned long long GetCustomData() const;
    _inline unsigned __int32 GetCustomData2() const;
    _inline __int32 GetCustomData3() const;
    _inline bool GetBackgroundRepeat() const;
    _inline boost::shared_ptr<UI::Graphic> GetBackgroundGraphic() const;
    _inline boost::shared_ptr<UI::Graphic> GetBackgroundGraphic2() const;
    _inline boost::shared_ptr<UI::Graphic> GetDisabledGraphic() const;
    _inline bool GetGiveParentFocus() const;
    bool GetGiveParentMouseInput() const;
    bool GetUseMaxSize() const;
    bool GetUseMinSize() const;
    bool GetGreyscale() const;
    _inline unsigned __int32 GetID() const;
    _inline UI::NewUIScreen *GetParentNewUIScreen() const;
    _inline UI::InterfaceElement *GetParent3() const;
    _inline Rect_i GetClipRect() const;
    wchar_t const *GetHelpTip() const;
    _inline unsigned __int32 GetHotKeyID() const;
    Vector_2i GetPosition() const;
    Rect_i GetDimensions() const;
    bool AreAnyParentsDisabled() const;
    void SetAutoSize(bool);
    _inline bool GetAutoSize() const;
    void SetAutoArrange(bool);
    _inline bool GetAutoArrange() const;
    void SetAutoArrangeWidth(__int32);
    _inline __int32 GetAutoArrangeWidth() const;
    _inline __int32 GetMarginWidth() const;
    _inline __int32 GetMarginHeight() const;
    _inline unsigned __int32 GetVAlign() const;
    _inline unsigned __int32 GetHAlign() const;
    bool GetAllowDoubleClick() const;
    static void FillRect(Color_4b const &color, Rect_i const &rect, Rect_i const &clip);
    static void DrawLine(Color_4b const &color, Vector_2i const &p1, Vector_2i const &p2, long lineWidth, Rect_i const &clip, bool above);
    static void DrawLine(Vector_2i const &offset, UI::Line const &line, Rect_i const &clip);
    static void FillBorderRect(Color_4b const &color, Rect_i const &rect, Color_4b const &borderColor, long borderWidth, long outerBorderWidth, Rect_i const &clip);
    void SetChildVisible(char const *, bool);
    void SetChildEnabled(char const *, bool);
    void ShowHelpTip();
    void HideHelpTip();
    _inline bool HasMouseEntered() const;
    static bool CustomDataComp(UI::InterfaceElement const *item1, UI::InterfaceElement const *item2);
    static bool CustomData2Comp(UI::InterfaceElement const *item1, UI::InterfaceElement const *item2);
    void SortChildren(bool (*)(UI::InterfaceElement const *, UI::InterfaceElement const *));
protected:
    std::list<UI::InterfaceElement *,std::allocator<UI::InterfaceElement *> > m_children; // 0x8
    std::list<UI::Line,std::allocator<UI::Line> > m_lines; // 0x10
    bool m_autosize; // 0x18
private:
    bool m_visible; // 0x19
    bool m_enabled; // 0x1A
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_name; // 0x1C
    bool m_backgroundGraphicVisible; // 0x34
    bool m_backgroundGraphic2Visible; // 0x35
    boost::shared_ptr<UI::Graphic> m_backgroundGraphic; // 0x38
    boost::shared_ptr<UI::Graphic> m_backgroundGraphic2; // 0x40
    boost::shared_ptr<UI::Graphic> m_disabledGraphic; // 0x48
    unsigned __int32 m_bgGraphicHAlign; // 0x50
    unsigned __int32 m_bgGraphicVAlign; // 0x54
    Color_4b m_backgroundColor; // 0x58
    Color_4b m_borderColor; // 0x5C
    Color_4b m_disabledColor; // 0x60
    Color_4b m_disabledBorderColor; // 0x64
    Color_4b m_backgroundGraphicColor; // 0x68
    long m_borderWidth; // 0x6C
    long m_outerBorderWidth; // 0x70
    Vector_2i m_position; // 0x74
    UI::Size m_size; // 0x7C
    unsigned long long m_customData; // 0x88
    unsigned __int32 m_customData2; // 0x90
    __int32 m_customData3; // 0x94
    bool m_backgroundRepeat; // 0x98
    bool m_autoarrange; // 0x99
    __int32 m_autoarrangeWidth; // 0x9C
    __int32 m_autoarrangeSpace; // 0xA0
    bool m_giveParentFocus; // 0xA4
    bool m_giveParentMouseInput; // 0xA5
    bool m_resizeToParent; // 0xA6
    UI::Size m_minSize; // 0xA8
    UI::Size m_maxSize; // 0xB0
    bool m_useMinSize; // 0xB8
    bool m_useMaxSize; // 0xB9
    __int32 m_marginWidth; // 0xBC
    __int32 m_marginHeight; // 0xC0
    __int32 m_hotKeyID; // 0xC4
    bool m_greyscale; // 0xC8
    unsigned __int32 m_hAlign; // 0xCC
    unsigned __int32 m_vAlign; // 0xD0
    unsigned __int32 m_ID; // 0xD4
    Rect_i m_clipRect; // 0xD8
    UI::InterfaceElement *m_parent3; // 0xE8
    UI::NewUIScreen *m_parentNewUIScreen; // 0xEC
    std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > m_helpTip; // 0xF0
    std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > m_helpTipDisabled; // 0x108
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_helpTipTextLabel; // 0x120
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_helpTipScreen; // 0x138
    std::list<UI::RadioItem *,std::allocator<UI::RadioItem *> > m_radioItems; // 0x150
    UI::UIMouseSignal m_onMouseMoved; // 0x158
    UI::UIMouseSignal m_onMouseEnter; // 0x164
    UI::UIMouseSignal m_onMouseExit; // 0x170
    UI::UIMouseSignal m_onMousePressed; // 0x17C
    UI::UIMouseSignal m_onMouseReleased; // 0x188
    UI::UIMouseSignal m_onMouseClicked; // 0x194
    UI::UIMouseSignal m_onMouseDoubleClicked; // 0x1A0
    UI::UIKeySignal m_onKeyPressed; // 0x1AC
    UI::UIKeySignal m_onKeyReleased; // 0x1B8
    UI::UIKeySignal m_onKeyRepeat; // 0x1C4
    UI::UISignal m_onFocusIn; // 0x1D0
    UI::UISignal m_onFocusOut; // 0x1DC
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_luaOnMouseMoved; // 0x1E8
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_luaOnMouseClicked; // 0x200
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_luaOnMouseEnter; // 0x218
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_luaOnMouseExit; // 0x230
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_luaOnMousePressed; // 0x248
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_luaOnMouseReleased; // 0x260
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_luaOnMouseDoubleClicked; // 0x278
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_luaOnKeyPressed; // 0x290
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_luaOnKeyReleased; // 0x2A8
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_luaOnKeyRepeat; // 0x2C0
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_luaOnResize; // 0x2D8
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_luaOnUpdate; // 0x2F0
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_luaOnLoad; // 0x308
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_luaOnDraw; // 0x320
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_soundOnEnter; // 0x338
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_soundOnExit; // 0x350
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_soundOnClicked; // 0x368
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_soundOnPressed; // 0x380
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_soundOnReleased; // 0x398
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_soundOnKeyDown; // 0x3B0
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_soundOnKeyUp; // 0x3C8
    std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_soundOnKeyRepeat; // 0x3E0
    bool m_hasMouseEntered; // 0x3F8
    bool m_allowDoubleClick; // 0x3F9
protected:
    void Load(LuaConfig &);
    void LoadNoChildren(LuaConfig &);
    virtual void CalcAutoSize();
    virtual _inline void OnMouseMoved(Vector_2i const &, UI::MouseButton const &);
    virtual _inline void OnMousePressed(Vector_2i const &, UI::MouseButton const &);
    virtual _inline void OnMouseReleased(Vector_2i const &, UI::MouseButton const &);
    virtual _inline void OnMouseClicked(Vector_2i const &, UI::MouseButton const &);
    virtual _inline void OnMouseDoubleClicked(Vector_2i const &, UI::MouseButton const &);
    virtual _inline void OnMouseEnter(Vector_2i const &, UI::MouseButton const &);
    virtual _inline void OnMouseExit(Vector_2i const &, UI::MouseButton const &);
    virtual _inline void OnResize(__int32, __int32);
    virtual _inline void OnUpdate(unsigned __int32);
    virtual _inline void OnMouseWheelUp();
    virtual _inline void OnMouseWheelDown();
    virtual _inline void OnFocus(bool);
