#if 0
#ifndef __LUABINDING_H__
#define __LUABINDING_H__
#pragma once

/* ---------- headers */

/* ---------- constants */

/* ---------- definitions */

class LuaBinding::Obj
{
public:
    Obj(LuaBinding::Obj const &);
    Obj();
    Obj(LuaBinding::ObjInternalBase *);
    ~Obj();
    LuaBinding::Obj &operator=(LuaBinding::Obj const &);
    bool IsRegistered() const;
    void Reset();
private:
    LuaBinding::ObjInternalBase *m_sharedCb; // 0x0
    static __int32 Dispatcher(lua_State *);
};
static_assert(sizeof(LuaBinding::Obj) == 4, "Invalid LuaBinding::Obj size");

class LuaBinding::ObjInternalBase
{
private:
    ObjInternalBase(LuaBinding::ObjInternalBase const &);
protected:
    ObjInternalBase(LuaConfig *, char const *, char const *);
    virtual ~ObjInternalBase();
public:
    char const *GetFunctionName() const;
    char const *GetFunctionUsage() const;
    virtual __int32 Dispatch(lua_State *) = 0;
protected:
    void CheckArgs(lua_State *, unsigned __int32 const);
private:
    char const *m_funcname; // 0x4
    char const *m_usage; // 0x8
    LuaConfig *m_lc; // 0xC
    __int32 m_count; // 0x10
    LuaBinding::ObjInternalBase &operator=(LuaBinding::ObjInternalBase const &);
};
static_assert(sizeof(LuaBinding::ObjInternalBase) == 20, "Invalid LuaBinding::ObjInternalBase size");

class LuaBinding::ParmTraits<char const *>
{
public:
    typedef char const *type;
    static _inline void Push(char const *const t, lua_State *ls);
    static _inline bool Pop(char const *&t, lua_State *ls, __int32 n);
};
static_assert(sizeof(LuaBinding::ParmTraits<char const *>) == 1, "Invalid LuaBinding::ParmTraits<char const *> size");

class LuaBinding::ParmTraits<bool>
{
public:
    typedef bool type;
    static _inline void Push(bool const t, lua_State *ls);
    static _inline bool Pop(bool &t, lua_State *ls, __int32 n);
};
static_assert(sizeof(LuaBinding::ParmTraits<bool>) == 1, "Invalid LuaBinding::ParmTraits<bool> size");

class LuaBinding::ParmTraits<unsigned long>
{
public:
    typedef unsigned long type;
    static void Push(unsigned long const, lua_State *);
    static bool Pop(unsigned long &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::ParmTraits<unsigned long>) == 1, "Invalid LuaBinding::ParmTraits<unsigned long> size");

class LuaBinding::ParmTraits<long>
{
public:
    typedef long type;
    static void Push(long const, lua_State *);
    static bool Pop(long &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::ParmTraits<long>) == 1, "Invalid LuaBinding::ParmTraits<long> size");

class LuaBinding::ParmTraits<unsigned int>
{
public:
    typedef unsigned __int32 type;
    static void Push(unsigned __int32 const, lua_State *);
    static _inline bool Pop(unsigned __int32 &t, lua_State *ls, __int32 n);
};
static_assert(sizeof(LuaBinding::ParmTraits<unsigned int>) == 1, "Invalid LuaBinding::ParmTraits<unsigned int> size");

class LuaBinding::ParmTraits<int>
{
public:
    typedef __int32 type;
    static void Push(__int32 const, lua_State *);
    static bool Pop(__int32 &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::ParmTraits<int>) == 1, "Invalid LuaBinding::ParmTraits<int> size");

class LuaBinding::ParmTraits<float>
{
public:
    typedef float type;
    static _inline void Push(float const t, lua_State *ls);
    static bool Pop(float &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::ParmTraits<float>) == 1, "Invalid LuaBinding::ParmTraits<float> size");

class LuaBinding::Functor0Free<bool>
{
public:
    typedef bool (*type_func)();
private:
    bool (*m_func)(); // 0x0
public:
    _inline Functor0Free<bool>(bool (*)());
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Free<bool>) == 4, "Invalid LuaBinding::Functor0Free<bool> size");

class LuaBinding::Functor0Free<char const *>
{
public:
    typedef char const *(*type_func)();
private:
    char const *(*m_func)(); // 0x0
public:
    _inline Functor0Free<char const *>(char const *(*)());
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Free<char const *>) == 4, "Invalid LuaBinding::Functor0Free<char const *> size");

class LuaBinding::Functor0Free<float>
{
public:
    typedef float (*type_func)();
private:
    float (*m_func)(); // 0x0
public:
    _inline Functor0Free<float>(float (*)());
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Free<float>) == 4, "Invalid LuaBinding::Functor0Free<float> size");

class LuaBinding::Functor0Free<void>
{
public:
    typedef void (*type_func)();
private:
    void (*m_func)(); // 0x0
public:
    _inline Functor0Free<void>(void (*)());
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Free<void>) == 4, "Invalid LuaBinding::Functor0Free<void> size");

class LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0Free<bool> m_func; // 0x14
public:
    ObjInternal0<bool,LuaBinding::Functor0Free<bool> >(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> > const &); /* compiler_generated() */
    _inline ObjInternal0<bool,LuaBinding::Functor0Free<bool> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<bool> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<bool,LuaBinding::Functor0Free<bool> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> > &operator=(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> >) == 24, "Invalid LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> > size");

class LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0Free<char const *> m_func; // 0x14
public:
    ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> >(LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> > const &); /* compiler_generated() */
    _inline ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<char const *> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> > &operator=(LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> >) == 24, "Invalid LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> > size");

class LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0Free<float> m_func; // 0x14
public:
    ObjInternal0<float,LuaBinding::Functor0Free<float> >(LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> > const &); /* compiler_generated() */
    _inline ObjInternal0<float,LuaBinding::Functor0Free<float> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<float> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<float,LuaBinding::Functor0Free<float> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> > &operator=(LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> >) == 24, "Invalid LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> > size");

class LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0Free<void> m_func; // 0x14
public:
    ObjInternal0<void,LuaBinding::Functor0Free<void> >(LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> > const &); /* compiler_generated() */
    _inline ObjInternal0<void,LuaBinding::Functor0Free<void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<void> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<void,LuaBinding::Functor0Free<void> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> > &operator=(LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> >) == 24, "Invalid LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> > size");

class LuaBinding::Functor1Free<char const *,bool>
{
public:
    typedef bool (*type_func)(char const *);
private:
    bool (*m_func)(char const *); // 0x0
public:
    _inline Functor1Free<char const *,bool>(bool (*)(char const *));
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Free<char const *,bool>) == 4, "Invalid LuaBinding::Functor1Free<char const *,bool> size");

class LuaBinding::Functor1Free<unsigned int,void>
{
public:
    typedef void (*type_func)(unsigned __int32);
private:
    void (*m_func)(unsigned __int32); // 0x0
public:
    _inline Functor1Free<unsigned int,void>(void (*)(unsigned __int32));
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Free<unsigned int,void>) == 4, "Invalid LuaBinding::Functor1Free<unsigned int,void> size");

class LuaBinding::Functor1Free<char const *,void>
{
public:
    typedef void (*type_func)(char const *);
private:
    void (*m_func)(char const *); // 0x0
public:
    _inline Functor1Free<char const *,void>(void (*)(char const *));
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Free<char const *,void>) == 4, "Invalid LuaBinding::Functor1Free<char const *,void> size");

class LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<char const *,bool> m_func; // 0x14
public:
    ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> >(LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<char const *,bool> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> > &operator=(LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> >) == 24, "Invalid LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> > size");

class LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<unsigned int,void> m_func; // 0x14
public:
    ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> >(LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<unsigned int,void> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> > &operator=(LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> >) == 24, "Invalid LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> > size");

class LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<char const *,void> m_func; // 0x14
public:
    ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> >(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<char const *,void> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> > &operator=(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> >) == 24, "Invalid LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> > size");

class LuaBinding::Functor2Free<unsigned int,bool,bool>
{
public:
    typedef bool (*type_func)(unsigned __int32, bool);
private:
    bool (*m_func)(unsigned __int32, bool); // 0x0
public:
    _inline Functor2Free<unsigned int,bool,bool>(bool (*)(unsigned __int32, bool));
    __int32 operator()(double const &, lua_State *, unsigned __int32, bool);
    __int32 operator()(char const &, lua_State *, unsigned __int32, bool);
};
static_assert(sizeof(LuaBinding::Functor2Free<unsigned int,bool,bool>) == 4, "Invalid LuaBinding::Functor2Free<unsigned int,bool,bool> size");

class LuaBinding::Functor2Free<char const *,unsigned int,bool>
{
public:
    typedef bool (*type_func)(char const *, unsigned __int32);
private:
    bool (*m_func)(char const *, unsigned __int32); // 0x0
public:
    _inline Functor2Free<char const *,unsigned int,bool>(bool (*)(char const *, unsigned __int32));
    __int32 operator()(double const &, lua_State *, char const *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, char const *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor2Free<char const *,unsigned int,bool>) == 4, "Invalid LuaBinding::Functor2Free<char const *,unsigned int,bool> size");

class LuaBinding::ObjInternal2<unsigned int,bool,bool,LuaBinding::Functor2Free<unsigned int,bool,bool> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor2Free<unsigned int,bool,bool> m_func; // 0x14
public:
    ObjInternal2<unsigned int,bool,bool,LuaBinding::Functor2Free<unsigned int,bool,bool> >(LuaBinding::ObjInternal2<unsigned int,bool,bool,LuaBinding::Functor2Free<unsigned int,bool,bool> > const &); /* compiler_generated() */
    _inline ObjInternal2<unsigned int,bool,bool,LuaBinding::Functor2Free<unsigned int,bool,bool> >(LuaConfig *, char const *, char const *, LuaBinding::Functor2Free<unsigned int,bool,bool> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal2<unsigned int,bool,bool,LuaBinding::Functor2Free<unsigned int,bool,bool> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal2<unsigned int,bool,bool,LuaBinding::Functor2Free<unsigned int,bool,bool> > &operator=(LuaBinding::ObjInternal2<unsigned int,bool,bool,LuaBinding::Functor2Free<unsigned int,bool,bool> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal2<unsigned int,bool,bool,LuaBinding::Functor2Free<unsigned int,bool,bool> >) == 24, "Invalid LuaBinding::ObjInternal2<unsigned int,bool,bool,LuaBinding::Functor2Free<unsigned int,bool,bool> > size");

class LuaBinding::ObjInternal2<char const *,unsigned int,bool,LuaBinding::Functor2Free<char const *,unsigned int,bool> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor2Free<char const *,unsigned int,bool> m_func; // 0x14
public:
    ObjInternal2<char const *,unsigned int,bool,LuaBinding::Functor2Free<char const *,unsigned int,bool> >(LuaBinding::ObjInternal2<char const *,unsigned int,bool,LuaBinding::Functor2Free<char const *,unsigned int,bool> > const &); /* compiler_generated() */
    _inline ObjInternal2<char const *,unsigned int,bool,LuaBinding::Functor2Free<char const *,unsigned int,bool> >(LuaConfig *, char const *, char const *, LuaBinding::Functor2Free<char const *,unsigned int,bool> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal2<char const *,unsigned int,bool,LuaBinding::Functor2Free<char const *,unsigned int,bool> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal2<char const *,unsigned int,bool,LuaBinding::Functor2Free<char const *,unsigned int,bool> > &operator=(LuaBinding::ObjInternal2<char const *,unsigned int,bool,LuaBinding::Functor2Free<char const *,unsigned int,bool> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal2<char const *,unsigned int,bool,LuaBinding::Functor2Free<char const *,unsigned int,bool> >) == 24, "Invalid LuaBinding::ObjInternal2<char const *,unsigned int,bool,LuaBinding::Functor2Free<char const *,unsigned int,bool> > size");

class LuaBinding::CallReturn<void>
{
public:
    enum
    {
        RETCOUNT = 0,
    };
    _inline CallReturn<void>();
    _inline bool Store(lua_State *);
};
static_assert(sizeof(LuaBinding::CallReturn<void>) == 1, "Invalid LuaBinding::CallReturn<void> size");

class LuaBinding::Call<void>
{
public:
    LuaBinding::CallReturn<void> r; // 0x0
    _inline Call<void>();
    _inline ~Call<void>();
    _inline bool Execute(LuaConfig *, char const *);
};
static_assert(sizeof(LuaBinding::Call<void>) == 1, "Invalid LuaBinding::Call<void> size");

/* ---------- prototypes */

extern _inline LuaBinding::Obj LuaBinding::Bind<float>(LuaConfig *lc, char const *n, float (*f)(), char const *u);
extern _inline LuaBinding::Obj LuaBinding::Bind<char const *>(LuaConfig *lc, char const *n, char const *(*f)(), char const *u);
extern _inline LuaBinding::Obj LuaBinding::Bind<void>(LuaConfig *lc, char const *n, void (*f)(), char const *u);
extern _inline LuaBinding::Obj LuaBinding::Bind<bool>(LuaConfig *lc, char const *n, bool (*f)(), char const *u);
extern _inline LuaBinding::Obj LuaBinding::Bind<unsigned int,void>(LuaConfig *lc, char const *n, void (*f)(unsigned __int32), char const *u);
extern _inline LuaBinding::Obj LuaBinding::Bind<char const *,void>(LuaConfig *lc, char const *n, void (*f)(char const *), char const *u);
extern _inline LuaBinding::Obj LuaBinding::Bind<char const *,bool>(LuaConfig *lc, char const *n, bool (*f)(char const *), char const *u);
extern _inline LuaBinding::Obj LuaBinding::Bind<unsigned int,bool,bool>(LuaConfig *lc, char const *n, bool (*f)(unsigned __int32, bool), char const *u);
extern _inline LuaBinding::Obj LuaBinding::Bind<char const *,unsigned int,bool>(LuaConfig *lc, char const *n, bool (*f)(char const *, unsigned __int32), char const *u);

/* ---------- globals */

/* ---------- public code */

_extern void _sub_10002011(float const, lua_State *);
_inline void LuaBinding::ParmTraits<float>::Push(float const t, lua_State *ls) // 0x10002011
{
    mangled_assert("?Push@?$ParmTraits@M@LuaBinding@@SGXMPAUlua_State@@@Z");
    todo("implement");
    _sub_10002011(t, ls);
}

_extern bool _sub_10001F63(unsigned __int32 &, lua_State *, __int32);
_inline bool LuaBinding::ParmTraits<unsigned int>::Pop(unsigned __int32 &t, lua_State *ls, __int32 n) // 0x10001F63
{
    mangled_assert("?Pop@?$ParmTraits@I@LuaBinding@@SG_NAAIPAUlua_State@@H@Z");
    todo("implement");
    bool __result = _sub_10001F63(t, ls, n);
    return __result;
}

_extern bool _sub_10001FC4(bool &, lua_State *, __int32);
_inline bool LuaBinding::ParmTraits<bool>::Pop(bool &t, lua_State *ls, __int32 n) // 0x10001FC4
{
    mangled_assert("?Pop@?$ParmTraits@_N@LuaBinding@@SG_NAA_NPAUlua_State@@H@Z");
    todo("implement");
    bool __result = _sub_10001FC4(t, ls, n);
    return __result;
}

_extern void _sub_10002043(bool const, lua_State *);
_inline void LuaBinding::ParmTraits<bool>::Push(bool const t, lua_State *ls) // 0x10002043
{
    mangled_assert("?Push@?$ParmTraits@_N@LuaBinding@@SGX_NPAUlua_State@@@Z");
    todo("implement");
    _sub_10002043(t, ls);
}

_extern void _sub_10002030(char const *const, lua_State *);
_inline void LuaBinding::ParmTraits<char const *>::Push(char const *const t, lua_State *ls) // 0x10002030
{
    mangled_assert("?Push@?$ParmTraits@PBD@LuaBinding@@SGXQBDPAUlua_State@@@Z");
    todo("implement");
    _sub_10002030(t, ls);
}

_extern bool _sub_10001F96(char const *&, lua_State *, __int32);
_inline bool LuaBinding::ParmTraits<char const *>::Pop(char const *&t, lua_State *ls, __int32 n) // 0x10001F96
{
    mangled_assert("?Pop@?$ParmTraits@PBD@LuaBinding@@SG_NAAPBDPAUlua_State@@H@Z");
    todo("implement");
    bool __result = _sub_10001F96(t, ls, n);
    return __result;
}

_extern _sub_10001580(LuaBinding::Functor0Free<float> *const, float (*)());
_inline LuaBinding::Functor0Free<float>::Functor0Free<float>(float (*)()) // 0x10001580
{
    mangled_assert("??0?$Functor0Free@M@LuaBinding@@QAE@P6GMXZ@Z");
    todo("implement");
    _sub_10001580(this, arg);
}

_extern _sub_1000158E(LuaBinding::Functor0Free<char const *> *const, char const *(*)());
_inline LuaBinding::Functor0Free<char const *>::Functor0Free<char const *>(char const *(*)()) // 0x1000158E
{
    mangled_assert("??0?$Functor0Free@PBD@LuaBinding@@QAE@P6GPBDXZ@Z");
    todo("implement");
    _sub_1000158E(this, arg);
}

_extern _sub_1000159C(LuaBinding::Functor0Free<void> *const, void (*)());
_inline LuaBinding::Functor0Free<void>::Functor0Free<void>(void (*)()) // 0x1000159C
{
    mangled_assert("??0?$Functor0Free@X@LuaBinding@@QAE@P6GXXZ@Z");
    todo("implement");
    _sub_1000159C(this, arg);
}

_extern _sub_100015AA(LuaBinding::Functor0Free<bool> *const, bool (*)());
_inline LuaBinding::Functor0Free<bool>::Functor0Free<bool>(bool (*)()) // 0x100015AA
{
    mangled_assert("??0?$Functor0Free@_N@LuaBinding@@QAE@P6G_NXZ@Z");
    todo("implement");
    _sub_100015AA(this, arg);
}

_extern __int32 _sub_10001954(LuaBinding::Functor0Free<float> *const, char const &, lua_State *);
_inline __int32 LuaBinding::Functor0Free<float>::operator()(char const &, lua_State *) // 0x10001954
{
    mangled_assert("??R?$Functor0Free@M@LuaBinding@@QAEHABDPAUlua_State@@@Z");
    todo("implement");
    __int32 __result = _sub_10001954(this, arg, arg);
    return __result;
}

_extern __int32 _sub_1000197A(LuaBinding::Functor0Free<char const *> *const, char const &, lua_State *);
_inline __int32 LuaBinding::Functor0Free<char const *>::operator()(char const &, lua_State *) // 0x1000197A
{
    mangled_assert("??R?$Functor0Free@PBD@LuaBinding@@QAEHABDPAUlua_State@@@Z");
    todo("implement");
    __int32 __result = _sub_1000197A(this, arg, arg);
    return __result;
}

_extern __int32 _sub_10001997(LuaBinding::Functor0Free<bool> *const, char const &, lua_State *);
_inline __int32 LuaBinding::Functor0Free<bool>::operator()(char const &, lua_State *) // 0x10001997
{
    mangled_assert("??R?$Functor0Free@_N@LuaBinding@@QAEHABDPAUlua_State@@@Z");
    todo("implement");
    __int32 __result = _sub_10001997(this, arg, arg);
    return __result;
}

_extern __int32 _sub_10001990(LuaBinding::Functor0Free<void> *const, double const &, lua_State *);
_inline __int32 LuaBinding::Functor0Free<void>::operator()(double const &, lua_State *) // 0x10001990
{
    mangled_assert("??R?$Functor0Free@X@LuaBinding@@QAEHABNPAUlua_State@@@Z");
    todo("implement");
    __int32 __result = _sub_10001990(this, arg, arg);
    return __result;
}

_extern _sub_100015FE(LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> > *const, LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<float> const &);
_inline LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> >::ObjInternal0<float,LuaBinding::Functor0Free<float> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<float> const &) // 0x100015FE
{
    mangled_assert("??0?$ObjInternal0@MV?$Functor0Free@M@LuaBinding@@@LuaBinding@@QAE@PAVLuaConfig@@PBD1ABV?$Functor0Free@M@1@@Z");
    todo("implement");
    _sub_100015FE(this, arg, arg, arg, arg);
}

_extern _sub_10001628(LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> > *const, LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<char const *> const &);
_inline LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> >::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<char const *> const &) // 0x10001628
{
    mangled_assert("??0?$ObjInternal0@PBDV?$Functor0Free@PBD@LuaBinding@@@LuaBinding@@QAE@PAVLuaConfig@@PBD1ABV?$Functor0Free@PBD@1@@Z");
    todo("implement");
    _sub_10001628(this, arg, arg, arg, arg);
}

_extern _sub_10001652(LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> > *const, LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<void> const &);
_inline LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> >::ObjInternal0<void,LuaBinding::Functor0Free<void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<void> const &) // 0x10001652
{
    mangled_assert("??0?$ObjInternal0@XV?$Functor0Free@X@LuaBinding@@@LuaBinding@@QAE@PAVLuaConfig@@PBD1ABV?$Functor0Free@X@1@@Z");
    todo("implement");
    _sub_10001652(this, arg, arg, arg, arg);
}

_extern _sub_1000167C(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> > *const, LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<bool> const &);
_inline LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> >::ObjInternal0<bool,LuaBinding::Functor0Free<bool> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<bool> const &) // 0x1000167C
{
    mangled_assert("??0?$ObjInternal0@_NV?$Functor0Free@_N@LuaBinding@@@LuaBinding@@QAE@PAVLuaConfig@@PBD1ABV?$Functor0Free@_N@1@@Z");
    todo("implement");
    _sub_1000167C(this, arg, arg, arg, arg);
}

_extern __int32 _sub_10001BDE(LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> > *const, lua_State *);
_inline __int32 LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> >::Dispatch(lua_State *) // 0x10001BDE
{
    mangled_assert("?Dispatch@?$ObjInternal0@MV?$Functor0Free@M@LuaBinding@@@LuaBinding@@UAEHPAUlua_State@@@Z");
    todo("implement");
    __int32 __result = _sub_10001BDE(this, arg);
    return __result;
}

_extern __int32 _sub_10001C14(LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> > *const, lua_State *);
_inline __int32 LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> >::Dispatch(lua_State *) // 0x10001C14
{
    mangled_assert("?Dispatch@?$ObjInternal0@PBDV?$Functor0Free@PBD@LuaBinding@@@LuaBinding@@UAEHPAUlua_State@@@Z");
    todo("implement");
    __int32 __result = _sub_10001C14(this, arg);
    return __result;
}

_extern __int32 _sub_10001C3A(LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> > *const, lua_State *);
_inline __int32 LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> >::Dispatch(lua_State *) // 0x10001C3A
{
    mangled_assert("?Dispatch@?$ObjInternal0@XV?$Functor0Free@X@LuaBinding@@@LuaBinding@@UAEHPAUlua_State@@@Z");
    todo("implement");
    __int32 __result = _sub_10001C3A(this, arg);
    return __result;
}

_extern __int32 _sub_10001C55(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> > *const, lua_State *);
_inline __int32 LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> >::Dispatch(lua_State *) // 0x10001C55
{
    mangled_assert("?Dispatch@?$ObjInternal0@_NV?$Functor0Free@_N@LuaBinding@@@LuaBinding@@UAEHPAUlua_State@@@Z");
    todo("implement");
    __int32 __result = _sub_10001C55(this, arg);
    return __result;
}

_extern _sub_100015B8(LuaBinding::Functor1Free<unsigned int,void> *const, void (*)(unsigned __int32));
_inline LuaBinding::Functor1Free<unsigned int,void>::Functor1Free<unsigned int,void>(void (*)(unsigned __int32)) // 0x100015B8
{
    mangled_assert("??0?$Functor1Free@IX@LuaBinding@@QAE@P6GXI@Z@Z");
    todo("implement");
    _sub_100015B8(this, arg);
}

_extern _sub_100015C6(LuaBinding::Functor1Free<char const *,void> *const, void (*)(char const *));
_inline LuaBinding::Functor1Free<char const *,void>::Functor1Free<char const *,void>(void (*)(char const *)) // 0x100015C6
{
    mangled_assert("??0?$Functor1Free@PBDX@LuaBinding@@QAE@P6GXPBD@Z@Z");
    todo("implement");
    _sub_100015C6(this, arg);
}

_extern _sub_100015D4(LuaBinding::Functor1Free<char const *,bool> *const, bool (*)(char const *));
_inline LuaBinding::Functor1Free<char const *,bool>::Functor1Free<char const *,bool>(bool (*)(char const *)) // 0x100015D4
{
    mangled_assert("??0?$Functor1Free@PBD_N@LuaBinding@@QAE@P6G_NPBD@Z@Z");
    todo("implement");
    _sub_100015D4(this, arg);
}

_extern __int32 _sub_100019CE(LuaBinding::Functor1Free<char const *,bool> *const, char const &, lua_State *, char const *);
_inline __int32 LuaBinding::Functor1Free<char const *,bool>::operator()(char const &, lua_State *, char const *) // 0x100019CE
{
    mangled_assert("??R?$Functor1Free@PBD_N@LuaBinding@@QAEHABDPAUlua_State@@PBD@Z");
    todo("implement");
    __int32 __result = _sub_100019CE(this, arg, arg, arg);
    return __result;
}

_extern __int32 _sub_100019B2(LuaBinding::Functor1Free<unsigned int,void> *const, double const &, lua_State *, unsigned __int32);
_inline __int32 LuaBinding::Functor1Free<unsigned int,void>::operator()(double const &, lua_State *, unsigned __int32) // 0x100019B2
{
    mangled_assert("??R?$Functor1Free@IX@LuaBinding@@QAEHABNPAUlua_State@@I@Z");
    todo("implement");
    __int32 __result = _sub_100019B2(this, arg, arg, arg);
    return __result;
}

_extern __int32 _sub_100019C0(LuaBinding::Functor1Free<char const *,void> *const, double const &, lua_State *, char const *);
_inline __int32 LuaBinding::Functor1Free<char const *,void>::operator()(double const &, lua_State *, char const *) // 0x100019C0
{
    mangled_assert("??R?$Functor1Free@PBDX@LuaBinding@@QAEHABNPAUlua_State@@PBD@Z");
    todo("implement");
    __int32 __result = _sub_100019C0(this, arg, arg, arg);
    return __result;
}

_extern _sub_100016A6(LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> > *const, LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<unsigned int,void> const &);
_inline LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> >::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<unsigned int,void> const &) // 0x100016A6
{
    mangled_assert("??0?$ObjInternal1@IXV?$Functor1Free@IX@LuaBinding@@@LuaBinding@@QAE@PAVLuaConfig@@PBD1ABV?$Functor1Free@IX@1@@Z");
    todo("implement");
    _sub_100016A6(this, arg, arg, arg, arg);
}

_extern _sub_100016D0(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> > *const, LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<char const *,void> const &);
_inline LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> >::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<char const *,void> const &) // 0x100016D0
{
    mangled_assert("??0?$ObjInternal1@PBDXV?$Functor1Free@PBDX@LuaBinding@@@LuaBinding@@QAE@PAVLuaConfig@@PBD1ABV?$Functor1Free@PBDX@1@@Z");
    todo("implement");
    _sub_100016D0(this, arg, arg, arg, arg);
}

_extern _sub_100016FA(LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> > *const, LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<char const *,bool> const &);
_inline LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> >::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<char const *,bool> const &) // 0x100016FA
{
    mangled_assert("??0?$ObjInternal1@PBD_NV?$Functor1Free@PBD_N@LuaBinding@@@LuaBinding@@QAE@PAVLuaConfig@@PBD1ABV?$Functor1Free@PBD_N@1@@Z");
    todo("implement");
    _sub_100016FA(this, arg, arg, arg, arg);
}

_extern __int32 _sub_10001C80(LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> > *const, lua_State *);
_inline __int32 LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> >::Dispatch(lua_State *) // 0x10001C80
{
    mangled_assert("?Dispatch@?$ObjInternal1@IXV?$Functor1Free@IX@LuaBinding@@@LuaBinding@@UAEHPAUlua_State@@@Z");
    todo("implement");
    __int32 __result = _sub_10001C80(this, arg);
    return __result;
}

_extern __int32 _sub_10001CC9(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> > *const, lua_State *);
_inline __int32 LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> >::Dispatch(lua_State *) // 0x10001CC9
{
    mangled_assert("?Dispatch@?$ObjInternal1@PBDXV?$Functor1Free@PBDX@LuaBinding@@@LuaBinding@@UAEHPAUlua_State@@@Z");
    todo("implement");
    __int32 __result = _sub_10001CC9(this, arg);
    return __result;
}

_extern __int32 _sub_10001D12(LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> > *const, lua_State *);
_inline __int32 LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> >::Dispatch(lua_State *) // 0x10001D12
{
    mangled_assert("?Dispatch@?$ObjInternal1@PBD_NV?$Functor1Free@PBD_N@LuaBinding@@@LuaBinding@@UAEHPAUlua_State@@@Z");
    todo("implement");
    __int32 __result = _sub_10001D12(this, arg);
    return __result;
}

_extern _sub_100015E2(LuaBinding::Functor2Free<unsigned int,bool,bool> *const, bool (*)(unsigned __int32, bool));
_inline LuaBinding::Functor2Free<unsigned int,bool,bool>::Functor2Free<unsigned int,bool,bool>(bool (*)(unsigned __int32, bool)) // 0x100015E2
{
    mangled_assert("??0?$Functor2Free@I_N_N@LuaBinding@@QAE@P6G_NI_N@Z@Z");
    todo("implement");
    _sub_100015E2(this, arg);
}

_extern _sub_100015F0(LuaBinding::Functor2Free<char const *,unsigned int,bool> *const, bool (*)(char const *, unsigned __int32));
_inline LuaBinding::Functor2Free<char const *,unsigned int,bool>::Functor2Free<char const *,unsigned int,bool>(bool (*)(char const *, unsigned __int32)) // 0x100015F0
{
    mangled_assert("??0?$Functor2Free@PBDI_N@LuaBinding@@QAE@P6G_NPBDI@Z@Z");
    todo("implement");
    _sub_100015F0(this, arg);
}

_extern __int32 _sub_100019EB(LuaBinding::Functor2Free<unsigned int,bool,bool> *const, char const &, lua_State *, unsigned __int32, bool);
_inline __int32 LuaBinding::Functor2Free<unsigned int,bool,bool>::operator()(char const &, lua_State *, unsigned __int32, bool) // 0x100019EB
{
    mangled_assert("??R?$Functor2Free@I_N_N@LuaBinding@@QAEHABDPAUlua_State@@I_N@Z");
    todo("implement");
    __int32 __result = _sub_100019EB(this, arg, arg, arg, arg);
    return __result;
}

_extern __int32 _sub_10001A0B(LuaBinding::Functor2Free<char const *,unsigned int,bool> *const, char const &, lua_State *, char const *, unsigned __int32);
_inline __int32 LuaBinding::Functor2Free<char const *,unsigned int,bool>::operator()(char const &, lua_State *, char const *, unsigned __int32) // 0x10001A0B
{
    mangled_assert("??R?$Functor2Free@PBDI_N@LuaBinding@@QAEHABDPAUlua_State@@PBDI@Z");
    todo("implement");
    __int32 __result = _sub_10001A0B(this, arg, arg, arg, arg);
    return __result;
}

_extern _sub_10001724(LuaBinding::ObjInternal2<unsigned int,bool,bool,LuaBinding::Functor2Free<unsigned int,bool,bool> > *const, LuaConfig *, char const *, char const *, LuaBinding::Functor2Free<unsigned int,bool,bool> const &);
_inline LuaBinding::ObjInternal2<unsigned int,bool,bool,LuaBinding::Functor2Free<unsigned int,bool,bool> >::ObjInternal2<unsigned int,bool,bool,LuaBinding::Functor2Free<unsigned int,bool,bool> >(LuaConfig *, char const *, char const *, LuaBinding::Functor2Free<unsigned int,bool,bool> const &) // 0x10001724
{
    mangled_assert("??0?$ObjInternal2@I_N_NV?$Functor2Free@I_N_N@LuaBinding@@@LuaBinding@@QAE@PAVLuaConfig@@PBD1ABV?$Functor2Free@I_N_N@1@@Z");
    todo("implement");
    _sub_10001724(this, arg, arg, arg, arg);
}

_extern _sub_1000174E(LuaBinding::ObjInternal2<char const *,unsigned int,bool,LuaBinding::Functor2Free<char const *,unsigned int,bool> > *const, LuaConfig *, char const *, char const *, LuaBinding::Functor2Free<char const *,unsigned int,bool> const &);
_inline LuaBinding::ObjInternal2<char const *,unsigned int,bool,LuaBinding::Functor2Free<char const *,unsigned int,bool> >::ObjInternal2<char const *,unsigned int,bool,LuaBinding::Functor2Free<char const *,unsigned int,bool> >(LuaConfig *, char const *, char const *, LuaBinding::Functor2Free<char const *,unsigned int,bool> const &) // 0x1000174E
{
    mangled_assert("??0?$ObjInternal2@PBDI_NV?$Functor2Free@PBDI_N@LuaBinding@@@LuaBinding@@QAE@PAVLuaConfig@@PBD1ABV?$Functor2Free@PBDI_N@1@@Z");
    todo("implement");
    _sub_1000174E(this, arg, arg, arg, arg);
}

_extern __int32 _sub_10001D6C(LuaBinding::ObjInternal2<unsigned int,bool,bool,LuaBinding::Functor2Free<unsigned int,bool,bool> > *const, lua_State *);
_inline __int32 LuaBinding::ObjInternal2<unsigned int,bool,bool,LuaBinding::Functor2Free<unsigned int,bool,bool> >::Dispatch(lua_State *) // 0x10001D6C
{
    mangled_assert("?Dispatch@?$ObjInternal2@I_N_NV?$Functor2Free@I_N_N@LuaBinding@@@LuaBinding@@UAEHPAUlua_State@@@Z");
    todo("implement");
    __int32 __result = _sub_10001D6C(this, arg);
    return __result;
}

_extern __int32 _sub_10001DDA(LuaBinding::ObjInternal2<char const *,unsigned int,bool,LuaBinding::Functor2Free<char const *,unsigned int,bool> > *const, lua_State *);
_inline __int32 LuaBinding::ObjInternal2<char const *,unsigned int,bool,LuaBinding::Functor2Free<char const *,unsigned int,bool> >::Dispatch(lua_State *) // 0x10001DDA
{
    mangled_assert("?Dispatch@?$ObjInternal2@PBDI_NV?$Functor2Free@PBDI_N@LuaBinding@@@LuaBinding@@UAEHPAUlua_State@@@Z");
    todo("implement");
    __int32 __result = _sub_10001DDA(this, arg);
    return __result;
}

_extern LuaBinding::Obj _sub_100010CE(LuaConfig *, char const *, float (*)(), char const *);
_inline LuaBinding::Obj LuaBinding::Bind<float>(LuaConfig *lc, char const *n, float (*f)(), char const *u) // 0x100010CE
{
    mangled_assert("??$Bind@M@LuaBinding@@YG?AVObj@0@PAVLuaConfig@@PBDP6GMXZ1@Z");
    todo("implement");
    LuaBinding::Obj __result = _sub_100010CE(lc, n, f, u);
    return __result;
}

_extern LuaBinding::Obj _sub_10001135(LuaConfig *, char const *, char const *(*)(), char const *);
_inline LuaBinding::Obj LuaBinding::Bind<char const *>(LuaConfig *lc, char const *n, char const *(*f)(), char const *u) // 0x10001135
{
    mangled_assert("??$Bind@PBD@LuaBinding@@YG?AVObj@0@PAVLuaConfig@@PBDP6GPBDXZ1@Z");
    todo("implement");
    LuaBinding::Obj __result = _sub_10001135(lc, n, f, u);
    return __result;
}

_extern LuaBinding::Obj _sub_100012D1(LuaConfig *, char const *, void (*)(), char const *);
_inline LuaBinding::Obj LuaBinding::Bind<void>(LuaConfig *lc, char const *n, void (*f)(), char const *u) // 0x100012D1
{
    mangled_assert("??$Bind@X@LuaBinding@@YG?AVObj@0@PAVLuaConfig@@PBDP6GXXZ1@Z");
    todo("implement");
    LuaBinding::Obj __result = _sub_100012D1(lc, n, f, u);
    return __result;
}

_extern LuaBinding::Obj _sub_10001338(LuaConfig *, char const *, bool (*)(), char const *);
_inline LuaBinding::Obj LuaBinding::Bind<bool>(LuaConfig *lc, char const *n, bool (*f)(), char const *u) // 0x10001338
{
    mangled_assert("??$Bind@_N@LuaBinding@@YG?AVObj@0@PAVLuaConfig@@PBDP6G_NXZ1@Z");
    todo("implement");
    LuaBinding::Obj __result = _sub_10001338(lc, n, f, u);
    return __result;
}

_extern LuaBinding::Obj _sub_10001000(LuaConfig *, char const *, void (*)(unsigned __int32), char const *);
_inline LuaBinding::Obj LuaBinding::Bind<unsigned int,void>(LuaConfig *lc, char const *n, void (*f)(unsigned __int32), char const *u) // 0x10001000
{
    mangled_assert("??$Bind@IX@LuaBinding@@YG?AVObj@0@PAVLuaConfig@@PBDP6GXI@Z1@Z");
    todo("implement");
    LuaBinding::Obj __result = _sub_10001000(lc, n, f, u);
    return __result;
}

_extern LuaBinding::Obj _sub_10001203(LuaConfig *, char const *, void (*)(char const *), char const *);
_inline LuaBinding::Obj LuaBinding::Bind<char const *,void>(LuaConfig *lc, char const *n, void (*f)(char const *), char const *u) // 0x10001203
{
    mangled_assert("??$Bind@PBDX@LuaBinding@@YG?AVObj@0@PAVLuaConfig@@PBDP6GX1@Z1@Z");
    todo("implement");
    LuaBinding::Obj __result = _sub_10001203(lc, n, f, u);
    return __result;
}

_extern LuaBinding::Obj _sub_1000126A(LuaConfig *, char const *, bool (*)(char const *), char const *);
_inline LuaBinding::Obj LuaBinding::Bind<char const *,bool>(LuaConfig *lc, char const *n, bool (*f)(char const *), char const *u) // 0x1000126A
{
    mangled_assert("??$Bind@PBD_N@LuaBinding@@YG?AVObj@0@PAVLuaConfig@@PBDP6G_N1@Z1@Z");
    todo("implement");
    LuaBinding::Obj __result = _sub_1000126A(lc, n, f, u);
    return __result;
}

_extern LuaBinding::Obj _sub_10001067(LuaConfig *, char const *, bool (*)(unsigned __int32, bool), char const *);
_inline LuaBinding::Obj LuaBinding::Bind<unsigned int,bool,bool>(LuaConfig *lc, char const *n, bool (*f)(unsigned __int32, bool), char const *u) // 0x10001067
{
    mangled_assert("??$Bind@I_N_N@LuaBinding@@YG?AVObj@0@PAVLuaConfig@@PBDP6G_NI_N@Z1@Z");
    todo("implement");
    LuaBinding::Obj __result = _sub_10001067(lc, n, f, u);
    return __result;
}

_extern LuaBinding::Obj _sub_1000119C(LuaConfig *, char const *, bool (*)(char const *, unsigned __int32), char const *);
_inline LuaBinding::Obj LuaBinding::Bind<char const *,unsigned int,bool>(LuaConfig *lc, char const *n, bool (*f)(char const *, unsigned __int32), char const *u) // 0x1000119C
{
    mangled_assert("??$Bind@PBDI_N@LuaBinding@@YG?AVObj@0@PAVLuaConfig@@PBDP6G_N1I@Z1@Z");
    todo("implement");
    LuaBinding::Obj __result = _sub_1000119C(lc, n, f, u);
    return __result;
}

_extern _sub_1000376C(LuaBinding::CallReturn<void> *const);
_inline LuaBinding::CallReturn<void>::CallReturn<void>() // 0x1000376C
{
    mangled_assert("??0?$CallReturn@X@LuaBinding@@QAE@XZ");
    todo("implement");
    _sub_1000376C(this);
}

_extern bool _sub_10003EA5(LuaBinding::CallReturn<void> *const, lua_State *);
_inline bool LuaBinding::CallReturn<void>::Store(lua_State *) // 0x10003EA5
{
    mangled_assert("?Store@?$CallReturn@X@LuaBinding@@QAE_NPAUlua_State@@@Z");
    todo("implement");
    bool __result = _sub_10003EA5(this, arg);
    return __result;
}

_extern _sub_10003769(LuaBinding::Call<void> *const);
_inline LuaBinding::Call<void>::Call<void>() // 0x10003769
{
    mangled_assert("??0?$Call@X@LuaBinding@@QAE@XZ");
    todo("implement");
    _sub_10003769(this);
}

_extern void _sub_10003AC5(LuaBinding::Call<void> *const);
_inline LuaBinding::Call<void>::~Call<void>() // 0x10003AC5
{
    mangled_assert("??1?$Call@X@LuaBinding@@QAE@XZ");
    todo("implement");
    _sub_10003AC5(this);
}

_extern bool _sub_10003D5B(LuaBinding::Call<void> *const, LuaConfig *, char const *);
_inline bool LuaBinding::Call<void>::Execute(LuaConfig *, char const *) // 0x10003D5B
{
    mangled_assert("?Execute@?$Call@X@LuaBinding@@QAE_NPAVLuaConfig@@PBD@Z");
    todo("implement");
    bool __result = _sub_10003D5B(this, arg, arg);
    return __result;
}

/* ---------- private code */

#endif // __LUABINDING_H__
/* combined */
#ifndef __LUABINDING_H__
#define __LUABINDING_H__
#pragma once

/* ---------- headers */

/* ---------- constants */

/* ---------- definitions */

struct LuaBinding::StaticBound
{
    char const *name; // 0x0
    __int32 (*func)(lua_State *); // 0x4
};
static_assert(sizeof(LuaBinding::StaticBound) == 8, "Invalid LuaBinding::StaticBound size");

class LuaBinding::Obj
{
public:
    Obj(LuaBinding::Obj const &);
    Obj();
    Obj(LuaBinding::ObjInternalBase *);
    ~Obj();
    LuaBinding::Obj &operator=(LuaBinding::Obj const &);
    bool IsRegistered() const;
    void Reset();
private:
    LuaBinding::ObjInternalBase *m_sharedCb; // 0x0
    static __int32 Dispatcher(lua_State *);
};
static_assert(sizeof(LuaBinding::Obj) == 4, "Invalid LuaBinding::Obj size");

class LuaBinding::ObjInternalBase
{
private:
    ObjInternalBase(LuaBinding::ObjInternalBase const &);
protected:
    ObjInternalBase(LuaConfig *, char const *, char const *);
    virtual ~ObjInternalBase();
public:
    char const *GetFunctionName() const;
    char const *GetFunctionUsage() const;
    virtual __int32 Dispatch(lua_State *) = 0;
protected:
    void CheckArgs(lua_State *, unsigned __int32 const);
private:
    char const *m_funcname; // 0x4
    char const *m_usage; // 0x8
    LuaConfig *m_lc; // 0xC
    __int32 m_count; // 0x10
    LuaBinding::ObjInternalBase &operator=(LuaBinding::ObjInternalBase const &);
};
static_assert(sizeof(LuaBinding::ObjInternalBase) == 20, "Invalid LuaBinding::ObjInternalBase size");

class LuaBinding::ParmTraits<int>
{
public:
    typedef __int32 type;
    static _inline void Push(__int32 const t, lua_State *ls);
    static _inline bool Pop(__int32 &t, lua_State *ls, __int32 n);
};
static_assert(sizeof(LuaBinding::ParmTraits<int>) == 1, "Invalid LuaBinding::ParmTraits<int> size");

class LuaBinding::ParmTraits<bool>
{
public:
    typedef bool type;
    static _inline void Push(bool const t, lua_State *ls);
    static _inline bool Pop(bool &t, lua_State *ls, __int32 n);
};
static_assert(sizeof(LuaBinding::ParmTraits<bool>) == 1, "Invalid LuaBinding::ParmTraits<bool> size");

class LuaBinding::ParmTraits<char const *>
{
public:
    typedef char const *type;
    static _inline void Push(char const *const t, lua_State *ls);
    static _inline bool Pop(char const *&t, lua_State *ls, __int32 n);
};
static_assert(sizeof(LuaBinding::ParmTraits<char const *>) == 1, "Invalid LuaBinding::ParmTraits<char const *> size");

class LuaBinding::ParmTraits<unsigned long>
{
public:
    typedef unsigned long type;
    static void Push(unsigned long const, lua_State *);
    static bool Pop(unsigned long &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::ParmTraits<unsigned long>) == 1, "Invalid LuaBinding::ParmTraits<unsigned long> size");

class LuaBinding::ParmTraits<long>
{
public:
    typedef long type;
    static void Push(long const, lua_State *);
    static _inline bool Pop(long &t, lua_State *ls, __int32 n);
};
static_assert(sizeof(LuaBinding::ParmTraits<long>) == 1, "Invalid LuaBinding::ParmTraits<long> size");

class LuaBinding::ParmTraits<unsigned int>
{
public:
    typedef unsigned __int32 type;
    static _inline void Push(unsigned __int32 const t, lua_State *ls);
    static _inline bool Pop(unsigned __int32 &t, lua_State *ls, __int32 n);
};
static_assert(sizeof(LuaBinding::ParmTraits<unsigned int>) == 1, "Invalid LuaBinding::ParmTraits<unsigned int> size");

class LuaBinding::ParmTraits<float>
{
public:
    typedef float type;
    static _inline void Push(float const t, lua_State *ls);
    static _inline bool Pop(float &t, lua_State *ls, __int32 n);
};
static_assert(sizeof(LuaBinding::ParmTraits<float>) == 1, "Invalid LuaBinding::ParmTraits<float> size");

class LuaBinding::ParmTraits<vector3>
{
public:
    typedef vector3 type;
    static _inline void Push(vector3 const t, lua_State *ls);
    static _inline bool Pop(vector3 &t, lua_State *ls, __int32 n);
};
static_assert(sizeof(LuaBinding::ParmTraits<vector3>) == 1, "Invalid LuaBinding::ParmTraits<vector3> size");

class LuaBinding::ParmTraits<vector2>
{
public:
    typedef vector2 type;
    static void Push(vector2 const, lua_State *);
    static bool Pop(vector2 &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::ParmTraits<vector2>) == 1, "Invalid LuaBinding::ParmTraits<vector2> size");

class LuaBinding::ParmTraits<vector4>
{
public:
    typedef vector4 type;
    static void Push(vector4 const, lua_State *);
    static _inline bool Pop(vector4 &t, lua_State *ls, __int32 n);
};
static_assert(sizeof(LuaBinding::ParmTraits<vector4>) == 1, "Invalid LuaBinding::ParmTraits<vector4> size");

class LuaBinding::ParmTraits<double>
{
public:
    typedef double type;
    static _inline void Push(double const t, lua_State *ls);
    static bool Pop(double &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::ParmTraits<double>) == 1, "Invalid LuaBinding::ParmTraits<double> size");

class LuaBinding::ParmTraits<wchar_t const *>
{
public:
    typedef wchar_t const *type;
    static _inline void Push(wchar_t const *const t, lua_State *ls);
    static _inline bool Pop(wchar_t const *&t, lua_State *ls, __int32 n);
};
static_assert(sizeof(LuaBinding::ParmTraits<wchar_t const *>) == 1, "Invalid LuaBinding::ParmTraits<wchar_t const *> size");

class LuaBinding::IsVoid<void>
{
public:
    typedef double Ask;
};
static_assert(sizeof(LuaBinding::IsVoid<void>) == 1, "Invalid LuaBinding::IsVoid<void> size");

class LuaBinding::Functor0Member<unsigned int,ScriptedFE,unsigned int (__thiscall ScriptedFE::*)(void)const >
{
public:
    typedef ScriptedFE type_class;
    typedef unsigned __int32 *type_func() const;
private:
    ScriptedFE *m_obj; // 0x0
    unsigned __int32 *m_func() const; // 0x4
protected:
    Functor0Member<unsigned int,ScriptedFE,unsigned int (__thiscall ScriptedFE::*)(void)const >(ScriptedFE *, unsigned __int32 *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<unsigned int,ScriptedFE,unsigned int (__thiscall ScriptedFE::*)(void)const >) == 8, "Invalid LuaBinding::Functor0Member<unsigned int,ScriptedFE,unsigned int (__thiscall ScriptedFE::*)(void)const > size");

class LuaBinding::Functor0Member<int,StatLogging,int (__thiscall StatLogging::*)(void)const >
{
public:
    typedef StatLogging type_class;
    typedef __int32 *type_func() const;
private:
    StatLogging *m_obj; // 0x0
    __int32 *m_func() const; // 0x4
protected:
    Functor0Member<int,StatLogging,int (__thiscall StatLogging::*)(void)const >(StatLogging *, __int32 *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<int,StatLogging,int (__thiscall StatLogging::*)(void)const >) == 8, "Invalid LuaBinding::Functor0Member<int,StatLogging,int (__thiscall StatLogging::*)(void)const > size");

class LuaBinding::Functor0Member<unsigned int,StatLogging,unsigned int (__thiscall StatLogging::*)(void)const >
{
public:
    typedef StatLogging type_class;
    typedef unsigned __int32 *type_func() const;
private:
    StatLogging *m_obj; // 0x0
    unsigned __int32 *m_func() const; // 0x4
protected:
    Functor0Member<unsigned int,StatLogging,unsigned int (__thiscall StatLogging::*)(void)const >(StatLogging *, unsigned __int32 *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<unsigned int,StatLogging,unsigned int (__thiscall StatLogging::*)(void)const >) == 8, "Invalid LuaBinding::Functor0Member<unsigned int,StatLogging,unsigned int (__thiscall StatLogging::*)(void)const > size");

class LuaBinding::Functor0Member<void,CpuBuildManager,void (__thiscall CpuBuildManager::*)(void)>
{
public:
    typedef CpuBuildManager type_class;
    typedef void *type_func();
private:
    CpuBuildManager *m_obj; // 0x0
    void *m_func(); // 0x4
protected:
    Functor0Member<void,CpuBuildManager,void (__thiscall CpuBuildManager::*)(void)>(CpuBuildManager *, void *());
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<void,CpuBuildManager,void (__thiscall CpuBuildManager::*)(void)>) == 8, "Invalid LuaBinding::Functor0Member<void,CpuBuildManager,void (__thiscall CpuBuildManager::*)(void)> size");

class LuaBinding::Functor0Member<bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(void)const >
{
public:
    typedef CpuBuildManager type_class;
    typedef bool *type_func() const;
private:
    CpuBuildManager *m_obj; // 0x0
    bool *m_func() const; // 0x4
protected:
    Functor0Member<bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(void)const >(CpuBuildManager *, bool *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(void)const >) == 8, "Invalid LuaBinding::Functor0Member<bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(void)const > size");

class LuaBinding::Functor0Member<unsigned int,CpuBuildManager,unsigned int (__thiscall CpuBuildManager::*)(void)const >
{
public:
    typedef CpuBuildManager type_class;
    typedef unsigned __int32 *type_func() const;
private:
    CpuBuildManager *m_obj; // 0x0
    unsigned __int32 *m_func() const; // 0x4
protected:
    Functor0Member<unsigned int,CpuBuildManager,unsigned int (__thiscall CpuBuildManager::*)(void)const >(CpuBuildManager *, unsigned __int32 *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<unsigned int,CpuBuildManager,unsigned int (__thiscall CpuBuildManager::*)(void)const >) == 8, "Invalid LuaBinding::Functor0Member<unsigned int,CpuBuildManager,unsigned int (__thiscall CpuBuildManager::*)(void)const > size");

class LuaBinding::Functor0Member<double,CpuBuildManager,double (__thiscall CpuBuildManager::*)(void)>
{
public:
    typedef CpuBuildManager type_class;
    typedef double *type_func();
private:
    CpuBuildManager *m_obj; // 0x0
    double *m_func(); // 0x4
protected:
    Functor0Member<double,CpuBuildManager,double (__thiscall CpuBuildManager::*)(void)>(CpuBuildManager *, double *());
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<double,CpuBuildManager,double (__thiscall CpuBuildManager::*)(void)>) == 8, "Invalid LuaBinding::Functor0Member<double,CpuBuildManager,double (__thiscall CpuBuildManager::*)(void)> size");

class LuaBinding::Functor0Member<float,CpuBuildManager,float (__thiscall CpuBuildManager::*)(void)>
{
public:
    typedef CpuBuildManager type_class;
    typedef float *type_func();
private:
    CpuBuildManager *m_obj; // 0x0
    float *m_func(); // 0x4
protected:
    Functor0Member<float,CpuBuildManager,float (__thiscall CpuBuildManager::*)(void)>(CpuBuildManager *, float *());
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<float,CpuBuildManager,float (__thiscall CpuBuildManager::*)(void)>) == 8, "Invalid LuaBinding::Functor0Member<float,CpuBuildManager,float (__thiscall CpuBuildManager::*)(void)> size");

class LuaBinding::Functor0Member<void,CpuFleetCommand,void (__thiscall CpuFleetCommand::*)(void)>
{
public:
    typedef CpuFleetCommand type_class;
    typedef void *type_func();
private:
    CpuFleetCommand *m_obj; // 0x0
    void *m_func(); // 0x4
protected:
    Functor0Member<void,CpuFleetCommand,void (__thiscall CpuFleetCommand::*)(void)>(CpuFleetCommand *, void *());
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<void,CpuFleetCommand,void (__thiscall CpuFleetCommand::*)(void)>) == 8, "Invalid LuaBinding::Functor0Member<void,CpuFleetCommand,void (__thiscall CpuFleetCommand::*)(void)> size");

class LuaBinding::Functor0Member<int,CpuFleetCommand,int (__thiscall CpuFleetCommand::*)(void)const >
{
public:
    typedef CpuFleetCommand type_class;
    typedef __int32 *type_func() const;
private:
    CpuFleetCommand *m_obj; // 0x0
    __int32 *m_func() const; // 0x4
protected:
    Functor0Member<int,CpuFleetCommand,int (__thiscall CpuFleetCommand::*)(void)const >(CpuFleetCommand *, __int32 *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<int,CpuFleetCommand,int (__thiscall CpuFleetCommand::*)(void)const >) == 8, "Invalid LuaBinding::Functor0Member<int,CpuFleetCommand,int (__thiscall CpuFleetCommand::*)(void)const > size");

class LuaBinding::Functor0Member<bool,CpuFleetCommand,bool (__thiscall CpuFleetCommand::*)(void)const >
{
public:
    typedef CpuFleetCommand type_class;
    typedef bool *type_func() const;
private:
    CpuFleetCommand *m_obj; // 0x0
    bool *m_func() const; // 0x4
protected:
    Functor0Member<bool,CpuFleetCommand,bool (__thiscall CpuFleetCommand::*)(void)const >(CpuFleetCommand *, bool *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<bool,CpuFleetCommand,bool (__thiscall CpuFleetCommand::*)(void)const >) == 8, "Invalid LuaBinding::Functor0Member<bool,CpuFleetCommand,bool (__thiscall CpuFleetCommand::*)(void)const > size");

class LuaBinding::Functor0Member<float,CpuFleetCommand,float (__thiscall CpuFleetCommand::*)(void)const >
{
public:
    typedef CpuFleetCommand type_class;
    typedef float *type_func() const;
private:
    CpuFleetCommand *m_obj; // 0x0
    float *m_func() const; // 0x4
protected:
    Functor0Member<float,CpuFleetCommand,float (__thiscall CpuFleetCommand::*)(void)const >(CpuFleetCommand *, float *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<float,CpuFleetCommand,float (__thiscall CpuFleetCommand::*)(void)const >) == 8, "Invalid LuaBinding::Functor0Member<float,CpuFleetCommand,float (__thiscall CpuFleetCommand::*)(void)const > size");

class LuaBinding::Functor0Member<int,CpuPlayerQuery,int (__thiscall CpuPlayerQuery::*)(void)>
{
public:
    typedef CpuPlayerQuery type_class;
    typedef __int32 *type_func();
private:
    CpuPlayerQuery *m_obj; // 0x0
    __int32 *m_func(); // 0x4
protected:
    Functor0Member<int,CpuPlayerQuery,int (__thiscall CpuPlayerQuery::*)(void)>(CpuPlayerQuery *, __int32 *());
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<int,CpuPlayerQuery,int (__thiscall CpuPlayerQuery::*)(void)>) == 8, "Invalid LuaBinding::Functor0Member<int,CpuPlayerQuery,int (__thiscall CpuPlayerQuery::*)(void)> size");

class LuaBinding::Functor0Member<unsigned int,CpuResearchManager,unsigned int (__thiscall CpuResearchManager::*)(void)>
{
public:
    typedef CpuResearchManager type_class;
    typedef unsigned __int32 *type_func();
private:
    CpuResearchManager *m_obj; // 0x0
    unsigned __int32 *m_func(); // 0x4
protected:
    Functor0Member<unsigned int,CpuResearchManager,unsigned int (__thiscall CpuResearchManager::*)(void)>(CpuResearchManager *, unsigned __int32 *());
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<unsigned int,CpuResearchManager,unsigned int (__thiscall CpuResearchManager::*)(void)>) == 8, "Invalid LuaBinding::Functor0Member<unsigned int,CpuResearchManager,unsigned int (__thiscall CpuResearchManager::*)(void)> size");

class LuaBinding::Functor0Member<unsigned int,CpuResearchManager,unsigned int (__thiscall CpuResearchManager::*)(void)const >
{
public:
    typedef CpuResearchManager type_class;
    typedef unsigned __int32 *type_func() const;
private:
    CpuResearchManager *m_obj; // 0x0
    unsigned __int32 *m_func() const; // 0x4
protected:
    Functor0Member<unsigned int,CpuResearchManager,unsigned int (__thiscall CpuResearchManager::*)(void)const >(CpuResearchManager *, unsigned __int32 *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<unsigned int,CpuResearchManager,unsigned int (__thiscall CpuResearchManager::*)(void)const >) == 8, "Invalid LuaBinding::Functor0Member<unsigned int,CpuResearchManager,unsigned int (__thiscall CpuResearchManager::*)(void)const > size");

class LuaBinding::Functor0Member<void,CpuResearchManager,void (__thiscall CpuResearchManager::*)(void)>
{
public:
    typedef CpuResearchManager type_class;
    typedef void *type_func();
private:
    CpuResearchManager *m_obj; // 0x0
    void *m_func(); // 0x4
protected:
    Functor0Member<void,CpuResearchManager,void (__thiscall CpuResearchManager::*)(void)>(CpuResearchManager *, void *());
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<void,CpuResearchManager,void (__thiscall CpuResearchManager::*)(void)>) == 8, "Invalid LuaBinding::Functor0Member<void,CpuResearchManager,void (__thiscall CpuResearchManager::*)(void)> size");

class LuaBinding::Functor0Member<double,CpuResearchManager,double (__thiscall CpuResearchManager::*)(void)>
{
public:
    typedef CpuResearchManager type_class;
    typedef double *type_func();
private:
    CpuResearchManager *m_obj; // 0x0
    double *m_func(); // 0x4
protected:
    Functor0Member<double,CpuResearchManager,double (__thiscall CpuResearchManager::*)(void)>(CpuResearchManager *, double *());
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<double,CpuResearchManager,double (__thiscall CpuResearchManager::*)(void)>) == 8, "Invalid LuaBinding::Functor0Member<double,CpuResearchManager,double (__thiscall CpuResearchManager::*)(void)> size");

class LuaBinding::Functor0Member<unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(void)const >
{
public:
    typedef CpuResourceManager type_class;
    typedef unsigned __int32 *type_func() const;
private:
    CpuResourceManager *m_obj; // 0x0
    unsigned __int32 *m_func() const; // 0x4
protected:
    Functor0Member<unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(void)const >(CpuResourceManager *, unsigned __int32 *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(void)const >) == 8, "Invalid LuaBinding::Functor0Member<unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(void)const > size");

class LuaBinding::Functor0Member<int,HW2CpuPlayer,int (__thiscall HW2CpuPlayer::*)(void)const >
{
public:
    typedef HW2CpuPlayer type_class;
    typedef __int32 *type_func() const;
private:
    HW2CpuPlayer *m_obj; // 0x0
    __int32 *m_func() const; // 0x8
protected:
    Functor0Member<int,HW2CpuPlayer,int (__thiscall HW2CpuPlayer::*)(void)const >(HW2CpuPlayer *, __int32 *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<int,HW2CpuPlayer,int (__thiscall HW2CpuPlayer::*)(void)const >) == 16, "Invalid LuaBinding::Functor0Member<int,HW2CpuPlayer,int (__thiscall HW2CpuPlayer::*)(void)const > size");

class LuaBinding::Functor0Member<unsigned int,HW2CpuPlayer,unsigned int (__thiscall HW2CpuPlayer::*)(void)const >
{
public:
    typedef HW2CpuPlayer type_class;
    typedef unsigned __int32 *type_func() const;
private:
    HW2CpuPlayer *m_obj; // 0x0
    unsigned __int32 *m_func() const; // 0x8
protected:
    Functor0Member<unsigned int,HW2CpuPlayer,unsigned int (__thiscall HW2CpuPlayer::*)(void)const >(HW2CpuPlayer *, unsigned __int32 *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<unsigned int,HW2CpuPlayer,unsigned int (__thiscall HW2CpuPlayer::*)(void)const >) == 16, "Invalid LuaBinding::Functor0Member<unsigned int,HW2CpuPlayer,unsigned int (__thiscall HW2CpuPlayer::*)(void)const > size");

class LuaBinding::Functor0Member<float,HW2CpuPlayer,float (__thiscall HW2CpuPlayer::*)(void)const >
{
public:
    typedef HW2CpuPlayer type_class;
    typedef float *type_func() const;
private:
    HW2CpuPlayer *m_obj; // 0x0
    float *m_func() const; // 0x8
protected:
    Functor0Member<float,HW2CpuPlayer,float (__thiscall HW2CpuPlayer::*)(void)const >(HW2CpuPlayer *, float *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<float,HW2CpuPlayer,float (__thiscall HW2CpuPlayer::*)(void)const >) == 16, "Invalid LuaBinding::Functor0Member<float,HW2CpuPlayer,float (__thiscall HW2CpuPlayer::*)(void)const > size");

class LuaBinding::Functor0Member<void,HW2CpuPlayer,void (__thiscall HW2CpuPlayer::*)(void)>
{
public:
    typedef HW2CpuPlayer type_class;
    typedef void *type_func();
private:
    HW2CpuPlayer *m_obj; // 0x0
    void *m_func(); // 0x8
protected:
    Functor0Member<void,HW2CpuPlayer,void (__thiscall HW2CpuPlayer::*)(void)>(HW2CpuPlayer *, void *());
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<void,HW2CpuPlayer,void (__thiscall HW2CpuPlayer::*)(void)>) == 16, "Invalid LuaBinding::Functor0Member<void,HW2CpuPlayer,void (__thiscall HW2CpuPlayer::*)(void)> size");

class LuaBinding::Functor0Member<void,NISScript,void (__thiscall NISScript::*)(void)>
{
public:
    typedef NISScript type_class;
    typedef void *type_func();
private:
    NISScript *m_obj; // 0x0
    void *m_func(); // 0x4
protected:
    Functor0Member<void,NISScript,void (__thiscall NISScript::*)(void)>(NISScript *, void *());
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<void,NISScript,void (__thiscall NISScript::*)(void)>) == 8, "Invalid LuaBinding::Functor0Member<void,NISScript,void (__thiscall NISScript::*)(void)> size");

class LuaBinding::Functor0Member<int,SimProxy,int (__thiscall SimProxy::*)(void)const >
{
public:
    typedef SimProxy type_class;
    typedef __int32 *type_func() const;
private:
    SimProxy *m_obj; // 0x0
    __int32 *m_func() const; // 0x4
protected:
    Functor0Member<int,SimProxy,int (__thiscall SimProxy::*)(void)const >(SimProxy *, __int32 *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<int,SimProxy,int (__thiscall SimProxy::*)(void)const >) == 8, "Invalid LuaBinding::Functor0Member<int,SimProxy,int (__thiscall SimProxy::*)(void)const > size");

class LuaBinding::Functor0Member<bool,SimProxy,bool (__thiscall SimProxy::*)(void)const >
{
public:
    typedef SimProxy type_class;
    typedef bool *type_func() const;
private:
    SimProxy *m_obj; // 0x0
    bool *m_func() const; // 0x4
protected:
    Functor0Member<bool,SimProxy,bool (__thiscall SimProxy::*)(void)const >(SimProxy *, bool *() const);
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<bool,SimProxy,bool (__thiscall SimProxy::*)(void)const >) == 8, "Invalid LuaBinding::Functor0Member<bool,SimProxy,bool (__thiscall SimProxy::*)(void)const > size");

class LuaBinding::Functor0Member<void,GameObj,void (__thiscall GameObj::*)(void)>
{
public:
    typedef GameObj type_class;
    typedef void *type_func();
private:
    GameObj *m_obj; // 0x0
    void *m_func(); // 0x8
protected:
    Functor0Member<void,GameObj,void (__thiscall GameObj::*)(void)>(GameObj *, void *());
public:
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Member<void,GameObj,void (__thiscall GameObj::*)(void)>) == 16, "Invalid LuaBinding::Functor0Member<void,GameObj,void (__thiscall GameObj::*)(void)> size");

class LuaBinding::Functor0MemberNonConst<void,CpuBuildManager> :
    public LuaBinding::Functor0Member<void,CpuBuildManager,void (__thiscall CpuBuildManager::*)(void)>
{
public:
    _inline Functor0MemberNonConst<void,CpuBuildManager>(CpuBuildManager *, void *());
};
static_assert(sizeof(LuaBinding::Functor0MemberNonConst<void,CpuBuildManager>) == 8, "Invalid LuaBinding::Functor0MemberNonConst<void,CpuBuildManager> size");

class LuaBinding::Functor0MemberNonConst<double,CpuBuildManager> :
    public LuaBinding::Functor0Member<double,CpuBuildManager,double (__thiscall CpuBuildManager::*)(void)>
{
public:
    _inline Functor0MemberNonConst<double,CpuBuildManager>(CpuBuildManager *, double *());
};
static_assert(sizeof(LuaBinding::Functor0MemberNonConst<double,CpuBuildManager>) == 8, "Invalid LuaBinding::Functor0MemberNonConst<double,CpuBuildManager> size");

class LuaBinding::Functor0MemberNonConst<float,CpuBuildManager> :
    public LuaBinding::Functor0Member<float,CpuBuildManager,float (__thiscall CpuBuildManager::*)(void)>
{
public:
    _inline Functor0MemberNonConst<float,CpuBuildManager>(CpuBuildManager *, float *());
};
static_assert(sizeof(LuaBinding::Functor0MemberNonConst<float,CpuBuildManager>) == 8, "Invalid LuaBinding::Functor0MemberNonConst<float,CpuBuildManager> size");

class LuaBinding::Functor0MemberNonConst<void,CpuFleetCommand> :
    public LuaBinding::Functor0Member<void,CpuFleetCommand,void (__thiscall CpuFleetCommand::*)(void)>
{
public:
    _inline Functor0MemberNonConst<void,CpuFleetCommand>(CpuFleetCommand *, void *());
};
static_assert(sizeof(LuaBinding::Functor0MemberNonConst<void,CpuFleetCommand>) == 8, "Invalid LuaBinding::Functor0MemberNonConst<void,CpuFleetCommand> size");

class LuaBinding::Functor0MemberNonConst<int,CpuPlayerQuery> :
    public LuaBinding::Functor0Member<int,CpuPlayerQuery,int (__thiscall CpuPlayerQuery::*)(void)>
{
public:
    _inline Functor0MemberNonConst<int,CpuPlayerQuery>(CpuPlayerQuery *, __int32 *());
};
static_assert(sizeof(LuaBinding::Functor0MemberNonConst<int,CpuPlayerQuery>) == 8, "Invalid LuaBinding::Functor0MemberNonConst<int,CpuPlayerQuery> size");

class LuaBinding::Functor0MemberNonConst<unsigned int,CpuResearchManager> :
    public LuaBinding::Functor0Member<unsigned int,CpuResearchManager,unsigned int (__thiscall CpuResearchManager::*)(void)>
{
public:
    _inline Functor0MemberNonConst<unsigned int,CpuResearchManager>(CpuResearchManager *, unsigned __int32 *());
};
static_assert(sizeof(LuaBinding::Functor0MemberNonConst<unsigned int,CpuResearchManager>) == 8, "Invalid LuaBinding::Functor0MemberNonConst<unsigned int,CpuResearchManager> size");

class LuaBinding::Functor0MemberNonConst<void,CpuResearchManager> :
    public LuaBinding::Functor0Member<void,CpuResearchManager,void (__thiscall CpuResearchManager::*)(void)>
{
public:
    _inline Functor0MemberNonConst<void,CpuResearchManager>(CpuResearchManager *, void *());
};
static_assert(sizeof(LuaBinding::Functor0MemberNonConst<void,CpuResearchManager>) == 8, "Invalid LuaBinding::Functor0MemberNonConst<void,CpuResearchManager> size");

class LuaBinding::Functor0MemberNonConst<double,CpuResearchManager> :
    public LuaBinding::Functor0Member<double,CpuResearchManager,double (__thiscall CpuResearchManager::*)(void)>
{
public:
    _inline Functor0MemberNonConst<double,CpuResearchManager>(CpuResearchManager *, double *());
};
static_assert(sizeof(LuaBinding::Functor0MemberNonConst<double,CpuResearchManager>) == 8, "Invalid LuaBinding::Functor0MemberNonConst<double,CpuResearchManager> size");

class LuaBinding::Functor0MemberNonConst<void,HW2CpuPlayer> :
    public LuaBinding::Functor0Member<void,HW2CpuPlayer,void (__thiscall HW2CpuPlayer::*)(void)>
{
public:
    _inline Functor0MemberNonConst<void,HW2CpuPlayer>(HW2CpuPlayer *, void *());
};
static_assert(sizeof(LuaBinding::Functor0MemberNonConst<void,HW2CpuPlayer>) == 16, "Invalid LuaBinding::Functor0MemberNonConst<void,HW2CpuPlayer> size");

class LuaBinding::Functor0MemberNonConst<void,NISScript> :
    public LuaBinding::Functor0Member<void,NISScript,void (__thiscall NISScript::*)(void)>
{
public:
    _inline Functor0MemberNonConst<void,NISScript>(NISScript *, void *());
};
static_assert(sizeof(LuaBinding::Functor0MemberNonConst<void,NISScript>) == 8, "Invalid LuaBinding::Functor0MemberNonConst<void,NISScript> size");

class LuaBinding::Functor0MemberNonConst<void,GameObj> :
    public LuaBinding::Functor0Member<void,GameObj,void (__thiscall GameObj::*)(void)>
{
public:
    _inline Functor0MemberNonConst<void,GameObj>(GameObj *, void *());
};
static_assert(sizeof(LuaBinding::Functor0MemberNonConst<void,GameObj>) == 16, "Invalid LuaBinding::Functor0MemberNonConst<void,GameObj> size");

class LuaBinding::Functor0MemberConst<unsigned int,ScriptedFE> :
    public LuaBinding::Functor0Member<unsigned int,ScriptedFE,unsigned int (__thiscall ScriptedFE::*)(void)const >
{
public:
    _inline Functor0MemberConst<unsigned int,ScriptedFE>(ScriptedFE *, unsigned __int32 *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<unsigned int,ScriptedFE>) == 8, "Invalid LuaBinding::Functor0MemberConst<unsigned int,ScriptedFE> size");

class LuaBinding::Functor0MemberConst<int,StatLogging> :
    public LuaBinding::Functor0Member<int,StatLogging,int (__thiscall StatLogging::*)(void)const >
{
public:
    _inline Functor0MemberConst<int,StatLogging>(StatLogging *, __int32 *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<int,StatLogging>) == 8, "Invalid LuaBinding::Functor0MemberConst<int,StatLogging> size");

class LuaBinding::Functor0MemberConst<unsigned int,StatLogging> :
    public LuaBinding::Functor0Member<unsigned int,StatLogging,unsigned int (__thiscall StatLogging::*)(void)const >
{
public:
    _inline Functor0MemberConst<unsigned int,StatLogging>(StatLogging *, unsigned __int32 *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<unsigned int,StatLogging>) == 8, "Invalid LuaBinding::Functor0MemberConst<unsigned int,StatLogging> size");

class LuaBinding::Functor0MemberConst<bool,CpuBuildManager> :
    public LuaBinding::Functor0Member<bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(void)const >
{
public:
    _inline Functor0MemberConst<bool,CpuBuildManager>(CpuBuildManager *, bool *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<bool,CpuBuildManager>) == 8, "Invalid LuaBinding::Functor0MemberConst<bool,CpuBuildManager> size");

class LuaBinding::Functor0MemberConst<unsigned int,CpuBuildManager> :
    public LuaBinding::Functor0Member<unsigned int,CpuBuildManager,unsigned int (__thiscall CpuBuildManager::*)(void)const >
{
public:
    _inline Functor0MemberConst<unsigned int,CpuBuildManager>(CpuBuildManager *, unsigned __int32 *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<unsigned int,CpuBuildManager>) == 8, "Invalid LuaBinding::Functor0MemberConst<unsigned int,CpuBuildManager> size");

class LuaBinding::Functor0MemberConst<int,CpuFleetCommand> :
    public LuaBinding::Functor0Member<int,CpuFleetCommand,int (__thiscall CpuFleetCommand::*)(void)const >
{
public:
    _inline Functor0MemberConst<int,CpuFleetCommand>(CpuFleetCommand *, __int32 *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<int,CpuFleetCommand>) == 8, "Invalid LuaBinding::Functor0MemberConst<int,CpuFleetCommand> size");

class LuaBinding::Functor0MemberConst<bool,CpuFleetCommand> :
    public LuaBinding::Functor0Member<bool,CpuFleetCommand,bool (__thiscall CpuFleetCommand::*)(void)const >
{
public:
    _inline Functor0MemberConst<bool,CpuFleetCommand>(CpuFleetCommand *, bool *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<bool,CpuFleetCommand>) == 8, "Invalid LuaBinding::Functor0MemberConst<bool,CpuFleetCommand> size");

class LuaBinding::Functor0MemberConst<float,CpuFleetCommand> :
    public LuaBinding::Functor0Member<float,CpuFleetCommand,float (__thiscall CpuFleetCommand::*)(void)const >
{
public:
    _inline Functor0MemberConst<float,CpuFleetCommand>(CpuFleetCommand *, float *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<float,CpuFleetCommand>) == 8, "Invalid LuaBinding::Functor0MemberConst<float,CpuFleetCommand> size");

class LuaBinding::Functor0MemberConst<unsigned int,CpuResearchManager> :
    public LuaBinding::Functor0Member<unsigned int,CpuResearchManager,unsigned int (__thiscall CpuResearchManager::*)(void)const >
{
public:
    _inline Functor0MemberConst<unsigned int,CpuResearchManager>(CpuResearchManager *, unsigned __int32 *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<unsigned int,CpuResearchManager>) == 8, "Invalid LuaBinding::Functor0MemberConst<unsigned int,CpuResearchManager> size");

class LuaBinding::Functor0MemberConst<unsigned int,CpuResourceManager> :
    public LuaBinding::Functor0Member<unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(void)const >
{
public:
    _inline Functor0MemberConst<unsigned int,CpuResourceManager>(CpuResourceManager *, unsigned __int32 *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<unsigned int,CpuResourceManager>) == 8, "Invalid LuaBinding::Functor0MemberConst<unsigned int,CpuResourceManager> size");

class LuaBinding::Functor0MemberConst<int,HW2CpuPlayer> :
    public LuaBinding::Functor0Member<int,HW2CpuPlayer,int (__thiscall HW2CpuPlayer::*)(void)const >
{
public:
    _inline Functor0MemberConst<int,HW2CpuPlayer>(HW2CpuPlayer *, __int32 *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<int,HW2CpuPlayer>) == 16, "Invalid LuaBinding::Functor0MemberConst<int,HW2CpuPlayer> size");

class LuaBinding::Functor0MemberConst<unsigned int,HW2CpuPlayer> :
    public LuaBinding::Functor0Member<unsigned int,HW2CpuPlayer,unsigned int (__thiscall HW2CpuPlayer::*)(void)const >
{
public:
    _inline Functor0MemberConst<unsigned int,HW2CpuPlayer>(HW2CpuPlayer *, unsigned __int32 *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<unsigned int,HW2CpuPlayer>) == 16, "Invalid LuaBinding::Functor0MemberConst<unsigned int,HW2CpuPlayer> size");

class LuaBinding::Functor0MemberConst<float,HW2CpuPlayer> :
    public LuaBinding::Functor0Member<float,HW2CpuPlayer,float (__thiscall HW2CpuPlayer::*)(void)const >
{
public:
    _inline Functor0MemberConst<float,HW2CpuPlayer>(HW2CpuPlayer *, float *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<float,HW2CpuPlayer>) == 16, "Invalid LuaBinding::Functor0MemberConst<float,HW2CpuPlayer> size");

class LuaBinding::Functor0MemberConst<int,SimProxy> :
    public LuaBinding::Functor0Member<int,SimProxy,int (__thiscall SimProxy::*)(void)const >
{
public:
    _inline Functor0MemberConst<int,SimProxy>(SimProxy *, __int32 *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<int,SimProxy>) == 8, "Invalid LuaBinding::Functor0MemberConst<int,SimProxy> size");

class LuaBinding::Functor0MemberConst<bool,SimProxy> :
    public LuaBinding::Functor0Member<bool,SimProxy,bool (__thiscall SimProxy::*)(void)const >
{
public:
    _inline Functor0MemberConst<bool,SimProxy>(SimProxy *, bool *() const);
};
static_assert(sizeof(LuaBinding::Functor0MemberConst<bool,SimProxy>) == 8, "Invalid LuaBinding::Functor0MemberConst<bool,SimProxy> size");

class LuaBinding::Functor0Free<void>
{
public:
    typedef void (*type_func)();
private:
    void (*m_func)(); // 0x0
public:
    _inline Functor0Free<void>(void (*)());
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Free<void>) == 4, "Invalid LuaBinding::Functor0Free<void> size");

class LuaBinding::Functor0Free<char const *>
{
public:
    typedef char const *(*type_func)();
private:
    char const *(*m_func)(); // 0x0
public:
    _inline Functor0Free<char const *>(char const *(*)());
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Free<char const *>) == 4, "Invalid LuaBinding::Functor0Free<char const *> size");

class LuaBinding::Functor0Free<int>
{
public:
    typedef __int32 (*type_func)();
private:
    __int32 (*m_func)(); // 0x0
public:
    _inline Functor0Free<int>(__int32 (*)());
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Free<int>) == 4, "Invalid LuaBinding::Functor0Free<int> size");

class LuaBinding::Functor0Free<bool>
{
public:
    typedef bool (*type_func)();
private:
    bool (*m_func)(); // 0x0
public:
    _inline Functor0Free<bool>(bool (*)());
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Free<bool>) == 4, "Invalid LuaBinding::Functor0Free<bool> size");

class LuaBinding::Functor0Free<float>
{
public:
    typedef float (*type_func)();
private:
    float (*m_func)(); // 0x0
public:
    _inline Functor0Free<float>(float (*)());
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Free<float>) == 4, "Invalid LuaBinding::Functor0Free<float> size");

class LuaBinding::Functor0Free<unsigned int>
{
public:
    typedef unsigned __int32 (*type_func)();
private:
    unsigned __int32 (*m_func)(); // 0x0
public:
    _inline Functor0Free<unsigned int>(unsigned __int32 (*)());
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Free<unsigned int>) == 4, "Invalid LuaBinding::Functor0Free<unsigned int> size");

class LuaBinding::Functor0Free<vector3>
{
public:
    typedef vector3 (*type_func)();
private:
    vector3 (*m_func)(); // 0x0
public:
    _inline Functor0Free<vector3>(vector3 (*)());
    __int32 operator()(double const &, lua_State *);
    __int32 operator()(char const &, lua_State *);
};
static_assert(sizeof(LuaBinding::Functor0Free<vector3>) == 4, "Invalid LuaBinding::Functor0Free<vector3> size");

class LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0Free<void> m_func; // 0x14
public:
    ObjInternal0<void,LuaBinding::Functor0Free<void> >(LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> > const &); /* compiler_generated() */
    _inline ObjInternal0<void,LuaBinding::Functor0Free<void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<void> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<void,LuaBinding::Functor0Free<void> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> > &operator=(LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> >) == 24, "Invalid LuaBinding::ObjInternal0<void,LuaBinding::Functor0Free<void> > size");

class LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,ScriptedFE> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<unsigned int,ScriptedFE> m_func; // 0x14
public:
    ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,ScriptedFE> >(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,ScriptedFE> > const &); /* compiler_generated() */
    _inline ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,ScriptedFE> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<unsigned int,ScriptedFE> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,ScriptedFE> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,ScriptedFE> > &operator=(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,ScriptedFE> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,ScriptedFE> >) == 28, "Invalid LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,ScriptedFE> > size");

class LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0Free<char const *> m_func; // 0x14
public:
    ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> >(LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> > const &); /* compiler_generated() */
    _inline ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<char const *> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> > &operator=(LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> >) == 24, "Invalid LuaBinding::ObjInternal0<char const *,LuaBinding::Functor0Free<char const *> > size");

class LuaBinding::ObjInternal0<int,LuaBinding::Functor0Free<int> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0Free<int> m_func; // 0x14
public:
    ObjInternal0<int,LuaBinding::Functor0Free<int> >(LuaBinding::ObjInternal0<int,LuaBinding::Functor0Free<int> > const &); /* compiler_generated() */
    _inline ObjInternal0<int,LuaBinding::Functor0Free<int> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<int> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<int,LuaBinding::Functor0Free<int> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<int,LuaBinding::Functor0Free<int> > &operator=(LuaBinding::ObjInternal0<int,LuaBinding::Functor0Free<int> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<int,LuaBinding::Functor0Free<int> >) == 24, "Invalid LuaBinding::ObjInternal0<int,LuaBinding::Functor0Free<int> > size");

class LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,StatLogging> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<int,StatLogging> m_func; // 0x14
public:
    ObjInternal0<int,LuaBinding::Functor0MemberConst<int,StatLogging> >(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,StatLogging> > const &); /* compiler_generated() */
    _inline ObjInternal0<int,LuaBinding::Functor0MemberConst<int,StatLogging> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<int,StatLogging> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<int,LuaBinding::Functor0MemberConst<int,StatLogging> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,StatLogging> > &operator=(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,StatLogging> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,StatLogging> >) == 28, "Invalid LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,StatLogging> > size");

class LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,StatLogging> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<unsigned int,StatLogging> m_func; // 0x14
public:
    ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,StatLogging> >(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,StatLogging> > const &); /* compiler_generated() */
    _inline ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,StatLogging> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<unsigned int,StatLogging> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,StatLogging> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,StatLogging> > &operator=(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,StatLogging> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,StatLogging> >) == 28, "Invalid LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,StatLogging> > size");

class LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuBuildManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberNonConst<void,CpuBuildManager> m_func; // 0x14
public:
    ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuBuildManager> >(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuBuildManager> > const &); /* compiler_generated() */
    _inline ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuBuildManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberNonConst<void,CpuBuildManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuBuildManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuBuildManager> > &operator=(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuBuildManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuBuildManager> >) == 28, "Invalid LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuBuildManager> > size");

class LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuBuildManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<bool,CpuBuildManager> m_func; // 0x14
public:
    ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuBuildManager> >(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuBuildManager> > const &); /* compiler_generated() */
    _inline ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuBuildManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<bool,CpuBuildManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuBuildManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuBuildManager> > &operator=(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuBuildManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuBuildManager> >) == 28, "Invalid LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuBuildManager> > size");

class LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuBuildManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<unsigned int,CpuBuildManager> m_func; // 0x14
public:
    ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuBuildManager> >(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuBuildManager> > const &); /* compiler_generated() */
    _inline ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuBuildManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<unsigned int,CpuBuildManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuBuildManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuBuildManager> > &operator=(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuBuildManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuBuildManager> >) == 28, "Invalid LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuBuildManager> > size");

class LuaBinding::ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuBuildManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberNonConst<double,CpuBuildManager> m_func; // 0x14
public:
    ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuBuildManager> >(LuaBinding::ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuBuildManager> > const &); /* compiler_generated() */
    _inline ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuBuildManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberNonConst<double,CpuBuildManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuBuildManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuBuildManager> > &operator=(LuaBinding::ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuBuildManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuBuildManager> >) == 28, "Invalid LuaBinding::ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuBuildManager> > size");

class LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberNonConst<float,CpuBuildManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberNonConst<float,CpuBuildManager> m_func; // 0x14
public:
    ObjInternal0<float,LuaBinding::Functor0MemberNonConst<float,CpuBuildManager> >(LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberNonConst<float,CpuBuildManager> > const &); /* compiler_generated() */
    _inline ObjInternal0<float,LuaBinding::Functor0MemberNonConst<float,CpuBuildManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberNonConst<float,CpuBuildManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<float,LuaBinding::Functor0MemberNonConst<float,CpuBuildManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberNonConst<float,CpuBuildManager> > &operator=(LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberNonConst<float,CpuBuildManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberNonConst<float,CpuBuildManager> >) == 28, "Invalid LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberNonConst<float,CpuBuildManager> > size");

class LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuFleetCommand> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberNonConst<void,CpuFleetCommand> m_func; // 0x14
public:
    ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuFleetCommand> >(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuFleetCommand> > const &); /* compiler_generated() */
    _inline ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuFleetCommand> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberNonConst<void,CpuFleetCommand> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuFleetCommand> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuFleetCommand> > &operator=(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuFleetCommand> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuFleetCommand> >) == 28, "Invalid LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuFleetCommand> > size");

class LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,CpuFleetCommand> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<int,CpuFleetCommand> m_func; // 0x14
public:
    ObjInternal0<int,LuaBinding::Functor0MemberConst<int,CpuFleetCommand> >(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,CpuFleetCommand> > const &); /* compiler_generated() */
    _inline ObjInternal0<int,LuaBinding::Functor0MemberConst<int,CpuFleetCommand> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<int,CpuFleetCommand> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<int,LuaBinding::Functor0MemberConst<int,CpuFleetCommand> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,CpuFleetCommand> > &operator=(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,CpuFleetCommand> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,CpuFleetCommand> >) == 28, "Invalid LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,CpuFleetCommand> > size");

class LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuFleetCommand> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<bool,CpuFleetCommand> m_func; // 0x14
public:
    ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuFleetCommand> >(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuFleetCommand> > const &); /* compiler_generated() */
    _inline ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuFleetCommand> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<bool,CpuFleetCommand> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuFleetCommand> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuFleetCommand> > &operator=(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuFleetCommand> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuFleetCommand> >) == 28, "Invalid LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,CpuFleetCommand> > size");

class LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberConst<float,CpuFleetCommand> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<float,CpuFleetCommand> m_func; // 0x14
public:
    ObjInternal0<float,LuaBinding::Functor0MemberConst<float,CpuFleetCommand> >(LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberConst<float,CpuFleetCommand> > const &); /* compiler_generated() */
    _inline ObjInternal0<float,LuaBinding::Functor0MemberConst<float,CpuFleetCommand> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<float,CpuFleetCommand> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<float,LuaBinding::Functor0MemberConst<float,CpuFleetCommand> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberConst<float,CpuFleetCommand> > &operator=(LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberConst<float,CpuFleetCommand> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberConst<float,CpuFleetCommand> >) == 28, "Invalid LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberConst<float,CpuFleetCommand> > size");

class LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberNonConst<int,CpuPlayerQuery> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberNonConst<int,CpuPlayerQuery> m_func; // 0x14
public:
    ObjInternal0<int,LuaBinding::Functor0MemberNonConst<int,CpuPlayerQuery> >(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberNonConst<int,CpuPlayerQuery> > const &); /* compiler_generated() */
    _inline ObjInternal0<int,LuaBinding::Functor0MemberNonConst<int,CpuPlayerQuery> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberNonConst<int,CpuPlayerQuery> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<int,LuaBinding::Functor0MemberNonConst<int,CpuPlayerQuery> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberNonConst<int,CpuPlayerQuery> > &operator=(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberNonConst<int,CpuPlayerQuery> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberNonConst<int,CpuPlayerQuery> >) == 28, "Invalid LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberNonConst<int,CpuPlayerQuery> > size");

class LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberNonConst<unsigned int,CpuResearchManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberNonConst<unsigned int,CpuResearchManager> m_func; // 0x14
public:
    ObjInternal0<unsigned int,LuaBinding::Functor0MemberNonConst<unsigned int,CpuResearchManager> >(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberNonConst<unsigned int,CpuResearchManager> > const &); /* compiler_generated() */
    _inline ObjInternal0<unsigned int,LuaBinding::Functor0MemberNonConst<unsigned int,CpuResearchManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberNonConst<unsigned int,CpuResearchManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<unsigned int,LuaBinding::Functor0MemberNonConst<unsigned int,CpuResearchManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberNonConst<unsigned int,CpuResearchManager> > &operator=(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberNonConst<unsigned int,CpuResearchManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberNonConst<unsigned int,CpuResearchManager> >) == 28, "Invalid LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberNonConst<unsigned int,CpuResearchManager> > size");

class LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResearchManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<unsigned int,CpuResearchManager> m_func; // 0x14
public:
    ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResearchManager> >(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResearchManager> > const &); /* compiler_generated() */
    _inline ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResearchManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<unsigned int,CpuResearchManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResearchManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResearchManager> > &operator=(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResearchManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResearchManager> >) == 28, "Invalid LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResearchManager> > size");

class LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuResearchManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberNonConst<void,CpuResearchManager> m_func; // 0x14
public:
    ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuResearchManager> >(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuResearchManager> > const &); /* compiler_generated() */
    _inline ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuResearchManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberNonConst<void,CpuResearchManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuResearchManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuResearchManager> > &operator=(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuResearchManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuResearchManager> >) == 28, "Invalid LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,CpuResearchManager> > size");

class LuaBinding::ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuResearchManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberNonConst<double,CpuResearchManager> m_func; // 0x14
public:
    ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuResearchManager> >(LuaBinding::ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuResearchManager> > const &); /* compiler_generated() */
    _inline ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuResearchManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberNonConst<double,CpuResearchManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuResearchManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuResearchManager> > &operator=(LuaBinding::ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuResearchManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuResearchManager> >) == 28, "Invalid LuaBinding::ObjInternal0<double,LuaBinding::Functor0MemberNonConst<double,CpuResearchManager> > size");

class LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResourceManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<unsigned int,CpuResourceManager> m_func; // 0x14
public:
    ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResourceManager> >(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResourceManager> > const &); /* compiler_generated() */
    _inline ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResourceManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<unsigned int,CpuResourceManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResourceManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResourceManager> > &operator=(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResourceManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResourceManager> >) == 28, "Invalid LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,CpuResourceManager> > size");

class LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,HW2CpuPlayer> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<int,HW2CpuPlayer> m_func; // 0x18
public:
    ObjInternal0<int,LuaBinding::Functor0MemberConst<int,HW2CpuPlayer> >(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,HW2CpuPlayer> > const &); /* compiler_generated() */
    _inline ObjInternal0<int,LuaBinding::Functor0MemberConst<int,HW2CpuPlayer> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<int,HW2CpuPlayer> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<int,LuaBinding::Functor0MemberConst<int,HW2CpuPlayer> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,HW2CpuPlayer> > &operator=(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,HW2CpuPlayer> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,HW2CpuPlayer> >) == 40, "Invalid LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,HW2CpuPlayer> > size");

class LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,HW2CpuPlayer> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<unsigned int,HW2CpuPlayer> m_func; // 0x18
public:
    ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,HW2CpuPlayer> >(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,HW2CpuPlayer> > const &); /* compiler_generated() */
    _inline ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,HW2CpuPlayer> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<unsigned int,HW2CpuPlayer> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,HW2CpuPlayer> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,HW2CpuPlayer> > &operator=(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,HW2CpuPlayer> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,HW2CpuPlayer> >) == 40, "Invalid LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0MemberConst<unsigned int,HW2CpuPlayer> > size");

class LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberConst<float,HW2CpuPlayer> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<float,HW2CpuPlayer> m_func; // 0x18
public:
    ObjInternal0<float,LuaBinding::Functor0MemberConst<float,HW2CpuPlayer> >(LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberConst<float,HW2CpuPlayer> > const &); /* compiler_generated() */
    _inline ObjInternal0<float,LuaBinding::Functor0MemberConst<float,HW2CpuPlayer> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<float,HW2CpuPlayer> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<float,LuaBinding::Functor0MemberConst<float,HW2CpuPlayer> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberConst<float,HW2CpuPlayer> > &operator=(LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberConst<float,HW2CpuPlayer> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberConst<float,HW2CpuPlayer> >) == 40, "Invalid LuaBinding::ObjInternal0<float,LuaBinding::Functor0MemberConst<float,HW2CpuPlayer> > size");

class LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,HW2CpuPlayer> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberNonConst<void,HW2CpuPlayer> m_func; // 0x18
public:
    ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,HW2CpuPlayer> >(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,HW2CpuPlayer> > const &); /* compiler_generated() */
    _inline ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,HW2CpuPlayer> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberNonConst<void,HW2CpuPlayer> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,HW2CpuPlayer> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,HW2CpuPlayer> > &operator=(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,HW2CpuPlayer> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,HW2CpuPlayer> >) == 40, "Invalid LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,HW2CpuPlayer> > size");

class LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,NISScript> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberNonConst<void,NISScript> m_func; // 0x14
public:
    ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,NISScript> >(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,NISScript> > const &); /* compiler_generated() */
    _inline ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,NISScript> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberNonConst<void,NISScript> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,NISScript> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,NISScript> > &operator=(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,NISScript> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,NISScript> >) == 28, "Invalid LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,NISScript> > size");

class LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0Free<bool> m_func; // 0x14
public:
    ObjInternal0<bool,LuaBinding::Functor0Free<bool> >(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> > const &); /* compiler_generated() */
    _inline ObjInternal0<bool,LuaBinding::Functor0Free<bool> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<bool> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<bool,LuaBinding::Functor0Free<bool> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> > &operator=(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> >) == 24, "Invalid LuaBinding::ObjInternal0<bool,LuaBinding::Functor0Free<bool> > size");

class LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0Free<float> m_func; // 0x14
public:
    ObjInternal0<float,LuaBinding::Functor0Free<float> >(LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> > const &); /* compiler_generated() */
    _inline ObjInternal0<float,LuaBinding::Functor0Free<float> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<float> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<float,LuaBinding::Functor0Free<float> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> > &operator=(LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> >) == 24, "Invalid LuaBinding::ObjInternal0<float,LuaBinding::Functor0Free<float> > size");

class LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,SimProxy> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<int,SimProxy> m_func; // 0x14
public:
    ObjInternal0<int,LuaBinding::Functor0MemberConst<int,SimProxy> >(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,SimProxy> > const &); /* compiler_generated() */
    _inline ObjInternal0<int,LuaBinding::Functor0MemberConst<int,SimProxy> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<int,SimProxy> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<int,LuaBinding::Functor0MemberConst<int,SimProxy> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,SimProxy> > &operator=(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,SimProxy> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,SimProxy> >) == 28, "Invalid LuaBinding::ObjInternal0<int,LuaBinding::Functor0MemberConst<int,SimProxy> > size");

class LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,SimProxy> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberConst<bool,SimProxy> m_func; // 0x14
public:
    ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,SimProxy> >(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,SimProxy> > const &); /* compiler_generated() */
    _inline ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,SimProxy> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberConst<bool,SimProxy> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,SimProxy> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,SimProxy> > &operator=(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,SimProxy> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,SimProxy> >) == 28, "Invalid LuaBinding::ObjInternal0<bool,LuaBinding::Functor0MemberConst<bool,SimProxy> > size");

class LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0Free<unsigned int> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0Free<unsigned int> m_func; // 0x14
public:
    ObjInternal0<unsigned int,LuaBinding::Functor0Free<unsigned int> >(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0Free<unsigned int> > const &); /* compiler_generated() */
    _inline ObjInternal0<unsigned int,LuaBinding::Functor0Free<unsigned int> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<unsigned int> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<unsigned int,LuaBinding::Functor0Free<unsigned int> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0Free<unsigned int> > &operator=(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0Free<unsigned int> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0Free<unsigned int> >) == 24, "Invalid LuaBinding::ObjInternal0<unsigned int,LuaBinding::Functor0Free<unsigned int> > size");

class LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,GameObj> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0MemberNonConst<void,GameObj> m_func; // 0x18
public:
    ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,GameObj> >(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,GameObj> > const &); /* compiler_generated() */
    _inline ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,GameObj> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0MemberNonConst<void,GameObj> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,GameObj> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,GameObj> > &operator=(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,GameObj> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,GameObj> >) == 40, "Invalid LuaBinding::ObjInternal0<void,LuaBinding::Functor0MemberNonConst<void,GameObj> > size");

class LuaBinding::ObjInternal0<vector3,LuaBinding::Functor0Free<vector3> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor0Free<vector3> m_func; // 0x14
public:
    ObjInternal0<vector3,LuaBinding::Functor0Free<vector3> >(LuaBinding::ObjInternal0<vector3,LuaBinding::Functor0Free<vector3> > const &); /* compiler_generated() */
    _inline ObjInternal0<vector3,LuaBinding::Functor0Free<vector3> >(LuaConfig *, char const *, char const *, LuaBinding::Functor0Free<vector3> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal0<vector3,LuaBinding::Functor0Free<vector3> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal0<vector3,LuaBinding::Functor0Free<vector3> > &operator=(LuaBinding::ObjInternal0<vector3,LuaBinding::Functor0Free<vector3> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal0<vector3,LuaBinding::Functor0Free<vector3> >) == 24, "Invalid LuaBinding::ObjInternal0<vector3,LuaBinding::Functor0Free<vector3> > size");

class LuaBinding::Functor1Member<unsigned int,char const *,ScriptedFE,char const * (__thiscall ScriptedFE::*)(unsigned int)const >
{
public:
    typedef ScriptedFE type_class;
    typedef char const **type_func(unsigned __int32) const;
private:
    ScriptedFE *m_obj; // 0x0
    char const **m_func(unsigned __int32) const; // 0x4
protected:
    Functor1Member<unsigned int,char const *,ScriptedFE,char const * (__thiscall ScriptedFE::*)(unsigned int)const >(ScriptedFE *, char const **(unsigned __int32) const);
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,char const *,ScriptedFE,char const * (__thiscall ScriptedFE::*)(unsigned int)const >) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,char const *,ScriptedFE,char const * (__thiscall ScriptedFE::*)(unsigned int)const > size");

class LuaBinding::Functor1Member<char const *,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *)>
{
public:
    typedef ScriptedFE type_class;
    typedef void *type_func(char const *);
private:
    ScriptedFE *m_obj; // 0x0
    void *m_func(char const *); // 0x4
protected:
    Functor1Member<char const *,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *)>(ScriptedFE *, void *(char const *));
public:
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Member<char const *,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *)>) == 8, "Invalid LuaBinding::Functor1Member<char const *,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *)> size");

class LuaBinding::Functor1Member<unsigned int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int)>
{
public:
    typedef ScriptedFE type_class;
    typedef void *type_func(unsigned __int32);
private:
    ScriptedFE *m_obj; // 0x0
    void *m_func(unsigned __int32); // 0x4
protected:
    Functor1Member<unsigned int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int)>(ScriptedFE *, void *(unsigned __int32));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int)>) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int)> size");

class LuaBinding::Functor1Member<unsigned int,unsigned int,StatLogging,unsigned int (__thiscall StatLogging::*)(unsigned int)const >
{
public:
    typedef StatLogging type_class;
    typedef unsigned __int32 *type_func(unsigned __int32) const;
private:
    StatLogging *m_obj; // 0x0
    unsigned __int32 *m_func(unsigned __int32) const; // 0x4
protected:
    Functor1Member<unsigned int,unsigned int,StatLogging,unsigned int (__thiscall StatLogging::*)(unsigned int)const >(StatLogging *, unsigned __int32 *(unsigned __int32) const);
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,unsigned int,StatLogging,unsigned int (__thiscall StatLogging::*)(unsigned int)const >) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,unsigned int,StatLogging,unsigned int (__thiscall StatLogging::*)(unsigned int)const > size");

class LuaBinding::Functor1Member<char const *,void,StatLogging,void (__thiscall StatLogging::*)(char const *)>
{
public:
    typedef StatLogging type_class;
    typedef void *type_func(char const *);
private:
    StatLogging *m_obj; // 0x0
    void *m_func(char const *); // 0x4
protected:
    Functor1Member<char const *,void,StatLogging,void (__thiscall StatLogging::*)(char const *)>(StatLogging *, void *(char const *));
public:
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Member<char const *,void,StatLogging,void (__thiscall StatLogging::*)(char const *)>) == 8, "Invalid LuaBinding::Functor1Member<char const *,void,StatLogging,void (__thiscall StatLogging::*)(char const *)> size");

class LuaBinding::Functor1Member<unsigned int,int,StatLogging,int (__thiscall StatLogging::*)(unsigned int)const >
{
public:
    typedef StatLogging type_class;
    typedef __int32 *type_func(unsigned __int32) const;
private:
    StatLogging *m_obj; // 0x0
    __int32 *m_func(unsigned __int32) const; // 0x4
protected:
    Functor1Member<unsigned int,int,StatLogging,int (__thiscall StatLogging::*)(unsigned int)const >(StatLogging *, __int32 *(unsigned __int32) const);
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,int,StatLogging,int (__thiscall StatLogging::*)(unsigned int)const >) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,int,StatLogging,int (__thiscall StatLogging::*)(unsigned int)const > size");

class LuaBinding::Functor1Member<unsigned int,bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(unsigned int)>
{
public:
    typedef CpuBuildManager type_class;
    typedef bool *type_func(unsigned __int32);
private:
    CpuBuildManager *m_obj; // 0x0
    bool *m_func(unsigned __int32); // 0x4
protected:
    Functor1Member<unsigned int,bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(unsigned int)>(CpuBuildManager *, bool *(unsigned __int32));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(unsigned int)>) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(unsigned int)> size");

class LuaBinding::Functor1Member<unsigned int,unsigned int,CpuBuildManager,unsigned int (__thiscall CpuBuildManager::*)(unsigned int)const >
{
public:
    typedef CpuBuildManager type_class;
    typedef unsigned __int32 *type_func(unsigned __int32) const;
private:
    CpuBuildManager *m_obj; // 0x0
    unsigned __int32 *m_func(unsigned __int32) const; // 0x4
protected:
    Functor1Member<unsigned int,unsigned int,CpuBuildManager,unsigned int (__thiscall CpuBuildManager::*)(unsigned int)const >(CpuBuildManager *, unsigned __int32 *(unsigned __int32) const);
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,unsigned int,CpuBuildManager,unsigned int (__thiscall CpuBuildManager::*)(unsigned int)const >) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,unsigned int,CpuBuildManager,unsigned int (__thiscall CpuBuildManager::*)(unsigned int)const > size");

class LuaBinding::Functor1Member<unsigned int,float,CpuBuildManager,float (__thiscall CpuBuildManager::*)(unsigned int)>
{
public:
    typedef CpuBuildManager type_class;
    typedef float *type_func(unsigned __int32);
private:
    CpuBuildManager *m_obj; // 0x0
    float *m_func(unsigned __int32); // 0x4
protected:
    Functor1Member<unsigned int,float,CpuBuildManager,float (__thiscall CpuBuildManager::*)(unsigned int)>(CpuBuildManager *, float *(unsigned __int32));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,float,CpuBuildManager,float (__thiscall CpuBuildManager::*)(unsigned int)>) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,float,CpuBuildManager,float (__thiscall CpuBuildManager::*)(unsigned int)> size");

class LuaBinding::Functor1Member<char const *,int,CpuBuildManager,int (__thiscall CpuBuildManager::*)(char const *)const >
{
public:
    typedef CpuBuildManager type_class;
    typedef __int32 *type_func(char const *) const;
private:
    CpuBuildManager *m_obj; // 0x0
    __int32 *m_func(char const *) const; // 0x4
protected:
    Functor1Member<char const *,int,CpuBuildManager,int (__thiscall CpuBuildManager::*)(char const *)const >(CpuBuildManager *, __int32 *(char const *) const);
public:
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Member<char const *,int,CpuBuildManager,int (__thiscall CpuBuildManager::*)(char const *)const >) == 8, "Invalid LuaBinding::Functor1Member<char const *,int,CpuBuildManager,int (__thiscall CpuBuildManager::*)(char const *)const > size");

class LuaBinding::Functor1Member<int,int,CpuBuildManager,int (__thiscall CpuBuildManager::*)(int)const >
{
public:
    typedef CpuBuildManager type_class;
    typedef __int32 *type_func(__int32) const;
private:
    CpuBuildManager *m_obj; // 0x0
    __int32 *m_func(__int32) const; // 0x4
protected:
    Functor1Member<int,int,CpuBuildManager,int (__thiscall CpuBuildManager::*)(int)const >(CpuBuildManager *, __int32 *(__int32) const);
public:
    __int32 operator()(double const &, lua_State *, __int32);
    __int32 operator()(char const &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<int,int,CpuBuildManager,int (__thiscall CpuBuildManager::*)(int)const >) == 8, "Invalid LuaBinding::Functor1Member<int,int,CpuBuildManager,int (__thiscall CpuBuildManager::*)(int)const > size");

class LuaBinding::Functor1Member<unsigned int,unsigned int,CpuClassifier,unsigned int (__thiscall CpuClassifier::*)(unsigned int)const >
{
public:
    typedef CpuClassifier type_class;
    typedef unsigned __int32 *type_func(unsigned __int32) const;
private:
    CpuClassifier *m_obj; // 0x0
    unsigned __int32 *m_func(unsigned __int32) const; // 0x4
protected:
    Functor1Member<unsigned int,unsigned int,CpuClassifier,unsigned int (__thiscall CpuClassifier::*)(unsigned int)const >(CpuClassifier *, unsigned __int32 *(unsigned __int32) const);
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,unsigned int,CpuClassifier,unsigned int (__thiscall CpuClassifier::*)(unsigned int)const >) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,unsigned int,CpuClassifier,unsigned int (__thiscall CpuClassifier::*)(unsigned int)const > size");

class LuaBinding::Functor1Member<int,int,CpuPlayerQuery,int (__thiscall CpuPlayerQuery::*)(int)>
{
public:
    typedef CpuPlayerQuery type_class;
    typedef __int32 *type_func(__int32);
private:
    CpuPlayerQuery *m_obj; // 0x0
    __int32 *m_func(__int32); // 0x4
protected:
    Functor1Member<int,int,CpuPlayerQuery,int (__thiscall CpuPlayerQuery::*)(int)>(CpuPlayerQuery *, __int32 *(__int32));
public:
    __int32 operator()(double const &, lua_State *, __int32);
    __int32 operator()(char const &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<int,int,CpuPlayerQuery,int (__thiscall CpuPlayerQuery::*)(int)>) == 8, "Invalid LuaBinding::Functor1Member<int,int,CpuPlayerQuery,int (__thiscall CpuPlayerQuery::*)(int)> size");

class LuaBinding::Functor1Member<unsigned int,bool,CpuPlayerQuery,bool (__thiscall CpuPlayerQuery::*)(unsigned int)>
{
public:
    typedef CpuPlayerQuery type_class;
    typedef bool *type_func(unsigned __int32);
private:
    CpuPlayerQuery *m_obj; // 0x0
    bool *m_func(unsigned __int32); // 0x4
protected:
    Functor1Member<unsigned int,bool,CpuPlayerQuery,bool (__thiscall CpuPlayerQuery::*)(unsigned int)>(CpuPlayerQuery *, bool *(unsigned __int32));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,bool,CpuPlayerQuery,bool (__thiscall CpuPlayerQuery::*)(unsigned int)>) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,bool,CpuPlayerQuery,bool (__thiscall CpuPlayerQuery::*)(unsigned int)> size");

class LuaBinding::Functor1Member<unsigned int,bool,CpuResearchManager,bool (__thiscall CpuResearchManager::*)(unsigned int)>
{
public:
    typedef CpuResearchManager type_class;
    typedef bool *type_func(unsigned __int32);
private:
    CpuResearchManager *m_obj; // 0x0
    bool *m_func(unsigned __int32); // 0x4
protected:
    Functor1Member<unsigned int,bool,CpuResearchManager,bool (__thiscall CpuResearchManager::*)(unsigned int)>(CpuResearchManager *, bool *(unsigned __int32));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,bool,CpuResearchManager,bool (__thiscall CpuResearchManager::*)(unsigned int)>) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,bool,CpuResearchManager,bool (__thiscall CpuResearchManager::*)(unsigned int)> size");

class LuaBinding::Functor1Member<unsigned int,char const *,CpuResearchManager,char const * (__thiscall CpuResearchManager::*)(unsigned int)>
{
public:
    typedef CpuResearchManager type_class;
    typedef char const **type_func(unsigned __int32);
private:
    CpuResearchManager *m_obj; // 0x0
    char const **m_func(unsigned __int32); // 0x4
protected:
    Functor1Member<unsigned int,char const *,CpuResearchManager,char const * (__thiscall CpuResearchManager::*)(unsigned int)>(CpuResearchManager *, char const **(unsigned __int32));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,char const *,CpuResearchManager,char const * (__thiscall CpuResearchManager::*)(unsigned int)>) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,char const *,CpuResearchManager,char const * (__thiscall CpuResearchManager::*)(unsigned int)> size");

class LuaBinding::Functor1Member<unsigned int,float,CpuResearchManager,float (__thiscall CpuResearchManager::*)(unsigned int)>
{
public:
    typedef CpuResearchManager type_class;
    typedef float *type_func(unsigned __int32);
private:
    CpuResearchManager *m_obj; // 0x0
    float *m_func(unsigned __int32); // 0x4
protected:
    Functor1Member<unsigned int,float,CpuResearchManager,float (__thiscall CpuResearchManager::*)(unsigned int)>(CpuResearchManager *, float *(unsigned __int32));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,float,CpuResearchManager,float (__thiscall CpuResearchManager::*)(unsigned int)>) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,float,CpuResearchManager,float (__thiscall CpuResearchManager::*)(unsigned int)> size");

class LuaBinding::Functor1Member<unsigned int,unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(unsigned int)>
{
public:
    typedef CpuResourceManager type_class;
    typedef unsigned __int32 *type_func(unsigned __int32);
private:
    CpuResourceManager *m_obj; // 0x0
    unsigned __int32 *m_func(unsigned __int32); // 0x4
protected:
    Functor1Member<unsigned int,unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(unsigned int)>(CpuResourceManager *, unsigned __int32 *(unsigned __int32));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(unsigned int)>) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(unsigned int)> size");

class LuaBinding::Functor1Member<unsigned int,unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(unsigned int)const >
{
public:
    typedef CpuResourceManager type_class;
    typedef unsigned __int32 *type_func(unsigned __int32) const;
private:
    CpuResourceManager *m_obj; // 0x0
    unsigned __int32 *m_func(unsigned __int32) const; // 0x4
protected:
    Functor1Member<unsigned int,unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(unsigned int)const >(CpuResourceManager *, unsigned __int32 *(unsigned __int32) const);
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(unsigned int)const >) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(unsigned int)const > size");

class LuaBinding::Functor1Member<char const *,void,CpuResourceManager,void (__thiscall CpuResourceManager::*)(char const *)>
{
public:
    typedef CpuResourceManager type_class;
    typedef void *type_func(char const *);
private:
    CpuResourceManager *m_obj; // 0x0
    void *m_func(char const *); // 0x4
protected:
    Functor1Member<char const *,void,CpuResourceManager,void (__thiscall CpuResourceManager::*)(char const *)>(CpuResourceManager *, void *(char const *));
public:
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Member<char const *,void,CpuResourceManager,void (__thiscall CpuResourceManager::*)(char const *)>) == 8, "Invalid LuaBinding::Functor1Member<char const *,void,CpuResourceManager,void (__thiscall CpuResourceManager::*)(char const *)> size");

class LuaBinding::Functor1Member<unsigned int,bool,CpuResourceManager,bool (__thiscall CpuResourceManager::*)(unsigned int)const >
{
public:
    typedef CpuResourceManager type_class;
    typedef bool *type_func(unsigned __int32) const;
private:
    CpuResourceManager *m_obj; // 0x0
    bool *m_func(unsigned __int32) const; // 0x4
protected:
    Functor1Member<unsigned int,bool,CpuResourceManager,bool (__thiscall CpuResourceManager::*)(unsigned int)const >(CpuResourceManager *, bool *(unsigned __int32) const);
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,bool,CpuResourceManager,bool (__thiscall CpuResourceManager::*)(unsigned int)const >) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,bool,CpuResourceManager,bool (__thiscall CpuResourceManager::*)(unsigned int)const > size");

class LuaBinding::Functor1Member<char const *,void,CpuCommon,void (__thiscall CpuCommon::*)(char const *)>
{
public:
    typedef CpuCommon type_class;
    typedef void *type_func(char const *);
private:
    CpuCommon *m_obj; // 0x0
    void *m_func(char const *); // 0x4
protected:
    Functor1Member<char const *,void,CpuCommon,void (__thiscall CpuCommon::*)(char const *)>(CpuCommon *, void *(char const *));
public:
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Member<char const *,void,CpuCommon,void (__thiscall CpuCommon::*)(char const *)>) == 8, "Invalid LuaBinding::Functor1Member<char const *,void,CpuCommon,void (__thiscall CpuCommon::*)(char const *)> size");

class LuaBinding::Functor1Member<int,void,HW2CpuPlayer,void (__thiscall HW2CpuPlayer::*)(int)>
{
public:
    typedef HW2CpuPlayer type_class;
    typedef void *type_func(__int32);
private:
    HW2CpuPlayer *m_obj; // 0x0
    void *m_func(__int32); // 0x8
protected:
    Functor1Member<int,void,HW2CpuPlayer,void (__thiscall HW2CpuPlayer::*)(int)>(HW2CpuPlayer *, void *(__int32));
public:
    __int32 operator()(double const &, lua_State *, __int32);
    __int32 operator()(char const &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<int,void,HW2CpuPlayer,void (__thiscall HW2CpuPlayer::*)(int)>) == 16, "Invalid LuaBinding::Functor1Member<int,void,HW2CpuPlayer,void (__thiscall HW2CpuPlayer::*)(int)> size");

class LuaBinding::Functor1Member<unsigned int,unsigned int,HW2CpuPlayer,unsigned int (__thiscall HW2CpuPlayer::*)(unsigned int)>
{
public:
    typedef HW2CpuPlayer type_class;
    typedef unsigned __int32 *type_func(unsigned __int32);
private:
    HW2CpuPlayer *m_obj; // 0x0
    unsigned __int32 *m_func(unsigned __int32); // 0x8
protected:
    Functor1Member<unsigned int,unsigned int,HW2CpuPlayer,unsigned int (__thiscall HW2CpuPlayer::*)(unsigned int)>(HW2CpuPlayer *, unsigned __int32 *(unsigned __int32));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,unsigned int,HW2CpuPlayer,unsigned int (__thiscall HW2CpuPlayer::*)(unsigned int)>) == 16, "Invalid LuaBinding::Functor1Member<unsigned int,unsigned int,HW2CpuPlayer,unsigned int (__thiscall HW2CpuPlayer::*)(unsigned int)> size");

class LuaBinding::Functor1Member<float,void,NISScript,void (__thiscall NISScript::*)(float)>
{
public:
    typedef NISScript type_class;
    typedef void *type_func(float);
private:
    NISScript *m_obj; // 0x0
    void *m_func(float); // 0x4
protected:
    Functor1Member<float,void,NISScript,void (__thiscall NISScript::*)(float)>(NISScript *, void *(float));
public:
    __int32 operator()(double const &, lua_State *, float);
    __int32 operator()(char const &, lua_State *, float);
};
static_assert(sizeof(LuaBinding::Functor1Member<float,void,NISScript,void (__thiscall NISScript::*)(float)>) == 8, "Invalid LuaBinding::Functor1Member<float,void,NISScript,void (__thiscall NISScript::*)(float)> size");

class LuaBinding::Functor1Member<char const *,void,NISScript,void (__thiscall NISScript::*)(char const *)>
{
public:
    typedef NISScript type_class;
    typedef void *type_func(char const *);
private:
    NISScript *m_obj; // 0x0
    void *m_func(char const *); // 0x4
protected:
    Functor1Member<char const *,void,NISScript,void (__thiscall NISScript::*)(char const *)>(NISScript *, void *(char const *));
public:
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Member<char const *,void,NISScript,void (__thiscall NISScript::*)(char const *)>) == 8, "Invalid LuaBinding::Functor1Member<char const *,void,NISScript,void (__thiscall NISScript::*)(char const *)> size");

class LuaBinding::Functor1Member<bool,void,NISScript,void (__thiscall NISScript::*)(bool)>
{
public:
    typedef NISScript type_class;
    typedef void *type_func(bool);
private:
    NISScript *m_obj; // 0x0
    void *m_func(bool); // 0x4
protected:
    Functor1Member<bool,void,NISScript,void (__thiscall NISScript::*)(bool)>(NISScript *, void *(bool));
public:
    __int32 operator()(double const &, lua_State *, bool);
    __int32 operator()(char const &, lua_State *, bool);
};
static_assert(sizeof(LuaBinding::Functor1Member<bool,void,NISScript,void (__thiscall NISScript::*)(bool)>) == 8, "Invalid LuaBinding::Functor1Member<bool,void,NISScript,void (__thiscall NISScript::*)(bool)> size");

class LuaBinding::Functor1Member<char const *,void,UI::MovieSpeech,void (__thiscall UI::MovieSpeech::*)(char const *)>
{
public:
    typedef UI::MovieSpeech type_class;
    typedef void *type_func(char const *);
private:
    UI::MovieSpeech *m_obj; // 0x0
    void *m_func(char const *); // 0x4
protected:
    Functor1Member<char const *,void,UI::MovieSpeech,void (__thiscall UI::MovieSpeech::*)(char const *)>(UI::MovieSpeech *, void *(char const *));
public:
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Member<char const *,void,UI::MovieSpeech,void (__thiscall UI::MovieSpeech::*)(char const *)>) == 8, "Invalid LuaBinding::Functor1Member<char const *,void,UI::MovieSpeech,void (__thiscall UI::MovieSpeech::*)(char const *)> size");

class LuaBinding::Functor1Member<unsigned int,bool,SimProxy,bool (__thiscall SimProxy::*)(unsigned int)const >
{
public:
    typedef SimProxy type_class;
    typedef bool *type_func(unsigned __int32) const;
private:
    SimProxy *m_obj; // 0x0
    bool *m_func(unsigned __int32) const; // 0x4
protected:
    Functor1Member<unsigned int,bool,SimProxy,bool (__thiscall SimProxy::*)(unsigned int)const >(SimProxy *, bool *(unsigned __int32) const);
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,bool,SimProxy,bool (__thiscall SimProxy::*)(unsigned int)const >) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,bool,SimProxy,bool (__thiscall SimProxy::*)(unsigned int)const > size");

class LuaBinding::Functor1Member<unsigned int,unsigned int,SimProxy,unsigned int (__thiscall SimProxy::*)(unsigned int)const >
{
public:
    typedef SimProxy type_class;
    typedef unsigned __int32 *type_func(unsigned __int32) const;
private:
    SimProxy *m_obj; // 0x0
    unsigned __int32 *m_func(unsigned __int32) const; // 0x4
protected:
    Functor1Member<unsigned int,unsigned int,SimProxy,unsigned int (__thiscall SimProxy::*)(unsigned int)const >(SimProxy *, unsigned __int32 *(unsigned __int32) const);
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<unsigned int,unsigned int,SimProxy,unsigned int (__thiscall SimProxy::*)(unsigned int)const >) == 8, "Invalid LuaBinding::Functor1Member<unsigned int,unsigned int,SimProxy,unsigned int (__thiscall SimProxy::*)(unsigned int)const > size");

class LuaBinding::Functor1Member<int,unsigned int,SimProxy,unsigned int (__thiscall SimProxy::*)(int)const >
{
public:
    typedef SimProxy type_class;
    typedef unsigned __int32 *type_func(__int32) const;
private:
    SimProxy *m_obj; // 0x0
    unsigned __int32 *m_func(__int32) const; // 0x4
protected:
    Functor1Member<int,unsigned int,SimProxy,unsigned int (__thiscall SimProxy::*)(int)const >(SimProxy *, unsigned __int32 *(__int32) const);
public:
    __int32 operator()(double const &, lua_State *, __int32);
    __int32 operator()(char const &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<int,unsigned int,SimProxy,unsigned int (__thiscall SimProxy::*)(int)const >) == 8, "Invalid LuaBinding::Functor1Member<int,unsigned int,SimProxy,unsigned int (__thiscall SimProxy::*)(int)const > size");

class LuaBinding::Functor1Member<bool,void,GameObj,void (__thiscall GameObj::*)(bool)>
{
public:
    typedef GameObj type_class;
    typedef void *type_func(bool);
private:
    GameObj *m_obj; // 0x0
    void *m_func(bool); // 0x8
protected:
    Functor1Member<bool,void,GameObj,void (__thiscall GameObj::*)(bool)>(GameObj *, void *(bool));
public:
    __int32 operator()(double const &, lua_State *, bool);
    __int32 operator()(char const &, lua_State *, bool);
};
static_assert(sizeof(LuaBinding::Functor1Member<bool,void,GameObj,void (__thiscall GameObj::*)(bool)>) == 16, "Invalid LuaBinding::Functor1Member<bool,void,GameObj,void (__thiscall GameObj::*)(bool)> size");

class LuaBinding::Functor1Member<char const *,void,LuaRuleSystem,void (__thiscall LuaRuleSystem::*)(char const *)>
{
public:
    typedef LuaRuleSystem type_class;
    typedef void *type_func(char const *);
private:
    LuaRuleSystem *m_obj; // 0x0
    void *m_func(char const *); // 0x8
protected:
    Functor1Member<char const *,void,LuaRuleSystem,void (__thiscall LuaRuleSystem::*)(char const *)>(LuaRuleSystem *, void *(char const *));
public:
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Member<char const *,void,LuaRuleSystem,void (__thiscall LuaRuleSystem::*)(char const *)>) == 16, "Invalid LuaBinding::Functor1Member<char const *,void,LuaRuleSystem,void (__thiscall LuaRuleSystem::*)(char const *)> size");

class LuaBinding::Functor1Member<char const *,bool,LuaRuleSystem,bool (__thiscall LuaRuleSystem::*)(char const *)>
{
public:
    typedef LuaRuleSystem type_class;
    typedef bool *type_func(char const *);
private:
    LuaRuleSystem *m_obj; // 0x0
    bool *m_func(char const *); // 0x8
protected:
    Functor1Member<char const *,bool,LuaRuleSystem,bool (__thiscall LuaRuleSystem::*)(char const *)>(LuaRuleSystem *, bool *(char const *));
public:
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Member<char const *,bool,LuaRuleSystem,bool (__thiscall LuaRuleSystem::*)(char const *)>) == 16, "Invalid LuaBinding::Functor1Member<char const *,bool,LuaRuleSystem,bool (__thiscall LuaRuleSystem::*)(char const *)> size");

class LuaBinding::Functor1Member<int,void,Scar,void (__thiscall Scar::*)(int)>
{
public:
    typedef Scar type_class;
    typedef void *type_func(__int32);
private:
    Scar *m_obj; // 0x0
    void *m_func(__int32); // 0x4
protected:
    Functor1Member<int,void,Scar,void (__thiscall Scar::*)(int)>(Scar *, void *(__int32));
public:
    __int32 operator()(double const &, lua_State *, __int32);
    __int32 operator()(char const &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::Functor1Member<int,void,Scar,void (__thiscall Scar::*)(int)>) == 8, "Invalid LuaBinding::Functor1Member<int,void,Scar,void (__thiscall Scar::*)(int)> size");

class LuaBinding::Functor1Member<char const *,void,ScarEventSystem,void (__thiscall ScarEventSystem::*)(char const *)>
{
public:
    typedef ScarEventSystem type_class;
    typedef void *type_func(char const *);
private:
    ScarEventSystem *m_obj; // 0x0
    void *m_func(char const *); // 0x4
protected:
    Functor1Member<char const *,void,ScarEventSystem,void (__thiscall ScarEventSystem::*)(char const *)>(ScarEventSystem *, void *(char const *));
public:
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Member<char const *,void,ScarEventSystem,void (__thiscall ScarEventSystem::*)(char const *)>) == 8, "Invalid LuaBinding::Functor1Member<char const *,void,ScarEventSystem,void (__thiscall ScarEventSystem::*)(char const *)> size");

class LuaBinding::Functor1Member<char const *,bool,ScarEventSystem,bool (__thiscall ScarEventSystem::*)(char const *)const >
{
public:
    typedef ScarEventSystem type_class;
    typedef bool *type_func(char const *) const;
private:
    ScarEventSystem *m_obj; // 0x0
    bool *m_func(char const *) const; // 0x4
protected:
    Functor1Member<char const *,bool,ScarEventSystem,bool (__thiscall ScarEventSystem::*)(char const *)const >(ScarEventSystem *, bool *(char const *) const);
public:
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Member<char const *,bool,ScarEventSystem,bool (__thiscall ScarEventSystem::*)(char const *)const >) == 8, "Invalid LuaBinding::Functor1Member<char const *,bool,ScarEventSystem,bool (__thiscall ScarEventSystem::*)(char const *)const > size");

class LuaBinding::Functor1MemberNonConst<char const *,void,ScriptedFE> :
    public LuaBinding::Functor1Member<char const *,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *)>
{
public:
    _inline Functor1MemberNonConst<char const *,void,ScriptedFE>(ScriptedFE *, void *(char const *));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<char const *,void,ScriptedFE>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<char const *,void,ScriptedFE> size");

class LuaBinding::Functor1MemberNonConst<unsigned int,void,ScriptedFE> :
    public LuaBinding::Functor1Member<unsigned int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int)>
{
public:
    _inline Functor1MemberNonConst<unsigned int,void,ScriptedFE>(ScriptedFE *, void *(unsigned __int32));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<unsigned int,void,ScriptedFE>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<unsigned int,void,ScriptedFE> size");

class LuaBinding::Functor1MemberNonConst<char const *,void,StatLogging> :
    public LuaBinding::Functor1Member<char const *,void,StatLogging,void (__thiscall StatLogging::*)(char const *)>
{
public:
    _inline Functor1MemberNonConst<char const *,void,StatLogging>(StatLogging *, void *(char const *));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<char const *,void,StatLogging>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<char const *,void,StatLogging> size");

class LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuBuildManager> :
    public LuaBinding::Functor1Member<unsigned int,bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(unsigned int)>
{
public:
    _inline Functor1MemberNonConst<unsigned int,bool,CpuBuildManager>(CpuBuildManager *, bool *(unsigned __int32));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuBuildManager>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuBuildManager> size");

class LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuBuildManager> :
    public LuaBinding::Functor1Member<unsigned int,float,CpuBuildManager,float (__thiscall CpuBuildManager::*)(unsigned int)>
{
public:
    _inline Functor1MemberNonConst<unsigned int,float,CpuBuildManager>(CpuBuildManager *, float *(unsigned __int32));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuBuildManager>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuBuildManager> size");

class LuaBinding::Functor1MemberNonConst<int,int,CpuPlayerQuery> :
    public LuaBinding::Functor1Member<int,int,CpuPlayerQuery,int (__thiscall CpuPlayerQuery::*)(int)>
{
public:
    _inline Functor1MemberNonConst<int,int,CpuPlayerQuery>(CpuPlayerQuery *, __int32 *(__int32));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<int,int,CpuPlayerQuery>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<int,int,CpuPlayerQuery> size");

class LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery> :
    public LuaBinding::Functor1Member<unsigned int,bool,CpuPlayerQuery,bool (__thiscall CpuPlayerQuery::*)(unsigned int)>
{
public:
    _inline Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery>(CpuPlayerQuery *, bool *(unsigned __int32));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery> size");

class LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuResearchManager> :
    public LuaBinding::Functor1Member<unsigned int,bool,CpuResearchManager,bool (__thiscall CpuResearchManager::*)(unsigned int)>
{
public:
    _inline Functor1MemberNonConst<unsigned int,bool,CpuResearchManager>(CpuResearchManager *, bool *(unsigned __int32));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuResearchManager>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuResearchManager> size");

class LuaBinding::Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager> :
    public LuaBinding::Functor1Member<unsigned int,char const *,CpuResearchManager,char const * (__thiscall CpuResearchManager::*)(unsigned int)>
{
public:
    _inline Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager>(CpuResearchManager *, char const **(unsigned __int32));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager> size");

class LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuResearchManager> :
    public LuaBinding::Functor1Member<unsigned int,float,CpuResearchManager,float (__thiscall CpuResearchManager::*)(unsigned int)>
{
public:
    _inline Functor1MemberNonConst<unsigned int,float,CpuResearchManager>(CpuResearchManager *, float *(unsigned __int32));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuResearchManager>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuResearchManager> size");

class LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager> :
    public LuaBinding::Functor1Member<unsigned int,unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(unsigned int)>
{
public:
    _inline Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager>(CpuResourceManager *, unsigned __int32 *(unsigned __int32));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager> size");

class LuaBinding::Functor1MemberNonConst<char const *,void,CpuResourceManager> :
    public LuaBinding::Functor1Member<char const *,void,CpuResourceManager,void (__thiscall CpuResourceManager::*)(char const *)>
{
public:
    _inline Functor1MemberNonConst<char const *,void,CpuResourceManager>(CpuResourceManager *, void *(char const *));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<char const *,void,CpuResourceManager>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<char const *,void,CpuResourceManager> size");

class LuaBinding::Functor1MemberNonConst<char const *,void,CpuCommon> :
    public LuaBinding::Functor1Member<char const *,void,CpuCommon,void (__thiscall CpuCommon::*)(char const *)>
{
public:
    _inline Functor1MemberNonConst<char const *,void,CpuCommon>(CpuCommon *, void *(char const *));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<char const *,void,CpuCommon>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<char const *,void,CpuCommon> size");

class LuaBinding::Functor1MemberNonConst<int,void,HW2CpuPlayer> :
    public LuaBinding::Functor1Member<int,void,HW2CpuPlayer,void (__thiscall HW2CpuPlayer::*)(int)>
{
public:
    _inline Functor1MemberNonConst<int,void,HW2CpuPlayer>(HW2CpuPlayer *, void *(__int32));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<int,void,HW2CpuPlayer>) == 16, "Invalid LuaBinding::Functor1MemberNonConst<int,void,HW2CpuPlayer> size");

class LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer> :
    public LuaBinding::Functor1Member<unsigned int,unsigned int,HW2CpuPlayer,unsigned int (__thiscall HW2CpuPlayer::*)(unsigned int)>
{
public:
    _inline Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer>(HW2CpuPlayer *, unsigned __int32 *(unsigned __int32));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer>) == 16, "Invalid LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer> size");

class LuaBinding::Functor1MemberNonConst<float,void,NISScript> :
    public LuaBinding::Functor1Member<float,void,NISScript,void (__thiscall NISScript::*)(float)>
{
public:
    _inline Functor1MemberNonConst<float,void,NISScript>(NISScript *, void *(float));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<float,void,NISScript>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<float,void,NISScript> size");

class LuaBinding::Functor1MemberNonConst<char const *,void,NISScript> :
    public LuaBinding::Functor1Member<char const *,void,NISScript,void (__thiscall NISScript::*)(char const *)>
{
public:
    _inline Functor1MemberNonConst<char const *,void,NISScript>(NISScript *, void *(char const *));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<char const *,void,NISScript>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<char const *,void,NISScript> size");

class LuaBinding::Functor1MemberNonConst<bool,void,NISScript> :
    public LuaBinding::Functor1Member<bool,void,NISScript,void (__thiscall NISScript::*)(bool)>
{
public:
    _inline Functor1MemberNonConst<bool,void,NISScript>(NISScript *, void *(bool));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<bool,void,NISScript>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<bool,void,NISScript> size");

class LuaBinding::Functor1MemberNonConst<char const *,void,UI::MovieSpeech> :
    public LuaBinding::Functor1Member<char const *,void,UI::MovieSpeech,void (__thiscall UI::MovieSpeech::*)(char const *)>
{
public:
    _inline Functor1MemberNonConst<char const *,void,UI::MovieSpeech>(UI::MovieSpeech *, void *(char const *));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<char const *,void,UI::MovieSpeech>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<char const *,void,UI::MovieSpeech> size");

class LuaBinding::Functor1MemberNonConst<bool,void,GameObj> :
    public LuaBinding::Functor1Member<bool,void,GameObj,void (__thiscall GameObj::*)(bool)>
{
public:
    _inline Functor1MemberNonConst<bool,void,GameObj>(GameObj *, void *(bool));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<bool,void,GameObj>) == 16, "Invalid LuaBinding::Functor1MemberNonConst<bool,void,GameObj> size");

class LuaBinding::Functor1MemberNonConst<char const *,void,LuaRuleSystem> :
    public LuaBinding::Functor1Member<char const *,void,LuaRuleSystem,void (__thiscall LuaRuleSystem::*)(char const *)>
{
public:
    _inline Functor1MemberNonConst<char const *,void,LuaRuleSystem>(LuaRuleSystem *, void *(char const *));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<char const *,void,LuaRuleSystem>) == 16, "Invalid LuaBinding::Functor1MemberNonConst<char const *,void,LuaRuleSystem> size");

class LuaBinding::Functor1MemberNonConst<char const *,bool,LuaRuleSystem> :
    public LuaBinding::Functor1Member<char const *,bool,LuaRuleSystem,bool (__thiscall LuaRuleSystem::*)(char const *)>
{
public:
    _inline Functor1MemberNonConst<char const *,bool,LuaRuleSystem>(LuaRuleSystem *, bool *(char const *));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<char const *,bool,LuaRuleSystem>) == 16, "Invalid LuaBinding::Functor1MemberNonConst<char const *,bool,LuaRuleSystem> size");

class LuaBinding::Functor1MemberNonConst<int,void,Scar> :
    public LuaBinding::Functor1Member<int,void,Scar,void (__thiscall Scar::*)(int)>
{
public:
    _inline Functor1MemberNonConst<int,void,Scar>(Scar *, void *(__int32));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<int,void,Scar>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<int,void,Scar> size");

class LuaBinding::Functor1MemberNonConst<char const *,void,ScarEventSystem> :
    public LuaBinding::Functor1Member<char const *,void,ScarEventSystem,void (__thiscall ScarEventSystem::*)(char const *)>
{
public:
    _inline Functor1MemberNonConst<char const *,void,ScarEventSystem>(ScarEventSystem *, void *(char const *));
};
static_assert(sizeof(LuaBinding::Functor1MemberNonConst<char const *,void,ScarEventSystem>) == 8, "Invalid LuaBinding::Functor1MemberNonConst<char const *,void,ScarEventSystem> size");

class LuaBinding::Functor1MemberConst<unsigned int,char const *,ScriptedFE> :
    public LuaBinding::Functor1Member<unsigned int,char const *,ScriptedFE,char const * (__thiscall ScriptedFE::*)(unsigned int)const >
{
public:
    _inline Functor1MemberConst<unsigned int,char const *,ScriptedFE>(ScriptedFE *, char const **(unsigned __int32) const);
};
static_assert(sizeof(LuaBinding::Functor1MemberConst<unsigned int,char const *,ScriptedFE>) == 8, "Invalid LuaBinding::Functor1MemberConst<unsigned int,char const *,ScriptedFE> size");

class LuaBinding::Functor1MemberConst<unsigned int,unsigned int,StatLogging> :
    public LuaBinding::Functor1Member<unsigned int,unsigned int,StatLogging,unsigned int (__thiscall StatLogging::*)(unsigned int)const >
{
public:
    _inline Functor1MemberConst<unsigned int,unsigned int,StatLogging>(StatLogging *, unsigned __int32 *(unsigned __int32) const);
};
static_assert(sizeof(LuaBinding::Functor1MemberConst<unsigned int,unsigned int,StatLogging>) == 8, "Invalid LuaBinding::Functor1MemberConst<unsigned int,unsigned int,StatLogging> size");

class LuaBinding::Functor1MemberConst<unsigned int,int,StatLogging> :
    public LuaBinding::Functor1Member<unsigned int,int,StatLogging,int (__thiscall StatLogging::*)(unsigned int)const >
{
public:
    _inline Functor1MemberConst<unsigned int,int,StatLogging>(StatLogging *, __int32 *(unsigned __int32) const);
};
static_assert(sizeof(LuaBinding::Functor1MemberConst<unsigned int,int,StatLogging>) == 8, "Invalid LuaBinding::Functor1MemberConst<unsigned int,int,StatLogging> size");

class LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager> :
    public LuaBinding::Functor1Member<unsigned int,unsigned int,CpuBuildManager,unsigned int (__thiscall CpuBuildManager::*)(unsigned int)const >
{
public:
    _inline Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager>(CpuBuildManager *, unsigned __int32 *(unsigned __int32) const);
};
static_assert(sizeof(LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager>) == 8, "Invalid LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager> size");

class LuaBinding::Functor1MemberConst<char const *,int,CpuBuildManager> :
    public LuaBinding::Functor1Member<char const *,int,CpuBuildManager,int (__thiscall CpuBuildManager::*)(char const *)const >
{
public:
    _inline Functor1MemberConst<char const *,int,CpuBuildManager>(CpuBuildManager *, __int32 *(char const *) const);
};
static_assert(sizeof(LuaBinding::Functor1MemberConst<char const *,int,CpuBuildManager>) == 8, "Invalid LuaBinding::Functor1MemberConst<char const *,int,CpuBuildManager> size");

class LuaBinding::Functor1MemberConst<int,int,CpuBuildManager> :
    public LuaBinding::Functor1Member<int,int,CpuBuildManager,int (__thiscall CpuBuildManager::*)(int)const >
{
public:
    _inline Functor1MemberConst<int,int,CpuBuildManager>(CpuBuildManager *, __int32 *(__int32) const);
};
static_assert(sizeof(LuaBinding::Functor1MemberConst<int,int,CpuBuildManager>) == 8, "Invalid LuaBinding::Functor1MemberConst<int,int,CpuBuildManager> size");

class LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuClassifier> :
    public LuaBinding::Functor1Member<unsigned int,unsigned int,CpuClassifier,unsigned int (__thiscall CpuClassifier::*)(unsigned int)const >
{
public:
    _inline Functor1MemberConst<unsigned int,unsigned int,CpuClassifier>(CpuClassifier *, unsigned __int32 *(unsigned __int32) const);
};
static_assert(sizeof(LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuClassifier>) == 8, "Invalid LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuClassifier> size");

class LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager> :
    public LuaBinding::Functor1Member<unsigned int,unsigned int,CpuResourceManager,unsigned int (__thiscall CpuResourceManager::*)(unsigned int)const >
{
public:
    _inline Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager>(CpuResourceManager *, unsigned __int32 *(unsigned __int32) const);
};
static_assert(sizeof(LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager>) == 8, "Invalid LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager> size");

class LuaBinding::Functor1MemberConst<unsigned int,bool,CpuResourceManager> :
    public LuaBinding::Functor1Member<unsigned int,bool,CpuResourceManager,bool (__thiscall CpuResourceManager::*)(unsigned int)const >
{
public:
    _inline Functor1MemberConst<unsigned int,bool,CpuResourceManager>(CpuResourceManager *, bool *(unsigned __int32) const);
};
static_assert(sizeof(LuaBinding::Functor1MemberConst<unsigned int,bool,CpuResourceManager>) == 8, "Invalid LuaBinding::Functor1MemberConst<unsigned int,bool,CpuResourceManager> size");

class LuaBinding::Functor1MemberConst<unsigned int,bool,SimProxy> :
    public LuaBinding::Functor1Member<unsigned int,bool,SimProxy,bool (__thiscall SimProxy::*)(unsigned int)const >
{
public:
    _inline Functor1MemberConst<unsigned int,bool,SimProxy>(SimProxy *, bool *(unsigned __int32) const);
};
static_assert(sizeof(LuaBinding::Functor1MemberConst<unsigned int,bool,SimProxy>) == 8, "Invalid LuaBinding::Functor1MemberConst<unsigned int,bool,SimProxy> size");

class LuaBinding::Functor1MemberConst<unsigned int,unsigned int,SimProxy> :
    public LuaBinding::Functor1Member<unsigned int,unsigned int,SimProxy,unsigned int (__thiscall SimProxy::*)(unsigned int)const >
{
public:
    _inline Functor1MemberConst<unsigned int,unsigned int,SimProxy>(SimProxy *, unsigned __int32 *(unsigned __int32) const);
};
static_assert(sizeof(LuaBinding::Functor1MemberConst<unsigned int,unsigned int,SimProxy>) == 8, "Invalid LuaBinding::Functor1MemberConst<unsigned int,unsigned int,SimProxy> size");

class LuaBinding::Functor1MemberConst<int,unsigned int,SimProxy> :
    public LuaBinding::Functor1Member<int,unsigned int,SimProxy,unsigned int (__thiscall SimProxy::*)(int)const >
{
public:
    _inline Functor1MemberConst<int,unsigned int,SimProxy>(SimProxy *, unsigned __int32 *(__int32) const);
};
static_assert(sizeof(LuaBinding::Functor1MemberConst<int,unsigned int,SimProxy>) == 8, "Invalid LuaBinding::Functor1MemberConst<int,unsigned int,SimProxy> size");

class LuaBinding::Functor1MemberConst<char const *,bool,ScarEventSystem> :
    public LuaBinding::Functor1Member<char const *,bool,ScarEventSystem,bool (__thiscall ScarEventSystem::*)(char const *)const >
{
public:
    _inline Functor1MemberConst<char const *,bool,ScarEventSystem>(ScarEventSystem *, bool *(char const *) const);
};
static_assert(sizeof(LuaBinding::Functor1MemberConst<char const *,bool,ScarEventSystem>) == 8, "Invalid LuaBinding::Functor1MemberConst<char const *,bool,ScarEventSystem> size");

class LuaBinding::Functor1Free<int,void>
{
public:
    typedef void (*type_func)(__int32);
private:
    void (*m_func)(__int32); // 0x0
public:
    _inline Functor1Free<int,void>(void (*)(__int32));
    __int32 operator()(double const &, lua_State *, __int32);
    __int32 operator()(char const &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::Functor1Free<int,void>) == 4, "Invalid LuaBinding::Functor1Free<int,void> size");

class LuaBinding::Functor1Free<bool,void>
{
public:
    typedef void (*type_func)(bool);
private:
    void (*m_func)(bool); // 0x0
public:
    _inline Functor1Free<bool,void>(void (*)(bool));
    __int32 operator()(double const &, lua_State *, bool);
    __int32 operator()(char const &, lua_State *, bool);
};
static_assert(sizeof(LuaBinding::Functor1Free<bool,void>) == 4, "Invalid LuaBinding::Functor1Free<bool,void> size");

class LuaBinding::Functor1Free<unsigned int,void>
{
public:
    typedef void (*type_func)(unsigned __int32);
private:
    void (*m_func)(unsigned __int32); // 0x0
public:
    _inline Functor1Free<unsigned int,void>(void (*)(unsigned __int32));
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Free<unsigned int,void>) == 4, "Invalid LuaBinding::Functor1Free<unsigned int,void> size");

class LuaBinding::Functor1Free<char const *,void>
{
public:
    typedef void (*type_func)(char const *);
private:
    void (*m_func)(char const *); // 0x0
public:
    _inline Functor1Free<char const *,void>(void (*)(char const *));
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Free<char const *,void>) == 4, "Invalid LuaBinding::Functor1Free<char const *,void> size");

class LuaBinding::Functor1Free<char const *,char const *>
{
public:
    typedef char const *(*type_func)(char const *);
private:
    char const *(*m_func)(char const *); // 0x0
public:
    _inline Functor1Free<char const *,char const *>(char const *(*)(char const *));
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Free<char const *,char const *>) == 4, "Invalid LuaBinding::Functor1Free<char const *,char const *> size");

class LuaBinding::Functor1Free<char const *,float>
{
public:
    typedef float (*type_func)(char const *);
private:
    float (*m_func)(char const *); // 0x0
public:
    _inline Functor1Free<char const *,float>(float (*)(char const *));
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Free<char const *,float>) == 4, "Invalid LuaBinding::Functor1Free<char const *,float> size");

class LuaBinding::Functor1Free<int,bool>
{
public:
    typedef bool (*type_func)(__int32);
private:
    bool (*m_func)(__int32); // 0x0
public:
    _inline Functor1Free<int,bool>(bool (*)(__int32));
    __int32 operator()(double const &, lua_State *, __int32);
    __int32 operator()(char const &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::Functor1Free<int,bool>) == 4, "Invalid LuaBinding::Functor1Free<int,bool> size");

class LuaBinding::Functor1Free<int,int>
{
public:
    typedef __int32 (*type_func)(__int32);
private:
    __int32 (*m_func)(__int32); // 0x0
public:
    _inline Functor1Free<int,int>(__int32 (*)(__int32));
    __int32 operator()(double const &, lua_State *, __int32);
    __int32 operator()(char const &, lua_State *, __int32);
};
static_assert(sizeof(LuaBinding::Functor1Free<int,int>) == 4, "Invalid LuaBinding::Functor1Free<int,int> size");

class LuaBinding::Functor1Free<float,void>
{
public:
    typedef void (*type_func)(float);
private:
    void (*m_func)(float); // 0x0
public:
    _inline Functor1Free<float,void>(void (*)(float));
    __int32 operator()(double const &, lua_State *, float);
    __int32 operator()(char const &, lua_State *, float);
};
static_assert(sizeof(LuaBinding::Functor1Free<float,void>) == 4, "Invalid LuaBinding::Functor1Free<float,void> size");

class LuaBinding::Functor1Free<char const *,unsigned int>
{
public:
    typedef unsigned __int32 (*type_func)(char const *);
private:
    unsigned __int32 (*m_func)(char const *); // 0x0
public:
    _inline Functor1Free<char const *,unsigned int>(unsigned __int32 (*)(char const *));
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Free<char const *,unsigned int>) == 4, "Invalid LuaBinding::Functor1Free<char const *,unsigned int> size");

class LuaBinding::Functor1Free<unsigned int,bool>
{
public:
    typedef bool (*type_func)(unsigned __int32);
private:
    bool (*m_func)(unsigned __int32); // 0x0
public:
    _inline Functor1Free<unsigned int,bool>(bool (*)(unsigned __int32));
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Free<unsigned int,bool>) == 4, "Invalid LuaBinding::Functor1Free<unsigned int,bool> size");

class LuaBinding::Functor1Free<vector4,void>
{
public:
    typedef void (*type_func)(vector4);
private:
    void (*m_func)(vector4); // 0x0
public:
    _inline Functor1Free<vector4,void>(void (*)(vector4));
    __int32 operator()(double const &, lua_State *, vector4);
    __int32 operator()(char const &, lua_State *, vector4);
};
static_assert(sizeof(LuaBinding::Functor1Free<vector4,void>) == 4, "Invalid LuaBinding::Functor1Free<vector4,void> size");

class LuaBinding::Functor1Free<vector3,void>
{
public:
    typedef void (*type_func)(vector3);
private:
    void (*m_func)(vector3); // 0x0
public:
    _inline Functor1Free<vector3,void>(void (*)(vector3));
    __int32 operator()(double const &, lua_State *, vector3);
    __int32 operator()(char const &, lua_State *, vector3);
};
static_assert(sizeof(LuaBinding::Functor1Free<vector3,void>) == 4, "Invalid LuaBinding::Functor1Free<vector3,void> size");

class LuaBinding::Functor1Free<long,void>
{
public:
    typedef void (*type_func)(long);
private:
    void (*m_func)(long); // 0x0
public:
    _inline Functor1Free<long,void>(void (*)(long));
    __int32 operator()(double const &, lua_State *, long);
    __int32 operator()(char const &, lua_State *, long);
};
static_assert(sizeof(LuaBinding::Functor1Free<long,void>) == 4, "Invalid LuaBinding::Functor1Free<long,void> size");

class LuaBinding::Functor1Free<bool,bool>
{
public:
    typedef bool (*type_func)(bool);
private:
    bool (*m_func)(bool); // 0x0
public:
    _inline Functor1Free<bool,bool>(bool (*)(bool));
    __int32 operator()(double const &, lua_State *, bool);
    __int32 operator()(char const &, lua_State *, bool);
};
static_assert(sizeof(LuaBinding::Functor1Free<bool,bool>) == 4, "Invalid LuaBinding::Functor1Free<bool,bool> size");

class LuaBinding::Functor1Free<char const *,bool>
{
public:
    typedef bool (*type_func)(char const *);
private:
    bool (*m_func)(char const *); // 0x0
public:
    _inline Functor1Free<char const *,bool>(bool (*)(char const *));
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Free<char const *,bool>) == 4, "Invalid LuaBinding::Functor1Free<char const *,bool> size");

class LuaBinding::Functor1Free<float,bool>
{
public:
    typedef bool (*type_func)(float);
private:
    bool (*m_func)(float); // 0x0
public:
    _inline Functor1Free<float,bool>(bool (*)(float));
    __int32 operator()(double const &, lua_State *, float);
    __int32 operator()(char const &, lua_State *, float);
};
static_assert(sizeof(LuaBinding::Functor1Free<float,bool>) == 4, "Invalid LuaBinding::Functor1Free<float,bool> size");

class LuaBinding::Functor1Free<unsigned int,unsigned int>
{
public:
    typedef unsigned __int32 (*type_func)(unsigned __int32);
private:
    unsigned __int32 (*m_func)(unsigned __int32); // 0x0
public:
    _inline Functor1Free<unsigned int,unsigned int>(unsigned __int32 (*)(unsigned __int32));
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Free<unsigned int,unsigned int>) == 4, "Invalid LuaBinding::Functor1Free<unsigned int,unsigned int> size");

class LuaBinding::Functor1Free<unsigned int,float>
{
public:
    typedef float (*type_func)(unsigned __int32);
private:
    float (*m_func)(unsigned __int32); // 0x0
public:
    _inline Functor1Free<unsigned int,float>(float (*)(unsigned __int32));
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Free<unsigned int,float>) == 4, "Invalid LuaBinding::Functor1Free<unsigned int,float> size");

class LuaBinding::Functor1Free<unsigned int,wchar_t const *>
{
public:
    typedef wchar_t const *(*type_func)(unsigned __int32);
private:
    wchar_t const *(*m_func)(unsigned __int32); // 0x0
public:
    _inline Functor1Free<unsigned int,wchar_t const *>(wchar_t const *(*)(unsigned __int32));
    __int32 operator()(double const &, lua_State *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor1Free<unsigned int,wchar_t const *>) == 4, "Invalid LuaBinding::Functor1Free<unsigned int,wchar_t const *> size");

class LuaBinding::Functor1Free<char const *,int>
{
public:
    typedef __int32 (*type_func)(char const *);
private:
    __int32 (*m_func)(char const *); // 0x0
public:
    _inline Functor1Free<char const *,int>(__int32 (*)(char const *));
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Free<char const *,int>) == 4, "Invalid LuaBinding::Functor1Free<char const *,int> size");

class LuaBinding::Functor1Free<char const *,vector3>
{
public:
    typedef vector3 (*type_func)(char const *);
private:
    vector3 (*m_func)(char const *); // 0x0
public:
    _inline Functor1Free<char const *,vector3>(vector3 (*)(char const *));
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Free<char const *,vector3>) == 4, "Invalid LuaBinding::Functor1Free<char const *,vector3> size");

class LuaBinding::Functor1Free<float,unsigned int>
{
public:
    typedef unsigned __int32 (*type_func)(float);
private:
    unsigned __int32 (*m_func)(float); // 0x0
public:
    _inline Functor1Free<float,unsigned int>(unsigned __int32 (*)(float));
    __int32 operator()(double const &, lua_State *, float);
    __int32 operator()(char const &, lua_State *, float);
};
static_assert(sizeof(LuaBinding::Functor1Free<float,unsigned int>) == 4, "Invalid LuaBinding::Functor1Free<float,unsigned int> size");

class LuaBinding::Functor1Free<char const *,double>
{
public:
    typedef double (*type_func)(char const *);
private:
    double (*m_func)(char const *); // 0x0
public:
    _inline Functor1Free<char const *,double>(double (*)(char const *));
    __int32 operator()(double const &, lua_State *, char const *);
    __int32 operator()(char const &, lua_State *, char const *);
};
static_assert(sizeof(LuaBinding::Functor1Free<char const *,double>) == 4, "Invalid LuaBinding::Functor1Free<char const *,double> size");

class LuaBinding::Functor1Free<vector3,vector3>
{
public:
    typedef vector3 (*type_func)(vector3);
private:
    vector3 (*m_func)(vector3); // 0x0
public:
    _inline Functor1Free<vector3,vector3>(vector3 (*)(vector3));
    __int32 operator()(double const &, lua_State *, vector3);
    __int32 operator()(char const &, lua_State *, vector3);
};
static_assert(sizeof(LuaBinding::Functor1Free<vector3,vector3>) == 4, "Invalid LuaBinding::Functor1Free<vector3,vector3> size");

class LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1Free<int,void> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<int,void> m_func; // 0x14
public:
    ObjInternal1<int,void,LuaBinding::Functor1Free<int,void> >(LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1Free<int,void> > const &); /* compiler_generated() */
    _inline ObjInternal1<int,void,LuaBinding::Functor1Free<int,void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<int,void> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<int,void,LuaBinding::Functor1Free<int,void> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1Free<int,void> > &operator=(LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1Free<int,void> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1Free<int,void> >) == 24, "Invalid LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1Free<int,void> > size");

class LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1Free<bool,void> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<bool,void> m_func; // 0x14
public:
    ObjInternal1<bool,void,LuaBinding::Functor1Free<bool,void> >(LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1Free<bool,void> > const &); /* compiler_generated() */
    _inline ObjInternal1<bool,void,LuaBinding::Functor1Free<bool,void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<bool,void> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<bool,void,LuaBinding::Functor1Free<bool,void> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1Free<bool,void> > &operator=(LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1Free<bool,void> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1Free<bool,void> >) == 24, "Invalid LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1Free<bool,void> > size");

class LuaBinding::ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberConst<unsigned int,char const *,ScriptedFE> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberConst<unsigned int,char const *,ScriptedFE> m_func; // 0x14
public:
    ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberConst<unsigned int,char const *,ScriptedFE> >(LuaBinding::ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberConst<unsigned int,char const *,ScriptedFE> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberConst<unsigned int,char const *,ScriptedFE> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberConst<unsigned int,char const *,ScriptedFE> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberConst<unsigned int,char const *,ScriptedFE> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberConst<unsigned int,char const *,ScriptedFE> > &operator=(LuaBinding::ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberConst<unsigned int,char const *,ScriptedFE> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberConst<unsigned int,char const *,ScriptedFE> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberConst<unsigned int,char const *,ScriptedFE> > size");

class LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScriptedFE> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<char const *,void,ScriptedFE> m_func; // 0x14
public:
    ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScriptedFE> >(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScriptedFE> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScriptedFE> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<char const *,void,ScriptedFE> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScriptedFE> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScriptedFE> > &operator=(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScriptedFE> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScriptedFE> >) == 28, "Invalid LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScriptedFE> > size");

class LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1MemberNonConst<unsigned int,void,ScriptedFE> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<unsigned int,void,ScriptedFE> m_func; // 0x14
public:
    ObjInternal1<unsigned int,void,LuaBinding::Functor1MemberNonConst<unsigned int,void,ScriptedFE> >(LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1MemberNonConst<unsigned int,void,ScriptedFE> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,void,LuaBinding::Functor1MemberNonConst<unsigned int,void,ScriptedFE> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<unsigned int,void,ScriptedFE> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,void,LuaBinding::Functor1MemberNonConst<unsigned int,void,ScriptedFE> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1MemberNonConst<unsigned int,void,ScriptedFE> > &operator=(LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1MemberNonConst<unsigned int,void,ScriptedFE> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1MemberNonConst<unsigned int,void,ScriptedFE> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1MemberNonConst<unsigned int,void,ScriptedFE> > size");

class LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<unsigned int,void> m_func; // 0x14
public:
    ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> >(LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<unsigned int,void> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> > &operator=(LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> >) == 24, "Invalid LuaBinding::ObjInternal1<unsigned int,void,LuaBinding::Functor1Free<unsigned int,void> > size");

class LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<char const *,void> m_func; // 0x14
public:
    ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> >(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<char const *,void> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> > &operator=(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> >) == 24, "Invalid LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1Free<char const *,void> > size");

class LuaBinding::ObjInternal1<char const *,char const *,LuaBinding::Functor1Free<char const *,char const *> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<char const *,char const *> m_func; // 0x14
public:
    ObjInternal1<char const *,char const *,LuaBinding::Functor1Free<char const *,char const *> >(LuaBinding::ObjInternal1<char const *,char const *,LuaBinding::Functor1Free<char const *,char const *> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,char const *,LuaBinding::Functor1Free<char const *,char const *> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<char const *,char const *> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,char const *,LuaBinding::Functor1Free<char const *,char const *> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,char const *,LuaBinding::Functor1Free<char const *,char const *> > &operator=(LuaBinding::ObjInternal1<char const *,char const *,LuaBinding::Functor1Free<char const *,char const *> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,char const *,LuaBinding::Functor1Free<char const *,char const *> >) == 24, "Invalid LuaBinding::ObjInternal1<char const *,char const *,LuaBinding::Functor1Free<char const *,char const *> > size");

class LuaBinding::ObjInternal1<char const *,float,LuaBinding::Functor1Free<char const *,float> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<char const *,float> m_func; // 0x14
public:
    ObjInternal1<char const *,float,LuaBinding::Functor1Free<char const *,float> >(LuaBinding::ObjInternal1<char const *,float,LuaBinding::Functor1Free<char const *,float> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,float,LuaBinding::Functor1Free<char const *,float> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<char const *,float> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,float,LuaBinding::Functor1Free<char const *,float> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,float,LuaBinding::Functor1Free<char const *,float> > &operator=(LuaBinding::ObjInternal1<char const *,float,LuaBinding::Functor1Free<char const *,float> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,float,LuaBinding::Functor1Free<char const *,float> >) == 24, "Invalid LuaBinding::ObjInternal1<char const *,float,LuaBinding::Functor1Free<char const *,float> > size");

class LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,StatLogging> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberConst<unsigned int,unsigned int,StatLogging> m_func; // 0x14
public:
    ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,StatLogging> >(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,StatLogging> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,StatLogging> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberConst<unsigned int,unsigned int,StatLogging> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,StatLogging> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,StatLogging> > &operator=(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,StatLogging> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,StatLogging> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,StatLogging> > size");

class LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,StatLogging> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<char const *,void,StatLogging> m_func; // 0x14
public:
    ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,StatLogging> >(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,StatLogging> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,StatLogging> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<char const *,void,StatLogging> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,StatLogging> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,StatLogging> > &operator=(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,StatLogging> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,StatLogging> >) == 28, "Invalid LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,StatLogging> > size");

class LuaBinding::ObjInternal1<unsigned int,int,LuaBinding::Functor1MemberConst<unsigned int,int,StatLogging> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberConst<unsigned int,int,StatLogging> m_func; // 0x14
public:
    ObjInternal1<unsigned int,int,LuaBinding::Functor1MemberConst<unsigned int,int,StatLogging> >(LuaBinding::ObjInternal1<unsigned int,int,LuaBinding::Functor1MemberConst<unsigned int,int,StatLogging> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,int,LuaBinding::Functor1MemberConst<unsigned int,int,StatLogging> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberConst<unsigned int,int,StatLogging> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,int,LuaBinding::Functor1MemberConst<unsigned int,int,StatLogging> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,int,LuaBinding::Functor1MemberConst<unsigned int,int,StatLogging> > &operator=(LuaBinding::ObjInternal1<unsigned int,int,LuaBinding::Functor1MemberConst<unsigned int,int,StatLogging> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,int,LuaBinding::Functor1MemberConst<unsigned int,int,StatLogging> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,int,LuaBinding::Functor1MemberConst<unsigned int,int,StatLogging> > size");

class LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuBuildManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuBuildManager> m_func; // 0x14
public:
    ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuBuildManager> >(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuBuildManager> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuBuildManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuBuildManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuBuildManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuBuildManager> > &operator=(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuBuildManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuBuildManager> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuBuildManager> > size");

class LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager> m_func; // 0x14
public:
    ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager> >(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager> > &operator=(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuBuildManager> > size");

class LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuBuildManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuBuildManager> m_func; // 0x14
public:
    ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuBuildManager> >(LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuBuildManager> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuBuildManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuBuildManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuBuildManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuBuildManager> > &operator=(LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuBuildManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuBuildManager> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuBuildManager> > size");

class LuaBinding::ObjInternal1<char const *,int,LuaBinding::Functor1MemberConst<char const *,int,CpuBuildManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberConst<char const *,int,CpuBuildManager> m_func; // 0x14
public:
    ObjInternal1<char const *,int,LuaBinding::Functor1MemberConst<char const *,int,CpuBuildManager> >(LuaBinding::ObjInternal1<char const *,int,LuaBinding::Functor1MemberConst<char const *,int,CpuBuildManager> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,int,LuaBinding::Functor1MemberConst<char const *,int,CpuBuildManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberConst<char const *,int,CpuBuildManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,int,LuaBinding::Functor1MemberConst<char const *,int,CpuBuildManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,int,LuaBinding::Functor1MemberConst<char const *,int,CpuBuildManager> > &operator=(LuaBinding::ObjInternal1<char const *,int,LuaBinding::Functor1MemberConst<char const *,int,CpuBuildManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,int,LuaBinding::Functor1MemberConst<char const *,int,CpuBuildManager> >) == 28, "Invalid LuaBinding::ObjInternal1<char const *,int,LuaBinding::Functor1MemberConst<char const *,int,CpuBuildManager> > size");

class LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1MemberConst<int,int,CpuBuildManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberConst<int,int,CpuBuildManager> m_func; // 0x14
public:
    ObjInternal1<int,int,LuaBinding::Functor1MemberConst<int,int,CpuBuildManager> >(LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1MemberConst<int,int,CpuBuildManager> > const &); /* compiler_generated() */
    _inline ObjInternal1<int,int,LuaBinding::Functor1MemberConst<int,int,CpuBuildManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberConst<int,int,CpuBuildManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<int,int,LuaBinding::Functor1MemberConst<int,int,CpuBuildManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1MemberConst<int,int,CpuBuildManager> > &operator=(LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1MemberConst<int,int,CpuBuildManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1MemberConst<int,int,CpuBuildManager> >) == 28, "Invalid LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1MemberConst<int,int,CpuBuildManager> > size");

class LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuClassifier> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuClassifier> m_func; // 0x14
public:
    ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuClassifier> >(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuClassifier> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuClassifier> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuClassifier> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuClassifier> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuClassifier> > &operator=(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuClassifier> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuClassifier> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuClassifier> > size");

class LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1MemberNonConst<int,int,CpuPlayerQuery> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<int,int,CpuPlayerQuery> m_func; // 0x14
public:
    ObjInternal1<int,int,LuaBinding::Functor1MemberNonConst<int,int,CpuPlayerQuery> >(LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1MemberNonConst<int,int,CpuPlayerQuery> > const &); /* compiler_generated() */
    _inline ObjInternal1<int,int,LuaBinding::Functor1MemberNonConst<int,int,CpuPlayerQuery> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<int,int,CpuPlayerQuery> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<int,int,LuaBinding::Functor1MemberNonConst<int,int,CpuPlayerQuery> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1MemberNonConst<int,int,CpuPlayerQuery> > &operator=(LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1MemberNonConst<int,int,CpuPlayerQuery> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1MemberNonConst<int,int,CpuPlayerQuery> >) == 28, "Invalid LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1MemberNonConst<int,int,CpuPlayerQuery> > size");

class LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery> m_func; // 0x14
public:
    ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery> >(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery> > &operator=(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuPlayerQuery> > size");

class LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuResearchManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuResearchManager> m_func; // 0x14
public:
    ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuResearchManager> >(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuResearchManager> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuResearchManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuResearchManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuResearchManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuResearchManager> > &operator=(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuResearchManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuResearchManager> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberNonConst<unsigned int,bool,CpuResearchManager> > size");

class LuaBinding::ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager> m_func; // 0x14
public:
    ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager> >(LuaBinding::ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager> > &operator=(LuaBinding::ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,char const *,LuaBinding::Functor1MemberNonConst<unsigned int,char const *,CpuResearchManager> > size");

class LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuResearchManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuResearchManager> m_func; // 0x14
public:
    ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuResearchManager> >(LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuResearchManager> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuResearchManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuResearchManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuResearchManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuResearchManager> > &operator=(LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuResearchManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuResearchManager> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1MemberNonConst<unsigned int,float,CpuResearchManager> > size");

class LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager> m_func; // 0x14
public:
    ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager> >(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager> > &operator=(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,CpuResourceManager> > size");

class LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager> m_func; // 0x14
public:
    ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager> >(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager> > &operator=(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,CpuResourceManager> > size");

class LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuResourceManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<char const *,void,CpuResourceManager> m_func; // 0x14
public:
    ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuResourceManager> >(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuResourceManager> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuResourceManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<char const *,void,CpuResourceManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuResourceManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuResourceManager> > &operator=(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuResourceManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuResourceManager> >) == 28, "Invalid LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuResourceManager> > size");

class LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,CpuResourceManager> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberConst<unsigned int,bool,CpuResourceManager> m_func; // 0x14
public:
    ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,CpuResourceManager> >(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,CpuResourceManager> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,CpuResourceManager> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberConst<unsigned int,bool,CpuResourceManager> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,CpuResourceManager> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,CpuResourceManager> > &operator=(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,CpuResourceManager> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,CpuResourceManager> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,CpuResourceManager> > size");

class LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuCommon> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<char const *,void,CpuCommon> m_func; // 0x14
public:
    ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuCommon> >(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuCommon> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuCommon> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<char const *,void,CpuCommon> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuCommon> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuCommon> > &operator=(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuCommon> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuCommon> >) == 28, "Invalid LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,CpuCommon> > size");

class LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,HW2CpuPlayer> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<int,void,HW2CpuPlayer> m_func; // 0x18
public:
    ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,HW2CpuPlayer> >(LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,HW2CpuPlayer> > const &); /* compiler_generated() */
    _inline ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,HW2CpuPlayer> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<int,void,HW2CpuPlayer> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,HW2CpuPlayer> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,HW2CpuPlayer> > &operator=(LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,HW2CpuPlayer> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,HW2CpuPlayer> >) == 40, "Invalid LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,HW2CpuPlayer> > size");

class LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer> m_func; // 0x18
public:
    ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer> >(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer> > &operator=(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer> >) == 40, "Invalid LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberNonConst<unsigned int,unsigned int,HW2CpuPlayer> > size");

class LuaBinding::ObjInternal1<int,bool,LuaBinding::Functor1Free<int,bool> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<int,bool> m_func; // 0x14
public:
    ObjInternal1<int,bool,LuaBinding::Functor1Free<int,bool> >(LuaBinding::ObjInternal1<int,bool,LuaBinding::Functor1Free<int,bool> > const &); /* compiler_generated() */
    _inline ObjInternal1<int,bool,LuaBinding::Functor1Free<int,bool> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<int,bool> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<int,bool,LuaBinding::Functor1Free<int,bool> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<int,bool,LuaBinding::Functor1Free<int,bool> > &operator=(LuaBinding::ObjInternal1<int,bool,LuaBinding::Functor1Free<int,bool> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<int,bool,LuaBinding::Functor1Free<int,bool> >) == 24, "Invalid LuaBinding::ObjInternal1<int,bool,LuaBinding::Functor1Free<int,bool> > size");

class LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1Free<int,int> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<int,int> m_func; // 0x14
public:
    ObjInternal1<int,int,LuaBinding::Functor1Free<int,int> >(LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1Free<int,int> > const &); /* compiler_generated() */
    _inline ObjInternal1<int,int,LuaBinding::Functor1Free<int,int> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<int,int> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<int,int,LuaBinding::Functor1Free<int,int> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1Free<int,int> > &operator=(LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1Free<int,int> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1Free<int,int> >) == 24, "Invalid LuaBinding::ObjInternal1<int,int,LuaBinding::Functor1Free<int,int> > size");

class LuaBinding::ObjInternal1<float,void,LuaBinding::Functor1Free<float,void> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<float,void> m_func; // 0x14
public:
    ObjInternal1<float,void,LuaBinding::Functor1Free<float,void> >(LuaBinding::ObjInternal1<float,void,LuaBinding::Functor1Free<float,void> > const &); /* compiler_generated() */
    _inline ObjInternal1<float,void,LuaBinding::Functor1Free<float,void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<float,void> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<float,void,LuaBinding::Functor1Free<float,void> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<float,void,LuaBinding::Functor1Free<float,void> > &operator=(LuaBinding::ObjInternal1<float,void,LuaBinding::Functor1Free<float,void> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<float,void,LuaBinding::Functor1Free<float,void> >) == 24, "Invalid LuaBinding::ObjInternal1<float,void,LuaBinding::Functor1Free<float,void> > size");

class LuaBinding::ObjInternal1<char const *,unsigned int,LuaBinding::Functor1Free<char const *,unsigned int> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<char const *,unsigned int> m_func; // 0x14
public:
    ObjInternal1<char const *,unsigned int,LuaBinding::Functor1Free<char const *,unsigned int> >(LuaBinding::ObjInternal1<char const *,unsigned int,LuaBinding::Functor1Free<char const *,unsigned int> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,unsigned int,LuaBinding::Functor1Free<char const *,unsigned int> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<char const *,unsigned int> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,unsigned int,LuaBinding::Functor1Free<char const *,unsigned int> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,unsigned int,LuaBinding::Functor1Free<char const *,unsigned int> > &operator=(LuaBinding::ObjInternal1<char const *,unsigned int,LuaBinding::Functor1Free<char const *,unsigned int> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,unsigned int,LuaBinding::Functor1Free<char const *,unsigned int> >) == 24, "Invalid LuaBinding::ObjInternal1<char const *,unsigned int,LuaBinding::Functor1Free<char const *,unsigned int> > size");

class LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1Free<unsigned int,bool> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<unsigned int,bool> m_func; // 0x14
public:
    ObjInternal1<unsigned int,bool,LuaBinding::Functor1Free<unsigned int,bool> >(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1Free<unsigned int,bool> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,bool,LuaBinding::Functor1Free<unsigned int,bool> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<unsigned int,bool> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,bool,LuaBinding::Functor1Free<unsigned int,bool> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1Free<unsigned int,bool> > &operator=(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1Free<unsigned int,bool> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1Free<unsigned int,bool> >) == 24, "Invalid LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1Free<unsigned int,bool> > size");

class LuaBinding::ObjInternal1<float,void,LuaBinding::Functor1MemberNonConst<float,void,NISScript> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<float,void,NISScript> m_func; // 0x14
public:
    ObjInternal1<float,void,LuaBinding::Functor1MemberNonConst<float,void,NISScript> >(LuaBinding::ObjInternal1<float,void,LuaBinding::Functor1MemberNonConst<float,void,NISScript> > const &); /* compiler_generated() */
    _inline ObjInternal1<float,void,LuaBinding::Functor1MemberNonConst<float,void,NISScript> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<float,void,NISScript> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<float,void,LuaBinding::Functor1MemberNonConst<float,void,NISScript> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<float,void,LuaBinding::Functor1MemberNonConst<float,void,NISScript> > &operator=(LuaBinding::ObjInternal1<float,void,LuaBinding::Functor1MemberNonConst<float,void,NISScript> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<float,void,LuaBinding::Functor1MemberNonConst<float,void,NISScript> >) == 28, "Invalid LuaBinding::ObjInternal1<float,void,LuaBinding::Functor1MemberNonConst<float,void,NISScript> > size");

class LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,NISScript> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<char const *,void,NISScript> m_func; // 0x14
public:
    ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,NISScript> >(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,NISScript> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,NISScript> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<char const *,void,NISScript> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,NISScript> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,NISScript> > &operator=(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,NISScript> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,NISScript> >) == 28, "Invalid LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,NISScript> > size");

class LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,NISScript> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<bool,void,NISScript> m_func; // 0x14
public:
    ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,NISScript> >(LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,NISScript> > const &); /* compiler_generated() */
    _inline ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,NISScript> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<bool,void,NISScript> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,NISScript> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,NISScript> > &operator=(LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,NISScript> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,NISScript> >) == 28, "Invalid LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,NISScript> > size");

class LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,UI::MovieSpeech> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<char const *,void,UI::MovieSpeech> m_func; // 0x14
public:
    ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,UI::MovieSpeech> >(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,UI::MovieSpeech> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,UI::MovieSpeech> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<char const *,void,UI::MovieSpeech> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,UI::MovieSpeech> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,UI::MovieSpeech> > &operator=(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,UI::MovieSpeech> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,UI::MovieSpeech> >) == 28, "Invalid LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,UI::MovieSpeech> > size");

class LuaBinding::ObjInternal1<vector4,void,LuaBinding::Functor1Free<vector4,void> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<vector4,void> m_func; // 0x14
public:
    ObjInternal1<vector4,void,LuaBinding::Functor1Free<vector4,void> >(LuaBinding::ObjInternal1<vector4,void,LuaBinding::Functor1Free<vector4,void> > const &); /* compiler_generated() */
    _inline ObjInternal1<vector4,void,LuaBinding::Functor1Free<vector4,void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<vector4,void> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<vector4,void,LuaBinding::Functor1Free<vector4,void> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<vector4,void,LuaBinding::Functor1Free<vector4,void> > &operator=(LuaBinding::ObjInternal1<vector4,void,LuaBinding::Functor1Free<vector4,void> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<vector4,void,LuaBinding::Functor1Free<vector4,void> >) == 24, "Invalid LuaBinding::ObjInternal1<vector4,void,LuaBinding::Functor1Free<vector4,void> > size");

class LuaBinding::ObjInternal1<vector3,void,LuaBinding::Functor1Free<vector3,void> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<vector3,void> m_func; // 0x14
public:
    ObjInternal1<vector3,void,LuaBinding::Functor1Free<vector3,void> >(LuaBinding::ObjInternal1<vector3,void,LuaBinding::Functor1Free<vector3,void> > const &); /* compiler_generated() */
    _inline ObjInternal1<vector3,void,LuaBinding::Functor1Free<vector3,void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<vector3,void> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<vector3,void,LuaBinding::Functor1Free<vector3,void> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<vector3,void,LuaBinding::Functor1Free<vector3,void> > &operator=(LuaBinding::ObjInternal1<vector3,void,LuaBinding::Functor1Free<vector3,void> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<vector3,void,LuaBinding::Functor1Free<vector3,void> >) == 24, "Invalid LuaBinding::ObjInternal1<vector3,void,LuaBinding::Functor1Free<vector3,void> > size");

class LuaBinding::ObjInternal1<long,void,LuaBinding::Functor1Free<long,void> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<long,void> m_func; // 0x14
public:
    ObjInternal1<long,void,LuaBinding::Functor1Free<long,void> >(LuaBinding::ObjInternal1<long,void,LuaBinding::Functor1Free<long,void> > const &); /* compiler_generated() */
    _inline ObjInternal1<long,void,LuaBinding::Functor1Free<long,void> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<long,void> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<long,void,LuaBinding::Functor1Free<long,void> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<long,void,LuaBinding::Functor1Free<long,void> > &operator=(LuaBinding::ObjInternal1<long,void,LuaBinding::Functor1Free<long,void> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<long,void,LuaBinding::Functor1Free<long,void> >) == 24, "Invalid LuaBinding::ObjInternal1<long,void,LuaBinding::Functor1Free<long,void> > size");

class LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,SimProxy> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberConst<unsigned int,bool,SimProxy> m_func; // 0x14
public:
    ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,SimProxy> >(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,SimProxy> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,SimProxy> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberConst<unsigned int,bool,SimProxy> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,SimProxy> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,SimProxy> > &operator=(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,SimProxy> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,SimProxy> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,bool,LuaBinding::Functor1MemberConst<unsigned int,bool,SimProxy> > size");

class LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,SimProxy> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberConst<unsigned int,unsigned int,SimProxy> m_func; // 0x14
public:
    ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,SimProxy> >(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,SimProxy> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,SimProxy> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberConst<unsigned int,unsigned int,SimProxy> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,SimProxy> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,SimProxy> > &operator=(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,SimProxy> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,SimProxy> >) == 28, "Invalid LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1MemberConst<unsigned int,unsigned int,SimProxy> > size");

class LuaBinding::ObjInternal1<int,unsigned int,LuaBinding::Functor1MemberConst<int,unsigned int,SimProxy> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberConst<int,unsigned int,SimProxy> m_func; // 0x14
public:
    ObjInternal1<int,unsigned int,LuaBinding::Functor1MemberConst<int,unsigned int,SimProxy> >(LuaBinding::ObjInternal1<int,unsigned int,LuaBinding::Functor1MemberConst<int,unsigned int,SimProxy> > const &); /* compiler_generated() */
    _inline ObjInternal1<int,unsigned int,LuaBinding::Functor1MemberConst<int,unsigned int,SimProxy> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberConst<int,unsigned int,SimProxy> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<int,unsigned int,LuaBinding::Functor1MemberConst<int,unsigned int,SimProxy> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<int,unsigned int,LuaBinding::Functor1MemberConst<int,unsigned int,SimProxy> > &operator=(LuaBinding::ObjInternal1<int,unsigned int,LuaBinding::Functor1MemberConst<int,unsigned int,SimProxy> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<int,unsigned int,LuaBinding::Functor1MemberConst<int,unsigned int,SimProxy> >) == 28, "Invalid LuaBinding::ObjInternal1<int,unsigned int,LuaBinding::Functor1MemberConst<int,unsigned int,SimProxy> > size");

class LuaBinding::ObjInternal1<bool,bool,LuaBinding::Functor1Free<bool,bool> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<bool,bool> m_func; // 0x14
public:
    ObjInternal1<bool,bool,LuaBinding::Functor1Free<bool,bool> >(LuaBinding::ObjInternal1<bool,bool,LuaBinding::Functor1Free<bool,bool> > const &); /* compiler_generated() */
    _inline ObjInternal1<bool,bool,LuaBinding::Functor1Free<bool,bool> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<bool,bool> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<bool,bool,LuaBinding::Functor1Free<bool,bool> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<bool,bool,LuaBinding::Functor1Free<bool,bool> > &operator=(LuaBinding::ObjInternal1<bool,bool,LuaBinding::Functor1Free<bool,bool> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<bool,bool,LuaBinding::Functor1Free<bool,bool> >) == 24, "Invalid LuaBinding::ObjInternal1<bool,bool,LuaBinding::Functor1Free<bool,bool> > size");

class LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<char const *,bool> m_func; // 0x14
public:
    ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> >(LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<char const *,bool> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> > &operator=(LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> >) == 24, "Invalid LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1Free<char const *,bool> > size");

class LuaBinding::ObjInternal1<float,bool,LuaBinding::Functor1Free<float,bool> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<float,bool> m_func; // 0x14
public:
    ObjInternal1<float,bool,LuaBinding::Functor1Free<float,bool> >(LuaBinding::ObjInternal1<float,bool,LuaBinding::Functor1Free<float,bool> > const &); /* compiler_generated() */
    _inline ObjInternal1<float,bool,LuaBinding::Functor1Free<float,bool> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<float,bool> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<float,bool,LuaBinding::Functor1Free<float,bool> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<float,bool,LuaBinding::Functor1Free<float,bool> > &operator=(LuaBinding::ObjInternal1<float,bool,LuaBinding::Functor1Free<float,bool> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<float,bool,LuaBinding::Functor1Free<float,bool> >) == 24, "Invalid LuaBinding::ObjInternal1<float,bool,LuaBinding::Functor1Free<float,bool> > size");

class LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,GameObj> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<bool,void,GameObj> m_func; // 0x18
public:
    ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,GameObj> >(LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,GameObj> > const &); /* compiler_generated() */
    _inline ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,GameObj> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<bool,void,GameObj> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,GameObj> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,GameObj> > &operator=(LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,GameObj> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,GameObj> >) == 40, "Invalid LuaBinding::ObjInternal1<bool,void,LuaBinding::Functor1MemberNonConst<bool,void,GameObj> > size");

class LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1Free<unsigned int,unsigned int> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<unsigned int,unsigned int> m_func; // 0x14
public:
    ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1Free<unsigned int,unsigned int> >(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1Free<unsigned int,unsigned int> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1Free<unsigned int,unsigned int> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<unsigned int,unsigned int> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1Free<unsigned int,unsigned int> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1Free<unsigned int,unsigned int> > &operator=(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1Free<unsigned int,unsigned int> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1Free<unsigned int,unsigned int> >) == 24, "Invalid LuaBinding::ObjInternal1<unsigned int,unsigned int,LuaBinding::Functor1Free<unsigned int,unsigned int> > size");

class LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1Free<unsigned int,float> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<unsigned int,float> m_func; // 0x14
public:
    ObjInternal1<unsigned int,float,LuaBinding::Functor1Free<unsigned int,float> >(LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1Free<unsigned int,float> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,float,LuaBinding::Functor1Free<unsigned int,float> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<unsigned int,float> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,float,LuaBinding::Functor1Free<unsigned int,float> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1Free<unsigned int,float> > &operator=(LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1Free<unsigned int,float> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1Free<unsigned int,float> >) == 24, "Invalid LuaBinding::ObjInternal1<unsigned int,float,LuaBinding::Functor1Free<unsigned int,float> > size");

class LuaBinding::ObjInternal1<unsigned int,wchar_t const *,LuaBinding::Functor1Free<unsigned int,wchar_t const *> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<unsigned int,wchar_t const *> m_func; // 0x14
public:
    ObjInternal1<unsigned int,wchar_t const *,LuaBinding::Functor1Free<unsigned int,wchar_t const *> >(LuaBinding::ObjInternal1<unsigned int,wchar_t const *,LuaBinding::Functor1Free<unsigned int,wchar_t const *> > const &); /* compiler_generated() */
    _inline ObjInternal1<unsigned int,wchar_t const *,LuaBinding::Functor1Free<unsigned int,wchar_t const *> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<unsigned int,wchar_t const *> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<unsigned int,wchar_t const *,LuaBinding::Functor1Free<unsigned int,wchar_t const *> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<unsigned int,wchar_t const *,LuaBinding::Functor1Free<unsigned int,wchar_t const *> > &operator=(LuaBinding::ObjInternal1<unsigned int,wchar_t const *,LuaBinding::Functor1Free<unsigned int,wchar_t const *> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<unsigned int,wchar_t const *,LuaBinding::Functor1Free<unsigned int,wchar_t const *> >) == 24, "Invalid LuaBinding::ObjInternal1<unsigned int,wchar_t const *,LuaBinding::Functor1Free<unsigned int,wchar_t const *> > size");

class LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,LuaRuleSystem> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<char const *,void,LuaRuleSystem> m_func; // 0x18
public:
    ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,LuaRuleSystem> >(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,LuaRuleSystem> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,LuaRuleSystem> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<char const *,void,LuaRuleSystem> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,LuaRuleSystem> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,LuaRuleSystem> > &operator=(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,LuaRuleSystem> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,LuaRuleSystem> >) == 40, "Invalid LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,LuaRuleSystem> > size");

class LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1MemberNonConst<char const *,bool,LuaRuleSystem> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<char const *,bool,LuaRuleSystem> m_func; // 0x18
public:
    ObjInternal1<char const *,bool,LuaBinding::Functor1MemberNonConst<char const *,bool,LuaRuleSystem> >(LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1MemberNonConst<char const *,bool,LuaRuleSystem> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,bool,LuaBinding::Functor1MemberNonConst<char const *,bool,LuaRuleSystem> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<char const *,bool,LuaRuleSystem> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,bool,LuaBinding::Functor1MemberNonConst<char const *,bool,LuaRuleSystem> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1MemberNonConst<char const *,bool,LuaRuleSystem> > &operator=(LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1MemberNonConst<char const *,bool,LuaRuleSystem> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1MemberNonConst<char const *,bool,LuaRuleSystem> >) == 40, "Invalid LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1MemberNonConst<char const *,bool,LuaRuleSystem> > size");

class LuaBinding::ObjInternal1<char const *,int,LuaBinding::Functor1Free<char const *,int> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<char const *,int> m_func; // 0x14
public:
    ObjInternal1<char const *,int,LuaBinding::Functor1Free<char const *,int> >(LuaBinding::ObjInternal1<char const *,int,LuaBinding::Functor1Free<char const *,int> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,int,LuaBinding::Functor1Free<char const *,int> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<char const *,int> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,int,LuaBinding::Functor1Free<char const *,int> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,int,LuaBinding::Functor1Free<char const *,int> > &operator=(LuaBinding::ObjInternal1<char const *,int,LuaBinding::Functor1Free<char const *,int> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,int,LuaBinding::Functor1Free<char const *,int> >) == 24, "Invalid LuaBinding::ObjInternal1<char const *,int,LuaBinding::Functor1Free<char const *,int> > size");

class LuaBinding::ObjInternal1<char const *,vector3,LuaBinding::Functor1Free<char const *,vector3> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<char const *,vector3> m_func; // 0x14
public:
    ObjInternal1<char const *,vector3,LuaBinding::Functor1Free<char const *,vector3> >(LuaBinding::ObjInternal1<char const *,vector3,LuaBinding::Functor1Free<char const *,vector3> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,vector3,LuaBinding::Functor1Free<char const *,vector3> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<char const *,vector3> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,vector3,LuaBinding::Functor1Free<char const *,vector3> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,vector3,LuaBinding::Functor1Free<char const *,vector3> > &operator=(LuaBinding::ObjInternal1<char const *,vector3,LuaBinding::Functor1Free<char const *,vector3> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,vector3,LuaBinding::Functor1Free<char const *,vector3> >) == 24, "Invalid LuaBinding::ObjInternal1<char const *,vector3,LuaBinding::Functor1Free<char const *,vector3> > size");

class LuaBinding::ObjInternal1<float,unsigned int,LuaBinding::Functor1Free<float,unsigned int> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<float,unsigned int> m_func; // 0x14
public:
    ObjInternal1<float,unsigned int,LuaBinding::Functor1Free<float,unsigned int> >(LuaBinding::ObjInternal1<float,unsigned int,LuaBinding::Functor1Free<float,unsigned int> > const &); /* compiler_generated() */
    _inline ObjInternal1<float,unsigned int,LuaBinding::Functor1Free<float,unsigned int> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<float,unsigned int> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<float,unsigned int,LuaBinding::Functor1Free<float,unsigned int> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<float,unsigned int,LuaBinding::Functor1Free<float,unsigned int> > &operator=(LuaBinding::ObjInternal1<float,unsigned int,LuaBinding::Functor1Free<float,unsigned int> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<float,unsigned int,LuaBinding::Functor1Free<float,unsigned int> >) == 24, "Invalid LuaBinding::ObjInternal1<float,unsigned int,LuaBinding::Functor1Free<float,unsigned int> > size");

class LuaBinding::ObjInternal1<char const *,double,LuaBinding::Functor1Free<char const *,double> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<char const *,double> m_func; // 0x14
public:
    ObjInternal1<char const *,double,LuaBinding::Functor1Free<char const *,double> >(LuaBinding::ObjInternal1<char const *,double,LuaBinding::Functor1Free<char const *,double> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,double,LuaBinding::Functor1Free<char const *,double> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<char const *,double> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,double,LuaBinding::Functor1Free<char const *,double> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,double,LuaBinding::Functor1Free<char const *,double> > &operator=(LuaBinding::ObjInternal1<char const *,double,LuaBinding::Functor1Free<char const *,double> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,double,LuaBinding::Functor1Free<char const *,double> >) == 24, "Invalid LuaBinding::ObjInternal1<char const *,double,LuaBinding::Functor1Free<char const *,double> > size");

class LuaBinding::ObjInternal1<vector3,vector3,LuaBinding::Functor1Free<vector3,vector3> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1Free<vector3,vector3> m_func; // 0x14
public:
    ObjInternal1<vector3,vector3,LuaBinding::Functor1Free<vector3,vector3> >(LuaBinding::ObjInternal1<vector3,vector3,LuaBinding::Functor1Free<vector3,vector3> > const &); /* compiler_generated() */
    _inline ObjInternal1<vector3,vector3,LuaBinding::Functor1Free<vector3,vector3> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1Free<vector3,vector3> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<vector3,vector3,LuaBinding::Functor1Free<vector3,vector3> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<vector3,vector3,LuaBinding::Functor1Free<vector3,vector3> > &operator=(LuaBinding::ObjInternal1<vector3,vector3,LuaBinding::Functor1Free<vector3,vector3> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<vector3,vector3,LuaBinding::Functor1Free<vector3,vector3> >) == 24, "Invalid LuaBinding::ObjInternal1<vector3,vector3,LuaBinding::Functor1Free<vector3,vector3> > size");

class LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,Scar> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<int,void,Scar> m_func; // 0x14
public:
    ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,Scar> >(LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,Scar> > const &); /* compiler_generated() */
    _inline ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,Scar> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<int,void,Scar> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,Scar> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,Scar> > &operator=(LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,Scar> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,Scar> >) == 28, "Invalid LuaBinding::ObjInternal1<int,void,LuaBinding::Functor1MemberNonConst<int,void,Scar> > size");

class LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScarEventSystem> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberNonConst<char const *,void,ScarEventSystem> m_func; // 0x14
public:
    ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScarEventSystem> >(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScarEventSystem> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScarEventSystem> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberNonConst<char const *,void,ScarEventSystem> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScarEventSystem> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScarEventSystem> > &operator=(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScarEventSystem> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScarEventSystem> >) == 28, "Invalid LuaBinding::ObjInternal1<char const *,void,LuaBinding::Functor1MemberNonConst<char const *,void,ScarEventSystem> > size");

class LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1MemberConst<char const *,bool,ScarEventSystem> > :
    public LuaBinding::ObjInternalBase
{
private:
    LuaBinding::Functor1MemberConst<char const *,bool,ScarEventSystem> m_func; // 0x14
public:
    ObjInternal1<char const *,bool,LuaBinding::Functor1MemberConst<char const *,bool,ScarEventSystem> >(LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1MemberConst<char const *,bool,ScarEventSystem> > const &); /* compiler_generated() */
    _inline ObjInternal1<char const *,bool,LuaBinding::Functor1MemberConst<char const *,bool,ScarEventSystem> >(LuaConfig *, char const *, char const *, LuaBinding::Functor1MemberConst<char const *,bool,ScarEventSystem> const &);
    virtual _inline __int32 Dispatch(lua_State *) override;
    virtual _inline ~ObjInternal1<char const *,bool,LuaBinding::Functor1MemberConst<char const *,bool,ScarEventSystem> >() override; /* compiler_generated() */
    LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1MemberConst<char const *,bool,ScarEventSystem> > &operator=(LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1MemberConst<char const *,bool,ScarEventSystem> > const &); /* compiler_generated() */
};
static_assert(sizeof(LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1MemberConst<char const *,bool,ScarEventSystem> >) == 28, "Invalid LuaBinding::ObjInternal1<char const *,bool,LuaBinding::Functor1MemberConst<char const *,bool,ScarEventSystem> > size");

class LuaBinding::Functor2Member<char const *,char const *,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *,char const *)>
{
public:
    typedef ScriptedFE type_class;
    typedef void *type_func(char const *, char const *);
private:
    ScriptedFE *m_obj; // 0x0
    void *m_func(char const *, char const *); // 0x4
protected:
    Functor2Member<char const *,char const *,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *,char const *)>(ScriptedFE *, void *(char const *, char const *));
public:
    __int32 operator()(double const &, lua_State *, char const *, char const *);
    __int32 operator()(char const &, lua_State *, char const *, char const *);
};
static_assert(sizeof(LuaBinding::Functor2Member<char const *,char const *,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *,char const *)>) == 8, "Invalid LuaBinding::Functor2Member<char const *,char const *,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *,char const *)> size");

class LuaBinding::Functor2Member<char const *,int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *,int)>
{
public:
    typedef ScriptedFE type_class;
    typedef void *type_func(char const *, __int32);
private:
    ScriptedFE *m_obj; // 0x0
    void *m_func(char const *, __int32); // 0x4
protected:
    Functor2Member<char const *,int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *,int)>(ScriptedFE *, void *(char const *, __int32));
public:
    __int32 operator()(double const &, lua_State *, char const *, __int32);
    __int32 operator()(char const &, lua_State *, char const *, __int32);
};
static_assert(sizeof(LuaBinding::Functor2Member<char const *,int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *,int)>) == 8, "Invalid LuaBinding::Functor2Member<char const *,int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *,int)> size");

class LuaBinding::Functor2Member<unsigned int,int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int,int)>
{
public:
    typedef ScriptedFE type_class;
    typedef void *type_func(unsigned __int32, __int32);
private:
    ScriptedFE *m_obj; // 0x0
    void *m_func(unsigned __int32, __int32); // 0x4
protected:
    Functor2Member<unsigned int,int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int,int)>(ScriptedFE *, void *(unsigned __int32, __int32));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32, __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32, __int32);
};
static_assert(sizeof(LuaBinding::Functor2Member<unsigned int,int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int,int)>) == 8, "Invalid LuaBinding::Functor2Member<unsigned int,int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int,int)> size");

class LuaBinding::Functor2Member<unsigned int,char const *,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int,char const *)>
{
public:
    typedef ScriptedFE type_class;
    typedef void *type_func(unsigned __int32, char const *);
private:
    ScriptedFE *m_obj; // 0x0
    void *m_func(unsigned __int32, char const *); // 0x4
protected:
    Functor2Member<unsigned int,char const *,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int,char const *)>(ScriptedFE *, void *(unsigned __int32, char const *));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32, char const *);
    __int32 operator()(char const &, lua_State *, unsigned __int32, char const *);
};
static_assert(sizeof(LuaBinding::Functor2Member<unsigned int,char const *,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int,char const *)>) == 8, "Invalid LuaBinding::Functor2Member<unsigned int,char const *,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int,char const *)> size");

class LuaBinding::Functor2Member<unsigned int,unsigned int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int,unsigned int)>
{
public:
    typedef ScriptedFE type_class;
    typedef void *type_func(unsigned __int32, unsigned __int32);
private:
    ScriptedFE *m_obj; // 0x0
    void *m_func(unsigned __int32, unsigned __int32); // 0x4
protected:
    Functor2Member<unsigned int,unsigned int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int,unsigned int)>(ScriptedFE *, void *(unsigned __int32, unsigned __int32));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor2Member<unsigned int,unsigned int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int,unsigned int)>) == 8, "Invalid LuaBinding::Functor2Member<unsigned int,unsigned int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(unsigned int,unsigned int)> size");

class LuaBinding::Functor2Member<unsigned int,unsigned int,int,StatLogging,int (__thiscall StatLogging::*)(unsigned int,unsigned int)const >
{
public:
    typedef StatLogging type_class;
    typedef __int32 *type_func(unsigned __int32, unsigned __int32) const;
private:
    StatLogging *m_obj; // 0x0
    __int32 *m_func(unsigned __int32, unsigned __int32) const; // 0x4
protected:
    Functor2Member<unsigned int,unsigned int,int,StatLogging,int (__thiscall StatLogging::*)(unsigned int,unsigned int)const >(StatLogging *, __int32 *(unsigned __int32, unsigned __int32) const);
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor2Member<unsigned int,unsigned int,int,StatLogging,int (__thiscall StatLogging::*)(unsigned int,unsigned int)const >) == 8, "Invalid LuaBinding::Functor2Member<unsigned int,unsigned int,int,StatLogging,int (__thiscall StatLogging::*)(unsigned int,unsigned int)const > size");

class LuaBinding::Functor2Member<unsigned int,unsigned int,void,CpuBuildManager,void (__thiscall CpuBuildManager::*)(unsigned int,unsigned int)>
{
public:
    typedef CpuBuildManager type_class;
    typedef void *type_func(unsigned __int32, unsigned __int32);
private:
    CpuBuildManager *m_obj; // 0x0
    void *m_func(unsigned __int32, unsigned __int32); // 0x4
protected:
    Functor2Member<unsigned int,unsigned int,void,CpuBuildManager,void (__thiscall CpuBuildManager::*)(unsigned int,unsigned int)>(CpuBuildManager *, void *(unsigned __int32, unsigned __int32));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor2Member<unsigned int,unsigned int,void,CpuBuildManager,void (__thiscall CpuBuildManager::*)(unsigned int,unsigned int)>) == 8, "Invalid LuaBinding::Functor2Member<unsigned int,unsigned int,void,CpuBuildManager,void (__thiscall CpuBuildManager::*)(unsigned int,unsigned int)> size");

class LuaBinding::Functor2Member<unsigned int,unsigned int,bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(unsigned int,unsigned int)const >
{
public:
    typedef CpuBuildManager type_class;
    typedef bool *type_func(unsigned __int32, unsigned __int32) const;
private:
    CpuBuildManager *m_obj; // 0x0
    bool *m_func(unsigned __int32, unsigned __int32) const; // 0x4
protected:
    Functor2Member<unsigned int,unsigned int,bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(unsigned int,unsigned int)const >(CpuBuildManager *, bool *(unsigned __int32, unsigned __int32) const);
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor2Member<unsigned int,unsigned int,bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(unsigned int,unsigned int)const >) == 8, "Invalid LuaBinding::Functor2Member<unsigned int,unsigned int,bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(unsigned int,unsigned int)const > size");

class LuaBinding::Functor2Member<unsigned int,unsigned int,bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(unsigned int,unsigned int)>
{
public:
    typedef CpuBuildManager type_class;
    typedef bool *type_func(unsigned __int32, unsigned __int32);
private:
    CpuBuildManager *m_obj; // 0x0
    bool *m_func(unsigned __int32, unsigned __int32); // 0x4
protected:
    Functor2Member<unsigned int,unsigned int,bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(unsigned int,unsigned int)>(CpuBuildManager *, bool *(unsigned __int32, unsigned __int32));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor2Member<unsigned int,unsigned int,bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(unsigned int,unsigned int)>) == 8, "Invalid LuaBinding::Functor2Member<unsigned int,unsigned int,bool,CpuBuildManager,bool (__thiscall CpuBuildManager::*)(unsigned int,unsigned int)> size");

class LuaBinding::Functor2Member<unsigned int,float,void,CpuBuildManager,void (__thiscall CpuBuildManager::*)(unsigned int,float)>
{
public:
    typedef CpuBuildManager type_class;
    typedef void *type_func(unsigned __int32, float);
private:
    CpuBuildManager *m_obj; // 0x0
    void *m_func(unsigned __int32, float); // 0x4
protected:
    Functor2Member<unsigned int,float,void,CpuBuildManager,void (__thiscall CpuBuildManager::*)(unsigned int,float)>(CpuBuildManager *, void *(unsigned __int32, float));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32, float);
    __int32 operator()(char const &, lua_State *, unsigned __int32, float);
};
static_assert(sizeof(LuaBinding::Functor2Member<unsigned int,float,void,CpuBuildManager,void (__thiscall CpuBuildManager::*)(unsigned int,float)>) == 8, "Invalid LuaBinding::Functor2Member<unsigned int,float,void,CpuBuildManager,void (__thiscall CpuBuildManager::*)(unsigned int,float)> size");

class LuaBinding::Functor2Member<unsigned int,unsigned int,void,CpuClassifier,void (__thiscall CpuClassifier::*)(unsigned int,unsigned int)>
{
public:
    typedef CpuClassifier type_class;
    typedef void *type_func(unsigned __int32, unsigned __int32);
private:
    CpuClassifier *m_obj; // 0x0
    void *m_func(unsigned __int32, unsigned __int32); // 0x4
protected:
    Functor2Member<unsigned int,unsigned int,void,CpuClassifier,void (__thiscall CpuClassifier::*)(unsigned int,unsigned int)>(CpuClassifier *, void *(unsigned __int32, unsigned __int32));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor2Member<unsigned int,unsigned int,void,CpuClassifier,void (__thiscall CpuClassifier::*)(unsigned int,unsigned int)>) == 8, "Invalid LuaBinding::Functor2Member<unsigned int,unsigned int,void,CpuClassifier,void (__thiscall CpuClassifier::*)(unsigned int,unsigned int)> size");

class LuaBinding::Functor2Member<unsigned int,char const *,void,CpuClassifier,void (__thiscall CpuClassifier::*)(unsigned int,char const *)>
{
public:
    typedef CpuClassifier type_class;
    typedef void *type_func(unsigned __int32, char const *);
private:
    CpuClassifier *m_obj; // 0x0
    void *m_func(unsigned __int32, char const *); // 0x4
protected:
    Functor2Member<unsigned int,char const *,void,CpuClassifier,void (__thiscall CpuClassifier::*)(unsigned int,char const *)>(CpuClassifier *, void *(unsigned __int32, char const *));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32, char const *);
    __int32 operator()(char const &, lua_State *, unsigned __int32, char const *);
};
static_assert(sizeof(LuaBinding::Functor2Member<unsigned int,char const *,void,CpuClassifier,void (__thiscall CpuClassifier::*)(unsigned int,char const *)>) == 8, "Invalid LuaBinding::Functor2Member<unsigned int,char const *,void,CpuClassifier,void (__thiscall CpuClassifier::*)(unsigned int,char const *)> size");

class LuaBinding::Functor2Member<unsigned int,unsigned int,bool,CpuClassifier,bool (__thiscall CpuClassifier::*)(unsigned int,unsigned int)const >
{
public:
    typedef CpuClassifier type_class;
    typedef bool *type_func(unsigned __int32, unsigned __int32) const;
private:
    CpuClassifier *m_obj; // 0x0
    bool *m_func(unsigned __int32, unsigned __int32) const; // 0x4
protected:
    Functor2Member<unsigned int,unsigned int,bool,CpuClassifier,bool (__thiscall CpuClassifier::*)(unsigned int,unsigned int)const >(CpuClassifier *, bool *(unsigned __int32, unsigned __int32) const);
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor2Member<unsigned int,unsigned int,bool,CpuClassifier,bool (__thiscall CpuClassifier::*)(unsigned int,unsigned int)const >) == 8, "Invalid LuaBinding::Functor2Member<unsigned int,unsigned int,bool,CpuClassifier,bool (__thiscall CpuClassifier::*)(unsigned int,unsigned int)const > size");

class LuaBinding::Functor2Member<unsigned int,unsigned int,unsigned int,CpuClassifier,unsigned int (__thiscall CpuClassifier::*)(unsigned int,unsigned int)const >
{
public:
    typedef CpuClassifier type_class;
    typedef unsigned __int32 *type_func(unsigned __int32, unsigned __int32) const;
private:
    CpuClassifier *m_obj; // 0x0
    unsigned __int32 *m_func(unsigned __int32, unsigned __int32) const; // 0x4
protected:
    Functor2Member<unsigned int,unsigned int,unsigned int,CpuClassifier,unsigned int (__thiscall CpuClassifier::*)(unsigned int,unsigned int)const >(CpuClassifier *, unsigned __int32 *(unsigned __int32, unsigned __int32) const);
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32, unsigned __int32);
    __int32 operator()(char const &, lua_State *, unsigned __int32, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor2Member<unsigned int,unsigned int,unsigned int,CpuClassifier,unsigned int (__thiscall CpuClassifier::*)(unsigned int,unsigned int)const >) == 8, "Invalid LuaBinding::Functor2Member<unsigned int,unsigned int,unsigned int,CpuClassifier,unsigned int (__thiscall CpuClassifier::*)(unsigned int,unsigned int)const > size");

class LuaBinding::Functor2Member<int,int,int,CpuPlayerQuery,int (__thiscall CpuPlayerQuery::*)(int,int)>
{
public:
    typedef CpuPlayerQuery type_class;
    typedef __int32 *type_func(__int32, __int32);
private:
    CpuPlayerQuery *m_obj; // 0x0
    __int32 *m_func(__int32, __int32); // 0x4
protected:
    Functor2Member<int,int,int,CpuPlayerQuery,int (__thiscall CpuPlayerQuery::*)(int,int)>(CpuPlayerQuery *, __int32 *(__int32, __int32));
public:
    __int32 operator()(double const &, lua_State *, __int32, __int32);
    __int32 operator()(char const &, lua_State *, __int32, __int32);
};
static_assert(sizeof(LuaBinding::Functor2Member<int,int,int,CpuPlayerQuery,int (__thiscall CpuPlayerQuery::*)(int,int)>) == 8, "Invalid LuaBinding::Functor2Member<int,int,int,CpuPlayerQuery,int (__thiscall CpuPlayerQuery::*)(int,int)> size");

class LuaBinding::Functor2Member<unsigned int,float,void,CpuResearchManager,void (__thiscall CpuResearchManager::*)(unsigned int,float)>
{
public:
    typedef CpuResearchManager type_class;
    typedef void *type_func(unsigned __int32, float);
private:
    CpuResearchManager *m_obj; // 0x0
    void *m_func(unsigned __int32, float); // 0x4
protected:
    Functor2Member<unsigned int,float,void,CpuResearchManager,void (__thiscall CpuResearchManager::*)(unsigned int,float)>(CpuResearchManager *, void *(unsigned __int32, float));
public:
    __int32 operator()(double const &, lua_State *, unsigned __int32, float);
    __int32 operator()(char const &, lua_State *, unsigned __int32, float);
};
static_assert(sizeof(LuaBinding::Functor2Member<unsigned int,float,void,CpuResearchManager,void (__thiscall CpuResearchManager::*)(unsigned int,float)>) == 8, "Invalid LuaBinding::Functor2Member<unsigned int,float,void,CpuResearchManager,void (__thiscall CpuResearchManager::*)(unsigned int,float)> size");

class LuaBinding::Functor2Member<float,float,float,HW2CpuPlayer,float (__thiscall HW2CpuPlayer::*)(float,float)>
{
public:
    typedef HW2CpuPlayer type_class;
    typedef float *type_func(float, float);
private:
    HW2CpuPlayer *m_obj; // 0x0
    float *m_func(float, float); // 0x8
protected:
    Functor2Member<float,float,float,HW2CpuPlayer,float (__thiscall HW2CpuPlayer::*)(float,float)>(HW2CpuPlayer *, float *(float, float));
public:
    __int32 operator()(double const &, lua_State *, float, float);
    __int32 operator()(char const &, lua_State *, float, float);
};
static_assert(sizeof(LuaBinding::Functor2Member<float,float,float,HW2CpuPlayer,float (__thiscall HW2CpuPlayer::*)(float,float)>) == 16, "Invalid LuaBinding::Functor2Member<float,float,float,HW2CpuPlayer,float (__thiscall HW2CpuPlayer::*)(float,float)> size");

class LuaBinding::Functor2Member<float,float,void,NISScript,void (__thiscall NISScript::*)(float,float)>
{
public:
    typedef NISScript type_class;
    typedef void *type_func(float, float);
private:
    NISScript *m_obj; // 0x0
    void *m_func(float, float); // 0x4
protected:
    Functor2Member<float,float,void,NISScript,void (__thiscall NISScript::*)(float,float)>(NISScript *, void *(float, float));
public:
    __int32 operator()(double const &, lua_State *, float, float);
    __int32 operator()(char const &, lua_State *, float, float);
};
static_assert(sizeof(LuaBinding::Functor2Member<float,float,void,NISScript,void (__thiscall NISScript::*)(float,float)>) == 8, "Invalid LuaBinding::Functor2Member<float,float,void,NISScript,void (__thiscall NISScript::*)(float,float)> size");

class LuaBinding::Functor2Member<char const *,float,void,NISScript,void (__thiscall NISScript::*)(char const *,float)>
{
public:
    typedef NISScript type_class;
    typedef void *type_func(char const *, float);
private:
    NISScript *m_obj; // 0x0
    void *m_func(char const *, float); // 0x4
protected:
    Functor2Member<char const *,float,void,NISScript,void (__thiscall NISScript::*)(char const *,float)>(NISScript *, void *(char const *, float));
public:
    __int32 operator()(double const &, lua_State *, char const *, float);
    __int32 operator()(char const &, lua_State *, char const *, float);
};
static_assert(sizeof(LuaBinding::Functor2Member<char const *,float,void,NISScript,void (__thiscall NISScript::*)(char const *,float)>) == 8, "Invalid LuaBinding::Functor2Member<char const *,float,void,NISScript,void (__thiscall NISScript::*)(char const *,float)> size");

class LuaBinding::Functor2Member<float,char const *,void,UI::MovieSpeech,void (__thiscall UI::MovieSpeech::*)(float,char const *)>
{
public:
    typedef UI::MovieSpeech type_class;
    typedef void *type_func(float, char const *);
private:
    UI::MovieSpeech *m_obj; // 0x0
    void *m_func(float, char const *); // 0x4
protected:
    Functor2Member<float,char const *,void,UI::MovieSpeech,void (__thiscall UI::MovieSpeech::*)(float,char const *)>(UI::MovieSpeech *, void *(float, char const *));
public:
    __int32 operator()(double const &, lua_State *, float, char const *);
    __int32 operator()(char const &, lua_State *, float, char const *);
};
static_assert(sizeof(LuaBinding::Functor2Member<float,char const *,void,UI::MovieSpeech,void (__thiscall UI::MovieSpeech::*)(float,char const *)>) == 8, "Invalid LuaBinding::Functor2Member<float,char const *,void,UI::MovieSpeech,void (__thiscall UI::MovieSpeech::*)(float,char const *)> size");

class LuaBinding::Functor2Member<char const *,unsigned int,void,UnitCaps,void (__thiscall UnitCaps::*)(char const *,unsigned int)>
{
public:
    typedef UnitCaps type_class;
    typedef void *type_func(char const *, unsigned __int32);
private:
    UnitCaps *m_obj; // 0x0
    void *m_func(char const *, unsigned __int32); // 0x4
protected:
    Functor2Member<char const *,unsigned int,void,UnitCaps,void (__thiscall UnitCaps::*)(char const *,unsigned int)>(UnitCaps *, void *(char const *, unsigned __int32));
public:
    __int32 operator()(double const &, lua_State *, char const *, unsigned __int32);
    __int32 operator()(char const &, lua_State *, char const *, unsigned __int32);
};
static_assert(sizeof(LuaBinding::Functor2Member<char const *,unsigned int,void,UnitCaps,void (__thiscall UnitCaps::*)(char const *,unsigned int)>) == 8, "Invalid LuaBinding::Functor2Member<char const *,unsigned int,void,UnitCaps,void (__thiscall UnitCaps::*)(char const *,unsigned int)> size");

class LuaBinding::Functor2Member<char const *,float,void,LuaRuleSystem,void (__thiscall LuaRuleSystem::*)(char const *,float)>
{
public:
    typedef LuaRuleSystem type_class;
    typedef void *type_func(char const *, float);
private:
    LuaRuleSystem *m_obj; // 0x0
    void *m_func(char const *, float); // 0x8
protected:
    Functor2Member<char const *,float,void,LuaRuleSystem,void (__thiscall LuaRuleSystem::*)(char const *,float)>(LuaRuleSystem *, void *(char const *, float));
public:
    __int32 operator()(double const &, lua_State *, char const *, float);
    __int32 operator()(char const &, lua_State *, char const *, float);
};
static_assert(sizeof(LuaBinding::Functor2Member<char const *,float,void,LuaRuleSystem,void (__thiscall LuaRuleSystem::*)(char const *,float)>) == 16, "Invalid LuaBinding::Functor2Member<char const *,float,void,LuaRuleSystem,void (__thiscall LuaRuleSystem::*)(char const *,float)> size");

class LuaBinding::Functor2Member<int,char const *,void,Scar,void (__thiscall Scar::*)(int,char const *)>
{
public:
    typedef Scar type_class;
    typedef void *type_func(__int32, char const *);
private:
    Scar *m_obj; // 0x0
    void *m_func(__int32, char const *); // 0x4
protected:
    Functor2Member<int,char const *,void,Scar,void (__thiscall Scar::*)(int,char const *)>(Scar *, void *(__int32, char const *));
public:
    __int32 operator()(double const &, lua_State *, __int32, char const *);
    __int32 operator()(char const &, lua_State *, __int32, char const *);
};
static_assert(sizeof(LuaBinding::Functor2Member<int,char const *,void,Scar,void (__thiscall Scar::*)(int,char const *)>) == 8, "Invalid LuaBinding::Functor2Member<int,char const *,void,Scar,void (__thiscall Scar::*)(int,char const *)> size");

class LuaBinding::Functor2MemberNonConst<char const *,char const *,void,ScriptedFE> :
    public LuaBinding::Functor2Member<char const *,char const *,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *,char const *)>
{
public:
    _inline Functor2MemberNonConst<char const *,char const *,void,ScriptedFE>(ScriptedFE *, void *(char const *, char const *));
};
static_assert(sizeof(LuaBinding::Functor2MemberNonConst<char const *,char const *,void,ScriptedFE>) == 8, "Invalid LuaBinding::Functor2MemberNonConst<char const *,char const *,void,ScriptedFE> size");

class LuaBinding::Functor2MemberNonConst<char const *,int,void,ScriptedFE> :
    public LuaBinding::Functor2Member<char const *,int,void,ScriptedFE,void (__thiscall ScriptedFE::*)(char const *,int)>
{
public:
    _inline Functor2MemberNonConst<char const *,int,void,ScriptedFE>(ScriptedFE *, void *(char const *, __int32));
};
static_assert(sizeof(LuaBinding::Functor2MemberNonConst<char const *,int,void,ScriptedFE>) == 8, "Invalid LuaBinding::Functor2MemberNonConst<char const *,int,void,ScriptedFE> size");

