#if 0
/* ---------- headers */

#include "decomp.h"
#include <datetimeapi.h>
#include <Render\gl\r_types.h>
#include <winnt.h>
#include <processtopologyapi.h>
#include <Mathlib\matvec.h>
#include <kernelspecs.h>
#include <xstring>
#include <basetsd.h>
#include <pshpack2.h>
#include <xmemory0>
#include <Mathlib\matrix4.h>
#include <libloaderapi.h>
#include <Camera\Camera.h>
#include <pch.h>
#include <sysinfoapi.h>
#include <Camera\Frustum.h>
#include <objidlbase.h>
#include <Camera\Plane3.h>
#include <crtdefs.h>
#include <winreg.h>
#include <ncrypt.h>
#include <profile\profile.h>
#include <Render\gl\r_defines.h>
#include <iostream>
#include <Render\gl\glext.h>
#include <unknwnbase.h>
#include <boost\type_traits\detail\ice_eq.hpp>
#include <winsock.h>
#include <oaidl.h>
#include <nb30.h>
#include <commdlg.h>
#include <Mathlib\matrix3.h>
#include <timeapi.h>
#include <dpapi.h>
#include <propidl.h>
#include <boost\checked_delete.hpp>
#include <unknwn.h>
#include <Render\FxGL\FXManager.h>
#include <BattleScar\BattleScarLoad.h>
#include <securityappcontainer.h>
#include <Render\FxGL\VarMulti.h>
#include <fibersapi.h>
#include <imm.h>
#include <new>
#include <exception>
#include <xstddef>
#include <BattleScar\BattleScarInternal.h>
#include <winver.h>
#include <winscard.h>
#include <type_traits>
#include <verrsrc.h>
#include <wtypes.h>
#include <rpcndr.h>
#include <realtimeapiset.h>
#include <tvout.h>
#include <rpcnsip.h>
#include <mciapi.h>
#include <stralign.h>

#include <boost\pool\simple_segregated_storage.hpp>
#include <boost\pool\detail\mutex.hpp>
#include <windows.h>
#include <boost\mem_fn.hpp>
#include <winapifamily.h>
#include <boost\get_pointer.hpp>
#include <sdkddkver.h>
#include <threadpoollegacyapiset.h>
#include <rpcnterr.h>
#include <wtypesbase.h>
#include <winspool.h>
#include <excpt.h>
#include <rpcnsi.h>
#include <rpcasync.h>
#include <prsht.h>
#include <poppack.h>
#include <boost\bind\mem_fn_template.hpp>
#include <mmiscapi2.h>
#include <profileapi.h>
#include <winefs.h>
#include <Collision\primitivesfwd.h>
#include <synchapi.h>
#include <inaddr.h>
#include <mmsystem.h>
#include <mmsyscom.h>
#include <hw2box\hw2box.h>
#include <utilapiset.h>
#include <heapapi.h>
#include <processthreadsapi.h>
#include <Mathlib\mathlibdll.h>
#include <Mathlib\fastmath.h>
#include <pshpack8.h>
#include <winnetwk.h>
#include <wnnc.h>
#include <savegamedata.h>
#include <Collision\Primitives\sphere.h>
#include <stdarg.h>
#include <windef.h>
#include <oleidl.h>
#include <mcx.h>
#include <debug\db.h>
#include <minwindef.h>
#include <bemapiset.h>
#include <rpcdcep.h>
#include <boost\type_traits\detail\ice_and.hpp>
#include <specstrings.h>
#include <playsoundapi.h>
#include <specstrings_strict.h>
#include <specstrings_undef.h>
#include <handleapi.h>
#include <driverspecs.h>
#include <sdv_driverspecs.h>
#include <threadpoolapiset.h>
#include <util\colour.h>
#include <objidl.h>
#include <msxml.h>
#include <namespaceapi.h>
#include <savegamedef.h>
#include <ktmtypes.h>
#include <renderer.h>
#include <winsmcrd.h>
#include <winbase.h>
#include <wincon.h>
#include <mmiscapi.h>
#include <apisetcconv.h>
#include <mmeapi.h>
#include <minwinbase.h>
#include <errhandlingapi.h>
#include <ime_cmodes.h>
#include <Render\objects\textureregistry.h>
#include <processenv.h>
#include <hash_map>
#include <guiddef.h>
#include <xhash>
#include <BattleScar\BattleScarManager.h>
#include <jobapi.h>
#include <platform\cmdline.h>
#include <Decal\DecalManager.h>
#include <BattleScar\BattleScarUtil.h>
#include <platform\platformexports.h>
#include <Decal\VertexPool.h>
#include <Render\objects\texture.h>
#include <apiset.h>
#include <Render\objects\objects.h>
#include <ole2.h>
#include <boost\type_traits\detail\ice_not.hpp>
#include <Render\objects\core.h>
#include <systemtopologyapi.h>
#include <pshpack1.h>
#include <objbase.h>
#include <Render\gl\types.h>
#include <wow64apiset.h>
#include <combaseapi.h>
#include <algorithm>
#include <Render\gl\lotypes.h>
#include <winnls.h>
#include <shellapi.h>

/* ---------- constants */

/* ---------- definitions */

class `anonymous-namespace'::LessCaseInsensitiveString
{
public:
    bool operator()(std::basic_string<char,std::char_traits<char>,std::allocator<char> > const &, std::basic_string<char,std::char_traits<char>,std::allocator<char> > const &) const;
};
static_assert(sizeof(`anonymous-namespace'::LessCaseInsensitiveString) == 1, "Invalid `anonymous-namespace'::LessCaseInsensitiveString size");

struct FXObjDestroyer
{
    void operator()(BattleScarManager::Object::FXInstance &);
};
static_assert(sizeof(FXObjDestroyer) == 1, "Invalid FXObjDestroyer size");

typedef std::vector<BattleScarManager::Handle,std::allocator<BattleScarManager::Handle> > HandleList;
typedef `anonymous-namespace'::LessCaseInsensitiveString ?A0x9f2bef27::LessCaseInsensitiveString;
typedef std::map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,BattleScarManager::Type *,`anonymous namespace'::LessCaseInsensitiveString,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,BattleScarManager::Type *> > > TypeMap;

/* ---------- prototypes */

/* ---------- globals */

extern char const BattleScarManager::m_saveToken[18]; // 0x79F9B4
extern SaveData const BattleScarManager::m_saveData[1]; // 0x79F9C8

/* ---------- private variables */

_static
{
    extern BattleScarManager *s_pInstance; // 0x844994
    extern boost::pool<boost::default_user_allocator_new_delete> s_decalPool; // 0x839AA8
    extern __int32 const kManagerVersion; // 0x79F9E8
    extern __int32 const kObjectVersion; // 0x79F9EC
    extern __int32 const kDecalVersion; // 0x79F9F0
    extern char const kObjectToken[4]; // 0x79F9F4
    extern char const kDecalToken[6]; // 0x79F9F8
    extern char const kHandleListToken[6]; // 0x79FA00
    extern bool s_bHealthCap; // 0x839AA4
    extern bool s_bTriCap; // 0x839AA5
}

/* ---------- public code */

_extern BattleScarManager *_sub_55B801();
BattleScarManager *BattleScarManager::instance() // 0x55B801
{
    mangled_assert("?instance@BattleScarManager@@SGPAV1@XZ");
    todo("implement");
    BattleScarManager * __result = _sub_55B801();
    return __result;
}

_extern bool _sub_55CA00();
bool BattleScarManager::startup() // 0x55CA00
{
    mangled_assert("?startup@BattleScarManager@@SG_NXZ");
    todo("implement");
    bool __result = _sub_55CA00();
    return __result;
}

_extern bool _sub_55C9D6();
bool BattleScarManager::shutdown() // 0x55C9D6
{
    mangled_assert("?shutdown@BattleScarManager@@SG_NXZ");
    todo("implement");
    bool __result = _sub_55C9D6();
    return __result;
}

_extern bool _sub_55C848(SaveGameData *, SaveType);
bool BattleScarManager::saveSingleton(SaveGameData *saveGameData, SaveType saveType) // 0x55C848
{
