#if 0
#ifndef __TYPEMAGIC_H__
#define __TYPEMAGIC_H__
#pragma once

/* ---------- headers */

/* ---------- constants */

/* ---------- definitions */

/* ---------- prototypes */

/* ---------- globals */

/* ---------- public code */

/* ---------- private code */

#endif // __TYPEMAGIC_H__
/* combined */
#ifndef __TYPEMAGIC_H__
#define __TYPEMAGIC_H__
#pragma once

/* ---------- headers */

/* ---------- constants */

/* ---------- definitions */

class TypeMagic::IsType<unsigned char,float>
{
public:
    class ?$Check@M;
    enum
    {
        result = 0,
    };
    class ?$Check@E;
};
static_assert(sizeof(TypeMagic::IsType<unsigned char,float>) == 1, "Invalid TypeMagic::IsType<unsigned char,float> size");

class TypeMagic::IsType<unsigned char,wchar_t>
{
public:
    class ?$Check@_W;
    enum
    {
        result = 0,
    };
    class ?$Check@E;
};
static_assert(sizeof(TypeMagic::IsType<unsigned char,wchar_t>) == 1, "Invalid TypeMagic::IsType<unsigned char,wchar_t> size");

class TypeMagic::IsType<unsigned char,unsigned int>
{
public:
    class ?$Check@I;
    enum
    {
        result = 0,
    };
    class ?$Check@E;
};
static_assert(sizeof(TypeMagic::IsType<unsigned char,unsigned int>) == 1, "Invalid TypeMagic::IsType<unsigned char,unsigned int> size");

class TypeMagic::IsType<unsigned char,double>
{
public:
    class ?$Check@N;
    enum
    {
        result = 0,
    };
    class ?$Check@E;
};
static_assert(sizeof(TypeMagic::IsType<unsigned char,double>) == 1, "Invalid TypeMagic::IsType<unsigned char,double> size");

class TypeMagic::IsType<unsigned char,char>
{
public:
    class ?$Check@D;
    enum
    {
        result = 0,
    };
    class ?$Check@E;
};
static_assert(sizeof(TypeMagic::IsType<unsigned char,char>) == 1, "Invalid TypeMagic::IsType<unsigned char,char> size");

class TypeMagic::IsType<unsigned char,unsigned long>
{
public:
    class ?$Check@K;
    enum
    {
        result = 0,
    };
    class ?$Check@E;
};
static_assert(sizeof(TypeMagic::IsType<unsigned char,unsigned long>) == 1, "Invalid TypeMagic::IsType<unsigned char,unsigned long> size");

class TypeMagic::IsType<unsigned char,unsigned short>
{
public:
    class ?$Check@G;
    enum
    {
        result = 0,
    };
    class ?$Check@E;
};
static_assert(sizeof(TypeMagic::IsType<unsigned char,unsigned short>) == 1, "Invalid TypeMagic::IsType<unsigned char,unsigned short> size");

class TypeMagic::IsType<unsigned char,long>
{
public:
    class ?$Check@J;
    enum
    {
        result = 0,
    };
    class ?$Check@E;
};
static_assert(sizeof(TypeMagic::IsType<unsigned char,long>) == 1, "Invalid TypeMagic::IsType<unsigned char,long> size");

class TypeMagic::IsType<unsigned char,int>
{
public:
    class ?$Check@H;
    enum
    {
        result = 0,
    };
    class ?$Check@E;
};
static_assert(sizeof(TypeMagic::IsType<unsigned char,int>) == 1, "Invalid TypeMagic::IsType<unsigned char,int> size");

class TypeMagic::IsType<unsigned char,unsigned char>
{
public:
    class ?$Check@E;
    enum
    {
        result = 1, // 0x0001
    };
};
static_assert(sizeof(TypeMagic::IsType<unsigned char,unsigned char>) == 1, "Invalid TypeMagic::IsType<unsigned char,unsigned char> size");

class TypeMagic::IsType<unsigned char,short>
{
public:
    class ?$Check@F;
    enum
    {
        result = 0,
    };
    class ?$Check@E;
};
static_assert(sizeof(TypeMagic::IsType<unsigned char,short>) == 1, "Invalid TypeMagic::IsType<unsigned char,short> size");

class TypeMagic::IsBuiltIn<unsigned char>
{
public:
    enum
    {
        result = 1, // 0x0001
    };
};
static_assert(sizeof(TypeMagic::IsBuiltIn<unsigned char>) == 1, "Invalid TypeMagic::IsBuiltIn<unsigned char> size");

/* ---------- prototypes */

/* ---------- globals */

/* ---------- public code */

/* ---------- private code */

#endif // __TYPEMAGIC_H__
/* combined */
#ifndef __TYPEMAGIC_H__
#define __TYPEMAGIC_H__
#pragma once

/* ---------- headers */

/* ---------- constants */

/* ---------- definitions */

/* ---------- prototypes */

/* ---------- globals */

/* ---------- public code */

/* ---------- private code */

#endif // __TYPEMAGIC_H__
/* combined */
#ifndef __TYPEMAGIC_H__
#define __TYPEMAGIC_H__
#pragma once

/* ---------- headers */

/* ---------- constants */

/* ---------- definitions */

/* ---------- prototypes */

/* ---------- globals */

/* ---------- public code */

/* ---------- private code */

#endif // __TYPEMAGIC_H__
/* combined */
#ifndef __TYPEMAGIC_H__
#define __TYPEMAGIC_H__
#pragma once

/* ---------- headers */

/* ---------- constants */

/* ---------- definitions */

/* ---------- prototypes */

/* ---------- globals */

/* ---------- public code */

/* ---------- private code */

#endif // __TYPEMAGIC_H__
/* combined */
#ifndef __TYPEMAGIC_H__
#define __TYPEMAGIC_H__
#pragma once

/* ---------- headers */

/* ---------- constants */

/* ---------- definitions */

/* ---------- prototypes */

/* ---------- globals */

/* ---------- public code */

/* ---------- private code */

#endif // __TYPEMAGIC_H__
/* combined */
#ifndef __TYPEMAGIC_H__
#define __TYPEMAGIC_H__
#pragma once

/* ---------- headers */

/* ---------- constants */

/* ---------- definitions */

/* ---------- prototypes */

/* ---------- globals */

/* ---------- public code */

/* ---------- private code */

#endif // __TYPEMAGIC_H__
/* combined */
#ifndef __TYPEMAGIC_H__
#define __TYPEMAGIC_H__
#pragma once

/* ---------- headers */

/* ---------- constants */

/* ---------- definitions */

/* ---------- prototypes */

/* ---------- globals */

/* ---------- public code */

/* ---------- private code */

#endif // __TYPEMAGIC_H__
/* combined */
#ifndef __TYPEMAGIC_H__
#define __TYPEMAGIC_H__
#pragma once

/* ---------- headers */

/* ---------- constants */

/* ---------- definitions */

/* ---------- prototypes */

/* ---------- globals */

/* ---------- public code */

/* ---------- private code */

#endif // __TYPEMAGIC_H__
/* combined */
#ifndef __TYPEMAGIC_H__
#define __TYPEMAGIC_H__
#pragma once

/* ---------- headers */

/* ---------- constants */

/* ---------- definitions */

/* ---------- prototypes */

/* ---------- globals */

/* ---------- public code */

/* ---------- private code */

#endif // __TYPEMAGIC_H__
#endif
