#if 0
/* ---------- headers */

#include "decomp.h"
#include <winerror.h>
#include <securitybaseapi.h>
#include <winreg.h>
#include <reason.h>
#include <consoleapi.h>
#include <wingdi.h>
#include <pshpack8.h>
#include <GSLobby\GamespySDK\chat\chatCallbacks.h>
#include <timezoneapi.h>
#include <ioapiset.h>
#include <GSLobby\GamespySDK\darray.h>
#include <string.h>
#include <memoryapi.h>
#include <winnt.h>
#include <ctype.h>
#include <apiset.h>
#include <stdio.h>
#include <crtdefs.h>
#include <processthreadsapi.h>
#include <profileapi.h>
#include <sal.h>
#include <concurrencysal.h>
#include <vadefs.h>
#include <systemtopologyapi.h>
#include <heapapi.h>
#include <bemapiset.h>
#include <threadpoollegacyapiset.h>
#include <GSLobby\GamespySDK\hashtable.h>
#include <processtopologyapi.h>
#include <assert.h>
#include <debugapi.h>
#include <fibersapi.h>
#include <GSLobby\GamespySDK\chat\chatChannel.h>
#include <kernelspecs.h>
#include <GSLobby\GamespySDK\chat\chatSocket.h>
#include <basetsd.h>
#include <GSLobby\GamespySDK\chat\chatCrypt.h>
#include <mcx.h>
#include <pshpack1.h>
#include <GSLobby\GamespySDK\chat\chatMain.h>
#include <GSLobby\GamespySDK\chat\chat.h>
#include <winnls.h>
#include <datetimeapi.h>
#include <swprintf.inl>
#include <namedpipeapi.h>
#include <securityappcontainer.h>
#include <wincon.h>
#include <stdlib.h>
#include <fileapi.h>
#include <limits.h>
#include <jobapi.h>
#include <pshpack2.h>
#include <wtime.inl>
#include <ktmtypes.h>
#include <pshpack4.h>
#include <winver.h>
#include <winnetwk.h>
#include <verrsrc.h>
#include <realtimeapiset.h>
#include <processenv.h>
#include <wnnc.h>
#include <wow64apiset.h>
#include <utilapiset.h>
#include <GSLobby\GamespySDK\chat\chatHandlers.h>
#include <winuser.h>
#include <ime_cmodes.h>
#include <GSLobby\GamespySDK\nonport.h>
#include <winsock.h>
#include <sysinfoapi.h>
#include <windows.h>
#include <winapifamily.h>
#include <time.h>
#include <threadpoolapiset.h>
#include <sdkddkver.h>
#include <time.inl>
#include <excpt.h>
#include <stringapiset.h>
#include <libloaderapi.h>
#include <tvout.h>
#include <interlockedapi.h>
#include <winbase.h>
#include <handleapi.h>
#include <apisetcconv.h>
#include <imm.h>
#include <minwinbase.h>
#include <synchapi.h>
#include <poppack.h>
#include <guiddef.h>
#include <stdarg.h>
#include <windef.h>
#include <minwindef.h>
#include <specstrings.h>
#include <specstrings_strict.h>
#include <specstrings_undef.h>
#include <driverspecs.h>
#include <sdv_driverspecs.h>
#include <inaddr.h>
#include <stralign.h>
#include <namespaceapi.h>
#include <winsvc.h>
#include <errhandlingapi.h>

/* ---------- constants */

enum
{
    TYPE_LIST = 0,
    TYPE_JOIN,
    TYPE_TOPIC,
    TYPE_NAMES,
    TYPE_WHOIS,
    TYPE_CMODE,
    TYPE_UMODE,
    TYPE_BAN,
    TYPE_GETBAN,
    TYPE_NICK,
    TYPE_WHO,
    TYPE_CWHO,
    TYPE_GETKEY,
    TYPE_GETCKEY,
    TYPE_GETCHANKEY,
    TYPE_UNQUIET,
    TYPE_CDKEY,
    NUM_TYPES,
};

/* ---------- definitions */

typedef _gs_crypt_key gs_crypt_key;
typedef void (*chatGetChannelTopicCallback)(void *, CHATBool, char const *, char const *, void *);
typedef void (*ciChannelListUsersCallback)(void *, char const *, __int32, char const **, __int32 *, void *);
typedef void (*chatEnumChannelBansCallback)(void *, CHATBool, char const *, __int32, char const **, void *);
typedef void (*chatGetChannelBasicUserInfoCallback)(void *, CHATBool, char const *, char const *, char const *, char const *, void *);
typedef void (*chatGetChannelPasswordCallback)(void *, CHATBool, char const *, CHATBool, char const *, void *);
typedef void (*chatGetUserModeCallback)(void *, CHATBool, char const *, char const *, __int32, void *);
typedef void (*chatEnumChannelsCallbackAll)(void *, CHATBool, __int32, char const **, char const **, __int32 *, void *);
typedef void (*chatGetChannelModeCallback)(void *, CHATBool, char const *, CHATChannelMode *, void *);
typedef void (*chatEnumJoinedChannelsCallback)(void *, __int32, char const *, void *);
typedef void (*chatEnumChannelsCallbackEach)(void *, CHATBool, __int32, char const *, char const *, __int32, void *);
typedef void (*chatGetUserInfoCallback)(void *, CHATBool, char const *, char const *, char const *, char const *, __int32, char const **, void *);
typedef void (*ciUserEnumChannelsCallback)(void *, char const *, char const *, void *);

struct ciModeChange
{
    __int32 mode; // 0x0
    CHATBool enable; // 0x4
    char *param; // 0x8
};
static_assert(sizeof(ciModeChange) == 12, "Invalid ciModeChange size");

struct ciFilterMatch
{
    __int32 type; // 0x0
    char const *name; // 0x4
    char const *name2; // 0x8
};
static_assert(sizeof(ciFilterMatch) == 12, "Invalid ciFilterMatch size");

struct LISTData
{
    CHATBool gotStart; // 0x0
    __int32 numChannels; // 0x4
    char **channels; // 0x8
    __int32 *numUsers; // 0xC
    char **topics; // 0x10
};
static_assert(sizeof(LISTData) == 20, "Invalid LISTData size");

struct JOINData
{
    chatChannelCallbacks callbacks; // 0x0
    CHATBool joined; // 0x30
    char password[256]; // 0x34
};
static_assert(sizeof(JOINData) == 308, "Invalid JOINData size");

struct NAMESData
{
    __int32 len; // 0x0
    __int32 numUsers; // 0x4
    char **users; // 0x8
    __int32 *modes; // 0xC
};
static_assert(sizeof(NAMESData) == 16, "Invalid NAMESData size");

struct WHOISData
{
    char *user; // 0x0
    char *name; // 0x4
    char *address; // 0x8
    __int32 numChannels; // 0xC
    char **channels; // 0x10
};
static_assert(sizeof(WHOISData) == 20, "Invalid WHOISData size");

struct BANData
{
    char *channel; // 0x0
};
static_assert(sizeof(BANData) == 4, "Invalid BANData size");

struct GETBANData
{
    __int32 numBans; // 0x0
    char **bans; // 0x4
};
static_assert(sizeof(GETBANData) == 8, "Invalid GETBANData size");

struct GETKEYData
{
    __int32 num; // 0x0
    char **keys; // 0x4
    char *channel; // 0x8
};
static_assert(sizeof(GETKEYData) == 12, "Invalid GETKEYData size");

struct GETCKEYData
{
    __int32 num; // 0x0
    char **keys; // 0x4
    CHATBool channel; // 0x8
    CHATBool allBroadcastKeys; // 0xC
};
static_assert(sizeof(GETCKEYData) == 16, "Invalid GETCKEYData size");

struct GETCHANKEYData
{
    __int32 num; // 0x0
    char **keys; // 0x4
    CHATBool allBroadcastKeys; // 0x8
};
static_assert(sizeof(GETCHANKEYData) == 12, "Invalid GETCHANKEYData size");

/* ---------- prototypes */

extern void ciFilterThink(void *chat);
extern __int32 ciGetNextID(void *chat);
extern CHATBool ciCheckFiltersForID(void *chat, __int32 ID);
extern void ciCleanupFilters(void *chat);
extern __int32 ciAddJOINFilter(void *chat, char const *channel, void (*callback)(void *, CHATBool, CHATEnterResult, char const *, void *), void *param, chatChannelCallbacks *callbacks, char const *password);
extern __int32 ciAddNAMESFilter(void *chat, char const *channel, void (*callback)(void *, CHATBool, char const *, __int32, char const **, __int32 *, void *), void *param);
extern __int32 ciAddGETKEYFilter(void *chat, char const *cookie, __int32 num, char const **keys, char const *channel, void (*callback)(void *, CHATBool, char const *, __int32, char const **, char const **, void *), void *param);
