#if 0
/* ---------- headers */

#include "decomp.h"
#include <winver.h>
#include <winnetwk.h>
#include <verrsrc.h>
#include <realtimeapiset.h>
#include <processenv.h>
#include <wnnc.h>
#include <wow64apiset.h>
#include <utilapiset.h>
#include <winuser.h>
#include <GSLobby\GamespySDK\peer\peer.h>
#include <GSLobby\GamespySDK\serverbrowsing\sb_serverbrowsing.h>
#include <ime_cmodes.h>
#include <GSLobby\GamespySDK\nonport.h>
#include <winsock.h>
#include <sysinfoapi.h>
#include <windows.h>
#include <winapifamily.h>
#include <time.h>
#include <threadpoolapiset.h>
#include <sdkddkver.h>
#include <time.inl>
#include <excpt.h>
#include <stdlib.h>
#include <stringapiset.h>
#include <limits.h>
#include <libloaderapi.h>
#include <tvout.h>
#include <interlockedapi.h>
#include <winbase.h>
#include <string.h>
#include <handleapi.h>
#include <apisetcconv.h>
#include <crtdefs.h>
#include <imm.h>
#include <minwinbase.h>
#include <sal.h>
#include <GSLobby\GamespySDK\serverbrowsing\sb_internal.h>
#include <concurrencysal.h>
#include <GSLobby\GamespySDK\darray.h>
#include <vadefs.h>
#include <synchapi.h>
#include <poppack.h>
#include <guiddef.h>
#include <GSLobby\GamespySDK\hashtable.h>
#include <stdarg.h>
#include <windef.h>
#include <minwindef.h>
#include <specstrings.h>
#include <GSLobby\GamespySDK\peer\peerMain.h>
#include <specstrings_strict.h>
#include <GSLobby\GamespySDK\pinger\pinger.h>
#include <specstrings_undef.h>
#include <driverspecs.h>
#include <sdv_driverspecs.h>
#include <inaddr.h>
#include <stralign.h>
#include <namespaceapi.h>
#include <winsvc.h>
#include <errhandlingapi.h>
#include <winerror.h>
#include <securitybaseapi.h>
#include <winreg.h>
#include <reason.h>
#include <consoleapi.h>
#include <wingdi.h>
#include <pshpack8.h>
#include <timezoneapi.h>
#include <ioapiset.h>
#include <memoryapi.h>
#include <GSLobby\GamespySDK\qr2\qr2.h>
#include <GSLobby\GamespySDK\qr2\qr2regkeys.h>
#include <GSLobby\GamespySDK\peer\peerCallbacks.h>
#include <GSLobby\GamespySDK\chat\chat.h>
#include <winnt.h>
#include <ctype.h>
#include <apiset.h>
#include <GSLobby\GamespySDK\serverbrowsing\sb_crypt.h>
#include <processthreadsapi.h>
#include <profileapi.h>
#include <systemtopologyapi.h>
#include <heapapi.h>
#include <bemapiset.h>
#include <threadpoollegacyapiset.h>
#include <processtopologyapi.h>
#include <assert.h>
#include <debugapi.h>
#include <fibersapi.h>
#include <kernelspecs.h>
#include <basetsd.h>
#include <mcx.h>
#include <pshpack1.h>
#include <winnls.h>
#include <datetimeapi.h>
#include <namedpipeapi.h>
#include <securityappcontainer.h>
#include <wincon.h>
#include <fileapi.h>
#include <jobapi.h>
#include <pshpack2.h>
#include <wtime.inl>
#include <ktmtypes.h>
#include <pshpack4.h>

/* ---------- constants */

/* ---------- definitions */

struct piCallbackData
{
    piCallbackType type; // 0x0
    PEERBool success; // 0x4
    void *callback; // 0x8
    void *callbackParam; // 0xC
    void *params; // 0x10
    __int32 ID; // 0x14
    PEERBool inCall; // 0x18
};
static_assert(sizeof(piCallbackData) == 28, "Invalid piCallbackData size");

struct piCallbackFuncs
{
    piCallbackType type; // 0x0
    PEERBool (*copy)(void *, void *); // 0x4
    void (*free)(void *); // 0x8
    void (*call)(void *, piCallbackData *); // 0xC
};
static_assert(sizeof(piCallbackFuncs) == 16, "Invalid piCallbackFuncs size");

typedef piGlobalGlobalKeyChangedParams piGlobalKeyChangedParams;

struct piConnectParams
{
    __int32 dummy; // 0x0
};
static_assert(sizeof(piConnectParams) == 4, "Invalid piConnectParams size");

struct piJoinRoomParams
{
    PEERJoinResult result; // 0x0
    RoomType roomType; // 0x4
};
static_assert(sizeof(piJoinRoomParams) == 8, "Invalid piJoinRoomParams size");

struct piListGroupRoomsParams
{
    __int32 groupID; // 0x0
    _SBServer *server; // 0x4
    char *name; // 0x8
    __int32 numWaiting; // 0xC
    __int32 maxWaiting; // 0x10
    __int32 numGames; // 0x14
    __int32 numPlaying; // 0x18
};
static_assert(sizeof(piListGroupRoomsParams) == 28, "Invalid piListGroupRoomsParams size");

struct piListingGamesParams
{
    char *name; // 0x0
    _SBServer *server; // 0x4
    PEERBool staging; // 0x8
    __int32 msg; // 0xC
    __int32 progress; // 0x10
};
static_assert(sizeof(piListingGamesParams) == 20, "Invalid piListingGamesParams size");

struct piNickErrorParams
{
    __int32 type; // 0x0
    char *nick; // 0x4
};
static_assert(sizeof(piNickErrorParams) == 8, "Invalid piNickErrorParams size");

struct piEnumPlayersParams
{
    RoomType roomType; // 0x0
    __int32 index; // 0x4
    char *nick; // 0x8
    __int32 flags; // 0xC
};
static_assert(sizeof(piEnumPlayersParams) == 16, "Invalid piEnumPlayersParams size");

struct piGetPlayerProfileIDParams
{
    char *nick; // 0x0
    __int32 profileID; // 0x4
};
static_assert(sizeof(piGetPlayerProfileIDParams) == 8, "Invalid piGetPlayerProfileIDParams size");

struct piGetPlayerIPParams
{
    char *nick; // 0x0
    unsigned __int32 IP; // 0x4
};
static_assert(sizeof(piGetPlayerIPParams) == 8, "Invalid piGetPlayerIPParams size");

struct piRoomMessageParams
{
    RoomType roomType; // 0x0
    char *nick; // 0x4
    char *message; // 0x8
    MessageType messageType; // 0xC
};
static_assert(sizeof(piRoomMessageParams) == 16, "Invalid piRoomMessageParams size");

struct piRoomUTMParams
{
    RoomType roomType; // 0x0
    char *nick; // 0x4
    char *command; // 0x8
    char *parameters; // 0xC
    PEERBool authenticated; // 0x10
};
static_assert(sizeof(piRoomUTMParams) == 20, "Invalid piRoomUTMParams size");

struct piRoomNameChangedParams
{
    RoomType roomType; // 0x0
};
static_assert(sizeof(piRoomNameChangedParams) == 4, "Invalid piRoomNameChangedParams size");

struct piRoomModeChangedParams
{
    RoomType roomType; // 0x0
    CHATChannelMode mode; // 0x4
};
static_assert(sizeof(piRoomModeChangedParams) == 32, "Invalid piRoomModeChangedParams size");

struct piPlayerMessageParams
{
    char *nick; // 0x0
    char *message; // 0x4
    MessageType messageType; // 0x8
};
static_assert(sizeof(piPlayerMessageParams) == 12, "Invalid piPlayerMessageParams size");

struct piPlayerUTMParams
{
    char *nick; // 0x0
    char *command; // 0x4
    char *parameters; // 0x8
    PEERBool authenticated; // 0xC
};
static_assert(sizeof(piPlayerUTMParams) == 16, "Invalid piPlayerUTMParams size");

struct piReadyChangedParams
{
    char *nick; // 0x0
    PEERBool ready; // 0x4
};
static_assert(sizeof(piReadyChangedParams) == 8, "Invalid piReadyChangedParams size");

struct piGameStartedParams
{
    unsigned __int32 IP; // 0x0
    char *message; // 0x4
};
static_assert(sizeof(piGameStartedParams) == 8, "Invalid piGameStartedParams size");

struct piPlayerJoinedParams
{
    RoomType roomType; // 0x0
    char *nick; // 0x4
};
static_assert(sizeof(piPlayerJoinedParams) == 8, "Invalid piPlayerJoinedParams size");

struct piPlayerLeftParams
{
    RoomType roomType; // 0x0
    char *nick; // 0x4
    char *reason; // 0x8
};
static_assert(sizeof(piPlayerLeftParams) == 12, "Invalid piPlayerLeftParams size");

struct piKickedParams
{
    RoomType roomType; // 0x0
    char *nick; // 0x4
    char *reason; // 0x8
};
static_assert(sizeof(piKickedParams) == 12, "Invalid piKickedParams size");

struct piNewPlayerListParams
{
    RoomType roomType; // 0x0
};
static_assert(sizeof(piNewPlayerListParams) == 4, "Invalid piNewPlayerListParams size");

struct piPlayerChangedNickParams
{
    RoomType roomType; // 0x0
    char *oldNick; // 0x4
    char *newNick; // 0x8
};
static_assert(sizeof(piPlayerChangedNickParams) == 12, "Invalid piPlayerChangedNickParams size");

struct piPlayerInfoParams
{
    RoomType roomType; // 0x0
    char *nick; // 0x4
    unsigned __int32 IP; // 0x8
    __int32 profileID; // 0xC
};
static_assert(sizeof(piPlayerInfoParams) == 16, "Invalid piPlayerInfoParams size");

struct piDisconnectedParams
{
    char *reason; // 0x0
};
static_assert(sizeof(piDisconnectedParams) == 4, "Invalid piDisconnectedParams size");

struct piPingParams
{
    char *nick; // 0x0
    __int32 ping; // 0x4
};
static_assert(sizeof(piPingParams) == 8, "Invalid piPingParams size");

struct piCrossPingParams
{
    char *nick1; // 0x0
    char *nick2; // 0x4
    __int32 crossPing; // 0x8
};
static_assert(sizeof(piCrossPingParams) == 12, "Invalid piCrossPingParams size");

struct piChangeNickParams
{
    char *oldNick; // 0x0
    char *newNick; // 0x4
};
static_assert(sizeof(piChangeNickParams) == 8, "Invalid piChangeNickParams size");

struct piGlobalGlobalKeyChangedParams
{
    RoomType roomType; // 0x0
    char *nick; // 0x4
    char *key; // 0x8
    char *value; // 0xC
};
static_assert(sizeof(piGlobalGlobalKeyChangedParams) == 16, "Invalid piGlobalGlobalKeyChangedParams size");

struct piRoomKeyChangedParams
{
    RoomType roomType; // 0x0
    char *nick; // 0x4
    char *key; // 0x8
    char *value; // 0xC
};
static_assert(sizeof(piRoomKeyChangedParams) == 16, "Invalid piRoomKeyChangedParams size");

struct piGetGlobalKeysParams
{
    char *nick; // 0x0
    __int32 num; // 0x4
    char **keys; // 0x8
    char **values; // 0xC
};
static_assert(sizeof(piGetGlobalKeysParams) == 16, "Invalid piGetGlobalKeysParams size");

struct piGetRoomKeysParams
{
    RoomType roomType; // 0x0
    char *nick; // 0x4
    __int32 num; // 0x8
    char **keys; // 0xC
    char **values; // 0x10
};
static_assert(sizeof(piGetRoomKeysParams) == 20, "Invalid piGetRoomKeysParams size");

struct piPlayerFlagsChangedParams
{
    RoomType roomType; // 0x0
    char *nick; // 0x4
    __int32 oldFlags; // 0x8
    __int32 newFlags; // 0xC
};
static_assert(sizeof(piPlayerFlagsChangedParams) == 16, "Invalid piPlayerFlagsChangedParams size");

struct piAuthenticateCDKeyParams
{
    __int32 result; // 0x0
    char *message; // 0x4
};
static_assert(sizeof(piAuthenticateCDKeyParams) == 8, "Invalid piAuthenticateCDKeyParams size");

/* ---------- prototypes */

extern void piAddConnectCallback(void *peer, PEERBool success, void (*callback)(void *, PEERBool, void *), void *param, __int32 opID);
extern void piAddJoinRoomCallback(void *peer, PEERBool success, PEERJoinResult result, RoomType roomType, void (*callback)(void *, PEERBool, PEERJoinResult, RoomType, void *), void *param, __int32 opID);
extern void piAddListGroupRoomsCallback(void *peer, PEERBool success, __int32 groupID, _SBServer *server, char const *name, __int32 numWaiting, __int32 maxWaiting, __int32 numGames, __int32 numPlaying, void (*callback)(void *, PEERBool, __int32, _SBServer *, char const *, __int32, __int32, __int32, __int32, void *), void *param, __int32 opID);
extern void piAddListingGamesCallback(void *peer, PEERBool success, _SBServer *server, __int32 msg);
